

//Array of Objects

const quiz = [
    
    {
        q: "1. Запрещается остановка и стоянка:",
        img: "Question/1/1.jpg",
        answer: 3,
        options: [
            { text: "На пешеходных переходах и ближе 5 м от них.", img: "" },
            { text: "В местах, где движение транспорта мешает движению пешеходов.", img: "" },
            { text: "На железнодорожных переездах.", img: "" },
            { text: "Во всех перечисленных случаях.", img: "" },
            { text: "При выезде из дворов.", img: "" }
        ]
    },
    {
        q: "2. Водитель какого транспортного средства нарушил правила стоянки?",
        img: "Question/2/2.jpg",
        answer: 1,
        options: [
            { text: "Водители всех транспортных средств.", img: "" },
            { text: "Водитель грузового автомобиля.", img: "" },
            { text: "Водитель легкового автомобиля.", img: "" },
            { text: "Водитель легкового автомобиля.", img: "" }
        ]
    },
    {
        q: "3. Указанный дорожный знак запрещает движение:",
        img: "Question/3/3.jpg",
        answer: 1,
        options: [
            { text: "Только легковых автомобилей.", img: "" },
            { text: "Всех механических транспортных средств.", img: "" },
            { text: "Всех автомобилей.", img: "" }
        ]
    },
    {
        q: "4. Вторым проедет перекресток:",
        img: "Question/4/4.jpg",
        answer: 1,
        options: [
            { text: "Зеленый автомобиль.", img: "" },
            { text: "Синий автомобиль одновременно с желтым.", img: "" },
            { text: "Красный автомобиль.", img: "" }
        ]
    },
    {
        q: "5. Транспортные средства проедут перекресток в следующем порядке:",
        img: "Question/5/5.jpg",
        answer: 0,
        options: [
            { text: "Трамвай, легковой автомобиль, автобус.", img: "" },
            { text: "Трамвай, автобус, легковой автомобиль.", img: "" },
            { text: "Легковой автомобиль, автобус, трамвай.", img: "" }
        ]
    },
    {
        q: "6. С какой максимальной скоростью разрешено движение при буксировке на гибкой сцепке?",
        img: "Question/6/6.jpg",
        answer: 2,
        options: [
            { text: "60 км/ч.", img: "" },
            { text: "30 км/ч.", img: "" },
            { text: "50 км/ч.", img: "" },
            { text: "70 км/ч.", img: "" },
            { text: "40 км/ч.", img: "" }
        ]
    },
    {
        q: "7. На каком рисунке водитель подает сигнал предупреждения о повороте налево?",
        img: "Question/7/7.jpg",
        answer: 2,
        options: [
            { text: "3", img: "" },
            { text: "2", img: "" },
            { text: "1", img: "" }
        ]
    },
    {
        q: "8. Разворот запрещается:",
        img: "Question/8/8.jpg",
        answer: 4,
        options: [
            { text: "При видимости дороги менее 100 м хотя бы в одном направлении.", img: "" },
            { text: "На пешеходных переходах и в тоннелях.", img: "" },
            { text: "На мостах, путепроводах, эстакадах и под ними.", img: "" },
            { text: "На железнодорожных переездах.", img: "" },
            { text: "Во всех перечисленных случаях.", img: ""}
        ]
    },
    {
        q: "9. Как транспортировать пострадавшего с закрытой травмой живота?",
        img: "Question/9/9.jpg",
        answer: 0,
        options: [
            { text: "В лежачем положении с холодом на месте ушиба (лед. Примочка).", img: "" },
            { text: "В лежачем положении на боку или спине с горячей грелкой на месте ушиба.", img: "" },
            { text: "В положении \"полусидя\", колени максимально приближены к туловищу.", img: "" },
            { text: "Во всех перечисленных случаях.", img: "" }
        ]
    },
    {
        q: "10. Разрешается ли эксплуатация транспортных средств с неопломбированным спидометровым оборудованием?",
        img: "Question/10/10.jpg",
        answer: 0,
        options: [
            { text: "Разрешается только автомобилей, мотоциклов и мопедов, принадлежащих индивидуальным владельцам.", img: "" },
            { text: "Разрешается.", img: "" },
            { text: "Запрещается.", img: "" }
        ]
    }    
];