

//Array of Objects

const quiz = [
    
    {
        q: "1. На каком рисунке пешеходы двигаются без нарушения правил?",
        img: "Question/1/1.jpg",
        answer: 1,
        options: [
            { text: "На правом.", img: "" },
            { text: "На обоих рисунках.", img: "" },
            { text: "На левом.", img: "" }
        ]
    },
    {
        q: "2. Этот знак называется?",
        img: "Question/2/2.jpg",
        answer: 2,
        options: [
            { text: "Предварительный указатель выезда на полосу встречного движения.", img: "" },
            { text: "Предварительный указатель объезда препятствий.", img: "" },
            { text: "Предварительный указатель перестроения на другую проезжую часть.", img: "" }
        ]
    },
    {
        q: "3. Что обозначают такие стрелы на проезжей части?",
        img: "Question/3/3.jpg",
        answer: 1,
        options: [
            { text: "Указывают направление опасного поворота дороги.", img: "" },
            { text: "Предупреждают о приближении к сужению проезжей части.", img: "" },
            { text: "Предупреждают водителя о приближении к опасному участку дороги.", img: "" }
        ]
    },
    {
        q: "4. Сигналом остановки поезда служит:",
        img: "Question/4/4.jpg",
        answer: 1,
        options: [
            { text: "Вытянутая вперед рука.", img: "" },
            { text: "Круговое движение руки (днем с лоскутом яркой материал или каким-либо хорошо видимым предметом, ночью с факелом или фонарем).", img: "" },
            { text: "Поднятая над головой рука с жезлом или красным флагом.", img: "" },
            { text: "Покачивание вверх и вниз вытянутой вперед рукой.", img: "" }
        ]
    },
    {
        q: "5. Транспортные средства проедут перекресток в следующем порядке:",
        img: "Question/5/5.jpg",
        answer: 0,
        options: [
            { text: "Синий, зеленый, красный автомобили.", img: "" },
            { text: "Синий, пропустит красный, а затем закончит поворот; зеленый автомобиль.", img: "" },
            { text: "Красный, синий, зеленый автомобили.", img: "" },
            { text: "Зеленый, красный, синий автомобили.", img: "" }
        ]
    },
    {
        q: "6. Преимущество в движении имеет:",
        img: "Question/6/6.jpg",
        answer: 2,
        options: [
            { text: "Синий автомобиль, т.к. красный изменяет направление движения влево.", img: "" },
            { text: "Синий автомобиль, т.к. при взаимном перестроении он находится слева.", img: "" },
            { text: "Красный автомобиль, т.к. при взаимном перестроении он находится справа.", img: "" }
        ]
    },
    {
        q: "7. Пересечет перекресток первым:",
        img: "Question/7/7.jpg",
        answer: 2,
        options: [
            { text: "Красный автомобиль.", img: "" },
            { text: "Зеленый автомобиль.", img: "" },
            { text: "Синий автомобиль.", img: "" }
        ]
    },
    {
        q: "8. Ближе какого расстояния запрещается остановка и стоянка от остановочных площадок, а при их отсутствии, от указателя остановки маршрутных транспортных средств или такси, если это создает помехи их движению?",
        img: "Question/8/8.jpg",
        answer: 2,
        options: [
            { text: "5 м.", img: "" },
            { text: "25 м.", img: "" },
            { text: "15 м.", img: "" },
            { text: "20 м.", img: "" },
            { text: "10 м.", img: "" }
        ]
    },
    {
        q: "9. Как влияет утомление на внимание и реакцию водителя?",
        img: "Question/9/9.jpg",
        answer: 2,
        options: [
            { text: "Внимание и реакция водителя повышаются.", img: "" },
            { text: "Не влияет на внимание и реакцию водителя.", img: "" },
            { text: "Внимание и реакция водителя снижаются.", img: "" }
        ]
    },
    {
        q: "10. В каких случаях водители велосипедов и мопедов должны уступать дорогу транспортным средствам в местах пересечения велосипедной дорожки с дорогой?",
        img: "Question/10/10.jpg",
        answer: 0,
        options: [
            { text: "Во всех случаях на нерегулируемом пересечении вне перекрестков.", img: "" },
            { text: "Водитель велосипеда и мопеда имеет преимущество в указанном месте.", img: "" },
            { text: "При приближении транспортного средства справа.", img: "" }
        ]
    }    
];