

//Array of Objects

const quiz = [
    
    {
        q: "1. Считается ли перекрестком выезд на дорогу с автозаправочной станции?",
        img: "Question/1/1.jpg",
        answer: 0,
        options: [
            { text: "Не считается", img: "" },
            { text: "Считается", img: "" }
        ]
    },
    {
        q: "2. Какой знак обозначает «Гостиницу» или «Мотель»?",
        img: "Question/2/2.jpg",
        answer: 4,
        options: [
            { text: "5", img: "" },
            { text: "1", img: "" },
            { text: "2", img: "" },
            { text: "4", img: "" },
            { text: "3", img: "" }
        ]
    },
    {
        q: "3. На какие транспортные средства распространяется действие знаков?",
        img: "Question/3/3.jpg",
        answer: 0,
        options: [
            { text: "На легковые автомобили и грузовые автомобили с разрешенной максимальной массой менее или равной 3,5 т.", img: "" },
            { text: "На легковые автомобили и мотоциклы.", img: "" },
            { text: "Только на легковые автомобили.", img: "" }
        ]
    },
    {
        q: "4. Последним проедет перекресток?",
        img: "Question/4/4.jpg",
        answer: 0,
        options: [
            { text: "Красный автомобиль.", img: "" },
            { text: "Зеленый автомобиль.", img: "" },
            { text: "Синий автомобиль.", img: "" }
        ]
    },
    {
        q: "5. Красный автомобиль проедет перекресток:",
        img: "Question/5/5.jpg",
        answer: 1,
        options: [
            { text: "Вторым.", img: "" },
            { text: "Первым.", img: "" }
        ]
    },
    {
        q: "6. Разрешается ли водителю междугородного автобуса вне населенных пунктов превышать скорость 80 км/ч?",
        img: "Question/6/6.jpg",
        answer: 1,
        options: [
            { text: "Разрешается только при движении по дороге, имеющей две и более полосы для движения в данном направлении.", img: "" },
            { text: "Разрешается.", img: "" },
            { text: "Запрещается.", img: "" }
        ]
    },
    {
        q: "7. Разрешена ли остановка в этом месте?",
        img: "Question/7/7.jpg",
        answer: 0,
        options: [
            { text: "Запрещена.", img: "" },
            { text: "Разрешена.", img: "" }
        ]
    },
    {
        q: "8. Где разрешается длительная стоянка транспортных средств (отдых, ночлег и т.д.) вне населенного пункта?",
        img: "Question/8/8.jpg",
        answer: 3,
        options: [
            { text: "На левой стороне, только соблюдая все меры безопасности движения.", img: "" },
            { text: "На правой стороне проезжей части дороги, но так, чтобы не препятствовать движению других транспортных средств.", img: "" },
            { text: "На обочине дороге.", img: "" },
            { text: "На площадках для стоянки или за пределами дороги.", img: "" }
        ]
    },
    {
        q: "9. В каких случаях запрещена буксировка?",
        img: "Question/9/9.jpg",
        answer: 1,
        options: [
            { text: "В гололедицу на жесткой сцепке.", img: "" },
            { text: "В гололедицу на гибкой сцепке.", img: "" },
            { text: "Мотоциклами с боковым прицепом.", img: "" }
        ]
    },
    {
        q: "10. Какие из этих линий разрешают остановку маршрутным транспортным средствам?",
        img: "Question/10/10.jpg",
        answer: 2,
        options: [
            { text: "А.", img: "" },
            { text: "Б.", img: "" },
            { text: "А, Б, В.", img: "" },
            { text: "В.", img: "" }
        ]
    }    
];