

//Array of Objects

const quiz = [
        {
            q: "1. Как должен поступить пешеход находящийся на краю проезжей части при приближении транспортного средства с включенным проблесковым маячком и специальным звуковым сигналом?",
            img: "Question/1/1.jpg",
            answer: 0,
            options: [
                { text: "Перейти проезжую часть, если он находится на пешеходном переходе", img: "" },
                { text: "Как можно скорее перейти проезжую часть", img: "" },
                { text: "Воздержаться от перехода проезжей части", img: "" }
            ]
        },
        {
            q: "2. Какой из знаков указывает протяженность опасного участка дороги, обозначенного предупреждающими знаками?",
            img: "Question/2/2.jpg",
            answer: 0,
            options: [
                { text: "4", img: "" },
                { text: "5", img: "" },
                { text: "3", img: "" },
                { text: "1", img: "" },
                { text: "2", img: "" }
            ]
        },
        {
            q: "3. Эта дорожная разметка:",
            img: "Question/3/3.jpg",
            answer: 0,
            options: [
                { text: "Обозначает остановку маршрутных транспортных средств и стоянки такси.", img: "" },
                { text: "Обозначает места, где запрещена остановка механических транспортных средств.", img: "" },
                { text: "Обозначает стояночные места, где указаны способы постановки механических транспортных средств на около тротуарной стоянке.", img: "" }
            ]
        },
        {
            q: "4. Кто из водителей имеет право напервоочередное движение?",
            img: "Question/4/4.jpg",
            answer: 0,
            options: [
                { text: "Водитель автомобиля.", img: "" },
                { text: "Водитель мотоцикла.", img: "" }
            ]
        },
        {
            q: "5. Два попеременно мигающих красных сигнала имеют следующее значение:",
            img: "Question/5/5.jpg",
            answer: 0,
            options: [
                { text: "Запрещают движение.", img: "" },
                { text: "Информируют других водителей о выезде на проезжую часть специальных транспортных средств.", img: "" },
                { text: "Разрешают движение с особой осторожностью.", img: "" }
            ]
        },
        {
            q: "6. Разрешается ли открывать шлагбаум или объезжать его?",
            img: "Question/6/6.jpg",
            answer: 1,
            options: [
                { text: "Разрешается если светофор выключен.", img: "" },
                { text: "Запрещается.", img: "" }
            ]
        },
        {
            q: "7. Вы движетесь по дороге с двухсторонним движением, имеющей три полосы. В каком случае разрешается выезжать на среднюю полосу?",
            img: "Question/7/7.jpg",
            answer: 2,
            options: [
                { text: "Только для поворота налево или разворота.", img: "" },
                { text: "Только для обгона.", img: "" },
                { text: "Во всех перечисленных случаях.", img: "" },
                { text: "Только для объезда.", img: "" }
            ]
        },
        {
            q: "8. С какой максимальной скоростью разрешается движение на данном участке дороги при наличии на автомобиле опознавательного знака?",
            img: "Question/8/8.jpg",
            answer: 0,
            options: [
                { text: "70км/ч.", img: "" },
                { text: "90км/ч.", img: "" },
                { text: "100км/ч.", img: "" }
            ]
        },
        {
            q: "9. Каким видом транспорта нужно перевозить пострадавшего с черепно-мозговой травмой средней тяжести?",
            img: "Question/9/9.jpg",
            answer: 1,
            options: [
                { text: "Попутным легковым автомобилем.", img: "" },
                { text: "Только машиной скорой медицинской помощи.", img: "" },
                { text: "Попутным грузовым автомобилем.", img: "" }
            ]
        },
        {
            q: "10. Обязан ли водитель уступить дорогу пешеходам в данном месте?",
            img: "Question/10/10.jpg",
            answer: 0,
            options: [
                { text: "Да.", img: "" },
                { text: "Нет.", img: "" }
            ]
        }    
];