

//Array of Objects

const quiz = [
    {
        q: "1. В каком случае разрешается посадка и высадка пассажиров со стороны проезжей части?",
        img: "Question/1/1.jpg",
        answer: 1,
        options: [
            { text: "При вынужденной остановке транспортного средства.", img: "" },
            { text: "Если это невозможно сделать со стороны тротуара или обочины и при условии, что это будет безопасно и создает помех другим участникам движения.", img: "" },
            { text: "По усмотрению водителя при условии, что это будет безопасно и не создает помех другим участникам движения.", img: "" }
        ]
    },
    {
        q: "2. В каком направлении разрешается движение грузовому автомобилю?",
        img: "Question/2/2.jpg",
        answer: 2,
        options: [
            { text: "Только налево", img: "" },
            { text: "Только направо", img: "" },
            { text: "Направо, налево и в обратном направлении", img: "" }
        ]
    },
    {
        q: "3. Эта дорожная разметка обозначает?",
        img: "Question/3/3.jpg",
        answer: 2,
        options: [
            { text: "Приближение к пересечению дорог, на котором движение разрешается во всех направлениях.", img: "" },
            { text: "Запрещается движение в указанных направлениях.", img: "" },
            { text: "Указывает разрешенные на перекрестке направления движения по полосам.", img: "" }
        ]
    },
    {
        q: "4. Транспортные средства проедут перекресток в следующем порядке:",
        img: "Question/4/4.jpg",
        answer: 2,
        options: [
            { text: "Легковой автомобиль, автобус, велосипед.", img: "" },
            { text: "Автобус, велосипед, легковой автомобиль.", img: "" },
            { text: "Велосипед, автобус, легковой автомобиль.", img: "" },
            { text: "Автобус, легковой автомобиль, велосипед.", img: "" }
        ]
    },
    {
        q: "5. Как должен поступить водитель красного автомобиля в ситуации, показанной на рисунке?",
        img: "Question/5/5.jpg",
        answer: 1,
        options: [
            { text: "Включить указатель левого поворота и освободить правый ряд.", img: "" },
            { text: "Включить указатель правого поворота и повернуть направо.", img: "" },
            { text: "Дождаться разрешающего сигнала светофора и проехать прямо.", img: "" }
        ]
    },
    {
        q: "6. Перед началом движения после остановки перед железнодорожным переездом водитель должен:",
        img: "Question/6/6.jpg",
        answer: 2,
        options: [
            { text: "Проехать переезд на первой передаче.", img: "" },
            { text: "Начать движение через переезд со скоростью, обеспечивающей безопасность движения.", img: "" },
            { text: "Убедиться в отсутствии приближающегося поезда.", img: "" }
        ]
    },
    {
        q: "7. С какой максимальной скоростью разрешается движение автобусам (не междугородним) на участках дорог, обозначенных таким дорожным знаком?",
        img: "Question/7/7.jpg",
        answer: 3,
        options: [
            { text: "50 км/ч.", img: "" },
            { text: "60 км/ч.", img: "" },
            { text: "90 км/ч.", img: "" },
            { text: "80 км/ч.", img: "" },
            { text: "70 км/ч.", img: "" }
        ]
    },
    {
        q: "8. Водители каких транспортных средств нарушили правила стоянки?",
        img: "Question/8/8.jpg",
        answer: 0,
        options: [
            { text: "Оба водителя.", img: "" },
            { text: "Водитель грузового автомобиля.", img: "" },
            { text: "Водитель легкового автомобиля.", img: "" }
        ]
    },
    {
        q: "9. Чем опасно резкое открытие дроссельной заслонки карбюратора при движении на скользкой дороге?",
        img: "Question/9/9.jpg",
        answer: 1,
        options: [
            { text: "Значительно возрастет расход топлива.", img: "" },
            { text: "Может возникнуть боковой занос автомобиля.", img: "" },
            { text: "Двигатель превысит максимальную частоту вращения коленчатого вала.", img: "" },
            { text: "Двигатель заглохнет.", img: "" }
        ]
    },
    {
        q: "10. Таким опознавательным знаком обозначаются автомобили:",
        img: "Question/10/10.jpg",
        answer: 2,
        options: [
            { text: "Управляемые инвалидами.", img: "" },
            { text: "Перевозящими опасные грузы.", img: "" },
            { text: "Управляемые глухонемыми и глухими водителями.", img: "" },
            { text: "Управляемые водителями, имеющими водительский стаж до 2-х лет.", img: "" }
        ]
    }    
];