

//Array of Objects

const quiz = [
    
    {
        q: '1. Какой знак предупреждает что впереди имеется закругление дороги малого радиуса?',
        img: 'Question/1/1.jpg',
        answer: 1,
        options: [
            { text: 'b', img: '' },
            { text: 'e', img: '' },
            { text: 'c', img: '' },
            { text: 'a', img: '' },
            { text: 'd', img: '' }
        ]
    },
    {
        q: '2. С какой целью применяется этот дорожный знак?',
        img: 'Question/2/2.jpg',
        answer: 0,
        options: [
            { text: 'Для принудительного снижения скорости движения', img: '' },
            { text: 'Для резкого торможения', img: '' },
            { text: 'Для принятия меры предосторожности', img: '' }
        ]
    },
    {
        q: '3. При наличии каких знаков водитель пользуется преимуществом, если встречный разъезд затруднен препятствием?',
        img: 'Question/3/3.jpg',
        answer: 1,
        options: [
            { text: 'b и c', img: '' },
            { text: 'b и d', img: '' },
            { text: 'Только c', img: '' },
            { text: 'a и c', img: '' }
        ]
    },
    {
        q: '4. Какие знаки являются информационно-указательным?',
        img: 'Question/4/4.jpg',
        answer: 2,
        options: [
            { text: 'a и b', img: '' },
            { text: 'a и d', img: '' },
            { text: 'b и c', img: '' },
            { text: 'c и d', img: '' }
        ]
    },
    {
        q: '5. Что обозначает вертикальная разметка, нанесённая на боковое ограждение дороги?',
        img: 'Question/5/5.jpg',
        answer: 2,
        options: [
            { text: 'Обозначает приближении к опасному перекрестку', img: '' },
            { text: 'Обозначает приближении к железнодорожному переезду', img: '' },
            { text: 'Обозначает боковые поверхности ограждений дорог на закруглениях малого радиуса, крутых спусках, других опасных участках', img: '' }
        ]
    },
    {
        q: '6. Поднятая вверх рука водителя мотоцикла является сигналом, информирующим Вас о его намерении:',
        img: 'Question/6/6.jpg',
        answer: 1,
        options: [
            { text: 'Повернуть направо', img: '' },
            { text: 'Об остановке', img: '' },
            { text: 'Продолжить движение прямо', img: '' }
        ]
    },
    {
        q: '7. Исключает ли антиблокировочная тормозная система (АБС) возможность возникновения заноса или сноса при прохождении поворота?',
        img: 'Question/7/7.jpg',
        answer: 0,
        options: [
            { text: 'Не исключает возможность возникновения сноса или заноса', img: '' },
            { text: 'Полностью исключает возможность только заноса', img: '' },
            { text: 'Это только предотвратит возможность скольжения автомобиля в сторону.', img: '' }
        ]
    },
    {
        q: '8. На повороте возник занос задней оси переднеприводного автомобиля. Ваши действия?',
        img: 'Question/8/8.jpg',
        answer: 1,
        options: [
            { text: 'Уменьшите подачу топлива, рулевым колесом стабилизируете движение', img: '' },
            { text: 'Слегка увеличите подачу топлива, корректируя направление движения рулевым колесом', img: '' },
            { text: 'Значительно увеличите подачу топлива, не меняя положения рулевого колеса', img: '' },
            { text: 'Притормозите и повернёте рулевое колесо в сторону заноса', img: '' }
        ]
    },
    {
        q: '9. Водитель автомобиля намерен развернуться:',
        img: 'Question/9/9.jpg',
        answer: 0,
        options: [
            { text: 'Выполняет разворот, уступив дорогу трамваю', img: '' },
            { text: 'Проедет перекресток первым', img: '' }
        ]
    },
    {
        q: '10. На рисунке изображен:',
        img: 'Question/10/10.jpg',
        answer: 0,
        options: [
            { text: 'Регулируемый перекресток', img: '' },
            { text: 'Нерегулируемый перекресток неравнозначных дорог', img: '' },
            { text: 'Нерегулируемый, равнозначный перекресток', img: '' }
        ]
    }    
];