

//Array of Objects

const quiz = [
    
    {
        q: "1. Какое расстояние транспортное средство, движущееся со скоростью 108 км/ч, преодолевает за 1 секунду?",
        img: "Question/1/1.jpg",
        answer: 2,
        options: [
            { text: "25 м", img: "" },
            { text: "15 м", img: "" },
            { text: "30 м", img: "" }
        ]
    },
    {
        q: "2. Вам разрешено продолжить движение на грузовом автомобиле с разрешенной максимальной массой более 3,5 т:",
        img: "Question/2/2.jpg",
        answer: 1,
        options: [
            { text: "Прямо и направо", img: "" },
            { text: "Только прямо", img: "" },
            { text: "Во всех направлениях", img: "" }
        ]
    },
    {
        q: "3. Допустимый суммарный люфт в рулевом управлении для автотранспортов категорий М3?",
        img: "Question/3/3.jpg",
        answer: 0,
        options: [
            { text: "20°", img: "" },
            { text: "25°", img: "" },
            { text: "10°", img: "" }
        ]
    },
    {
        q: "4. Этот знак информирует﻿:",
        img: "Question/4/4.jpg",
        answer: 0,
        options: [
            { text: "О выходе на трассу реверсивного движения", img: "" },
            { text: "Вы должны повернуть направо или налево", img: "" },
            { text: "Вправо и влево от перекрестка организовано одностороннее движение", img: "" }
        ]
    },
    {
        q: "5. Какой маневр Вам разрешается выполнить при наличии данной линии разметки?",
        img: "Question/5/5.jpg",
        answer: 3,
        options: [
            { text: "Объезд", img: "" },
            { text: "Обгон", img: "" },
            { text: "Разворот", img: "" },
            { text: "Все перечисленные маневры", img: "" }
        ]
    },
    {
        q: "6. Значения каких дорожных знаков отменяются сигналами светофора?",
        img: "Question/6/6.jpg",
        answer: 0,
        options: [
            { text: "Знаков приоритета", img: "" },
            { text: "Всех перечисленных", img: "" },
            { text: "Запрещающих знаков", img: "" },
            { text: "Предписывающих знаков", img: "" }
        ]
    },
    {
        q: "7. Привлечь внимание водителя обгоняемого автомобиля при движении в населенном пункте в светлое время суток можно:",
        img: "Question/7/7.jpg",
        answer: 2,
        options: [
            { text: "Любые из перечисленных способов", img: "" },
            { text: "Только совместной подачей звукового и светового сигнала", img: "" },
            { text: "Только кратковременным переключением фар ближнего света на дальний", img: "" },
            { text: "Только звуковым сигналом", img: "" }
        ]
    },
    {
        q: "8. В каком случае запрещается эксплуатация транспортного средства?",
        img: "Question/8/8.jpg",
        answer: 1,
        options: [
            { text: "Нарушена система зажигания", img: "" },
            { text: "Не работает звуковой сигнал", img: "" },
            { text: "Затруднен пуск двигателя", img: "" },
            { text: "Не работает указатель уровня топлива", img: "" }
        ]
    },
    {
        q: "9. Какое расстояние транспортное средство, движущееся со скоростью 72 км/ч, преодолевает за 1 секунду?",
        img: "Question/9/9.jpg",
        answer: 1,
        options: [
            { text: "25 м", img: "" },
            { text: "20 м", img: "" },
            { text: "15 м", img: "" }
        ]
    },
    {
        q: "10. В каких направлениях Вам можно продолжить движение?",
        img: "Question/10/10.jpg",
        answer: 0,
        options: [
            { text: "Направо, налево и в обратном направлении", img: "" },
            { text: "Только направо", img: "" },
            { text: "Налево и в обратном направлении", img: "" }
        ]
    }    
];