

//Array of Objects

const quiz = [
    
    {
        q: "1. Как должны двигаться пешеходы по проезжей части при отсутствии тротуара или обочины?",
        img: "Question/1/1.jpg",
        answer: 2,
        options: [
            { text: "В любом направлении.", img: "" },
            { text: "По обочине или краю проезжей части по ходу движения транспортных средств.", img: "" },
            { text: "По обочине или по краю проезжей части навстречу движению транспортных средств.", img: "" }
        ]
    },
    {
        q: "2. Эти знаки обозначают:",
        img: "Question/2/2.jpg",
        answer: 0,
        options: [
            { text: "Место стоянки в зоне 30 м для мотоколясок и автомобилей с опознавательным знаком \"Инвалид\".", img: "" },
            { text: "Место стоянки в зоне 30 м для транспортных средств, кроме мотоколясок.", img: "" },
            { text: "Место стоянки через 30 м для автомобилей с опознавательным знаком \"Инвалид\".", img: "" }
        ]
    },
    {
        q: "3. Какой из показанных знаков запрещает движение задним ходом?",
        img: "Question/3/3.jpg",
        answer: 0,
        options: [
            { text: "1", img: "" },
            { text: "2", img: "" },
            { text: "5", img: "" },
            { text: "4", img: "" },
            { text: "3", img: "" }
        ]
    },
    {
        q: "4. Автомобили проедут перекресток в следующем порядке:",
        img: "Question/4/4.jpg",
        answer: 1,
        options: [
            { text: "Красный, синий, зеленый.", img: "" },
            { text: "Красный въедет на перекресток и остановится, чтобы пропустить синий; зеленый; синий и красный заканчивают поворот.", img: "" },
            { text: "Зеленый, синий, красный.", img: "" }
        ]
    },
    {
        q: "5. В каком ответе правильно указана очередность проезда?",
        img: "Question/5/5.jpg",
        answer: 2,
        options: [
            { text: "Автобус, грузовой автомобиль, мотоцикл.", img: "" },
            { text: "Автобус, мотоцикл, грузовой автомобиль.", img: "" },
            { text: "Мотоцикл, автобус, грузовой автомобиль.", img: "" }
        ]
    },
    {
        q: "6. С какого возраста разрешается перевозить детей на переднем сиденье легкового автомобиля, не оборудованного специальным детским сиденьем?",
        img: "Question/6/6.jpg",
        answer: 3,
        options: [
            { text: "6 лет.", img: "" },
            { text: "5 лет.", img: "" },
            { text: "10 лет.", img: "" },
            { text: "12 лет.", img: "" },
            { text: "8 лет.", img: "" }
        ]
    },
    {
        q: "7. Что запрещается водителю, если он решил открыть двери транспортного средства и выйти из него?",
        img: "Question/7/7.jpg",
        answer: 0,
        options: [
            { text: "Запрещается открывать двери стоящего транспортного средства, если это угрожает безопасности и создает помехи другим участникам дорожного движения.", img: "" },
            { text: "Запрещается открывать двери стоящего транспортного средства на дорогах с интенсивным движением.", img: "" },
            { text: "Запрещается открывать двери водителя на дорогах с интенсивным движением. Покинуть свое место следует через дверь пассажира.", img: "" }
        ]
    },
    {
        q: "8. В каких местах из перечисленных запрещается остановка и стоянка транспортных средств?",
        img: "Question/8/8.jpg",
        answer: 1,
        options: [
            { text: "В местах выезда из ворот.", img: "" },
            { text: "Во всех указанных местах.", img: "" },
            { text: "В непосредственной близости от трамвайных путей, если это создает помехи движению трамваев.", img: "" },
            { text: "На трамвайных путях.", img: "" }
        ]
    },
    {
        q: "9. В чем опасность длительного торможения автомобиля с выключенной передачей на крутых затяжных спусках?",
        img: "Question/9/9.jpg",
        answer: 1,
        options: [
            { text: "Повышенный износ шин.", img: "" },
            { text: "Перегрев тормозов и отказ их в работе.", img: "" },
            { text: "Повышенный износ деталей сцепления.", img: "" }
        ]
    },
    {
        q: "10. Каким опознавательным знаком обозначается транспортное средство при перевозке групп детей?",
        img: "Question/10/10.jpg",
        answer: 0,
        options: [
            { text: "3", img: "" },
            { text: "2", img: "" },
            { text: "1", img: "" }
        ]
    }    
];