

//Array of Objects

const quiz = [
    
    {
        q: "1. К маршрутным транспортным средствам относятся:",
        img: "Question/1/1.jpg",
        answer: 0,
        options: [
            { text: "Автобусы, троллейбусы, трамваи и маршрутные такси, движущиеся по установленным маршрутам.", img: "" },
            { text: "Трамваи и троллейбусы.", img: "" },
            { text: "Автобусы и маршрутные такси.", img: "" }
        ]
    },
    {
        q: "2. Какой знак разрешает левый поворот?",
        img: "Question/2/2.jpg",
        answer: 4,
        options: [
            { text: "1", img: "" },
            { text: "4", img: "" },
            { text: "2", img: "" },
            { text: "5", img: "" },
            { text: "3", img: "" }
        ]
    },
    {
        q: "3. Разрешается ли автобусу движение по дороге, на которой установлен этот знак?",
        img: "Question/3/3.jpg",
        answer: 2,
        options: [
            { text: "Разрешается только автомобилю, разрешенная максимальная масса которого не более 3,5 т.", img: "" },
            { text: "Запрещается.", img: "" },
            { text: "Разрешается.", img: "" }
        ]
    },
    {
        q: "4. Последним проедет перекресток:",
        img: "Question/4/4.jpg",
        answer: 1,
        options: [
            { text: "Красный автомобиль.", img: "" },
            { text: "Синий автомобиль.", img: "" },
            { text: "Зеленый автомобиль.", img: "" }
        ]
    },
    {
        q: "5. Каким транспортным средствам разрешено движение?",
        img: "Question/5/5.jpg",
        answer: 0,
        options: [
            { text: "Желтому и красному автомобилям.", img: "" },
            { text: "Белому и зеленому автомобилю.", img: "" },
            { text: "Зеленому, красному и белому автомобилям.", img: "" }
        ]
    },
    {
        q: "6. Водители каких транспортных средств правильно остановились для высадки пассажиров?",
        img: "Question/6/6.jpg",
        answer: 2,
        options: [
            { text: "Водитель автобуса.", img: "" },
            { text: "Все водители.", img: "" },
            { text: "Водитель легкового автомобиля.", img: "" },
            { text: "Водитель мотоцикла.", img: "" }
        ]
    },
    {
        q: "7. С какой максимальной скоростью разрешается движение грузовых автомобилей с разрешенной максимальной массой более 3,5 т на участках дорог, обозначенных таким дорожным знаком?",
        img: "Question/7/7.jpg",
        answer: 4,
        options: [
            { text: "60 км/ч.", img: "" },
            { text: "70 км/ч.", img: "" },
            { text: "100 км/ч.", img: "" },
            { text: "90 км/ч.", img: "" },
            { text: "80 км/ч.", img: "" }
        ]
    },
    {
        q: "8. Как должен поступить водитель синего автомобиля?",
        img: "Question/8/8.jpg",
        answer: 1,
        options: [
            { text: "Проехать перекресток в намеченном направлении, не уступая дорогу желтому автомобилю, так как тот движется сзади.", img: "" },
            { text: "Снизить скорость - дать возможность желтому автомобилю завершив обгон, а затем повернуть налево.", img: "" },
            { text: "Немедленно перестроиться на полосу встречного движения.", img: "" }
        ]
    },
    {
        q: "9. Разрешается ли перевозка груза на грузовом автомобиле 'Газель' без соблюдения специальных правил, если высота автомобиля с грузом составляет 3,8 м от поверхности дороги?",
        img: "Question/9/9.jpg",
        answer: 1,
        options: [
            { text: "Нет.", img: "" },
            { text: "Да.", img: "" },
            { text: "Только по дорогам, на которых отсутствует необходимость двигаться под мостами или путепроводами.", img: "" }
        ]
    },
    {
        q: "10. Тормозная система считается неисправной, если нарушена герметичность пневматического привода, что вызывает падение давления воздуха при неработающем компрессоре за 30 мин., при свободном положении органов управления в МПа, более чем:",
        img: "Question/10/10.jpg",
        answer: 3,
        options: [
            { text: "0,025", img: "" },
            { text: "0,055", img: "" },
            { text: "0,035", img: "" },
            { text: "0,05", img: "" },
            { text: "0,06", img: "" }
        ]
    }    
];