

//Array of Objects

const quiz = [
    
    {
        q: "1. В каком случае водитель должен предоставить грузовой автомобиль работнику органов внутренних дел для буксировки транспортного средства, поврежденного при дорожно ­транспортном происшествии?",
        img: "Question/1/1.jpg",
        answer: 1,
        options: [
            { text: "По усмотрению водителя." },
            { text: "В любом случае, кроме транспортных средств, принадлежащих гражданам." },
            { text: "Только в случае, если буксировка будет осуществляться в попутном направлении." }
        ]
    },
    {
        q: "2. В каких направлениях, обозначенных стрелками разрешено движение?",
        img: "Question/2/2.jpg",
        answer: 2,
        options: [
            { text: "А и Б." },
            { text: "Б." },
            { text: "А." }
        ]
    },
    {
        q: "3. Что обозначает эта дорожная разметка?",
        img: "Question/3/3.jpg",
        answer: 3,
        options: [
            { text: "Обозначает полосу, предназначенную для движения автобусов и маршрутных такси (особо малых автобусов)." },
            { text: "Обозначает полосу, предназначенную для движения автобусов и троллейбусов." },
            { text: "Обозначает полосу, предназначенную только для движения автобусов." },
            { text: "Обозначает полосу, предназначенную только для движения маршрутных транспортных средств." }
        ]
    },
    {
        q: "4. Вторым проедет перекресток:",
        img: "Question/4/4.jpg",
        answer: 0,
        options: [
            { text: "Красный." },
            { text: "Желтый." },
            { text: "Синий." },
            { text: "Зеленый." }
        ]
    },
    {
        q: "5. В каком случае водитель мотоцикла повернул налево правильно?",
        img: "Question/5/5.jpg",
        answer: 1,
        options: [
            { text: "Выехал на перекресток, дождавшись разрешающего жеста регулировщика, закончил поворот." },
            { text: "Останавливается не выезжая на перекресток, ожидает жест регулировщика разрешающий поворот налево и заканчивает поворот." },
            { text: "Выехал на перекресток, пропустил грузовой автомобиль, закончил поворот." }
        ]
    },
    {
        q: "6. В каком направлении разрешается движение синему автомобилю?",
        img: "Question/6/6.jpg",
        answer: 1,
        options: [
            { text: "Прямо, налево и в обратном направлении." },
            { text: "Налево и в обратном направлении." },
            { text: "Только в обратном направлении." },
            { text: "Во всех направлениях." }
        ]
    },
    {
        q: "7. Когда должен быть подан предупредительный сигнал перед перестроением?",
        img: "Question/7/7.jpg",
        answer: 0,
        options: [
            { text: "Заблаговременно до начала выполнения маневра." },
            { text: "Непосредственно перед началом выполнения маневра." },
            { text: "Сразу после начала выполнения маневра." }
        ]
    },
    {
        q: "8. Где не должно оказаться транспортное средство при выезде с пересечения проезжих частей во время поворота?",
        img: "Question/8/8.jpg",
        answer: 2,
        options: [
            { text: "На левой полосе, если имеются не менее трех полос для движения в одном направлении." },
            { text: "На левой полосе, если свободна правая полоса." },
            { text: "На стороне встречного движения." },
            { text: "На левой полосе, если имеется две полосы для движения в одном направлении только грузовым автомобилям с разрешенной максимальной массой более 3.5 т." }
        ]
    },
    {
        q: "9. Вы приближаетесь к повороту дороги налево, он оказался более крутым, чем предполагалось. Вы должны:",
        img: "Question/9/9.jpg",
        answer: 2,
        options: [
            { text: "Увеличите скорость, чтобы быстрее пройти поворот." },
            { text: "Продолжаете движение, не изменяя скорости и придерживаясь левого края проезжей части дороги." },
            { text: "Снизите скорость движения." }
        ]
    },
    {
        q: "10. Разрешается ли перевозка людей в кузовах-фургонах?",
        img: "Question/10/10.jpg",
        answer: 2,
        options: [
            { text: "Разрешается." },
            { text: "Запрещается." },
            { text: "Разрешается только в том случае, если их конструкция приспособлена для таких перевозок." }
        ]
    }    
];