

//Array of Objects

const quiz = [
    
    {
        q: "1. Кто из водителей нарушил правила стоянки?",
        img: "Question/1/1.jpg",
        answer: 1,
        options: [
            { text: "Никто не нарушил", img: "" },
            { text: "Только водитель автомобиля стоящий на тротуаре", img: "" },
            { text: "Только водитель мотоцикла", img: "" }
        ]
    },
    {
        q: "2. Какие действия запрещены в жилой зоне?",
        img: "Question/2/2.jpg",
        answer: 1,
        options: [
            { text: "Только стоянка с работающим двигателем", img: "" },
            { text: "Все вышеперечисленные действия", img: "" },
            { text: "Только учебная езда", img: "" }
        ]
    },
    {
        q: "3. Какое расстояние должно быть обеспечено между буксирующим и буксируемым транспортными средствами при буксировке на жесткой сцепке?",
        img: "Question/3/3.jpg",
        answer: 1,
        options: [
            { text: "От 4 до 6 м", img: "" },
            { text: "Не более 4 м", img: "" },
            { text: "Правилами не регламентируется", img: "" }
        ]
    },
    {
        q: "4. В каком случае разрешается эксплуатация транспортного средства?",
        img: "Question/4/4.jpg",
        answer: 0,
        options: [
            { text: "Спереди - установлены белые или желтые противотуманные фары", img: "" },
            { text: "Нарушена регулировка фар", img: "" },
            { text: "Загрязнены внешние световые приборы", img: "" }
        ]
    },
    {
        q: "5. Что следует предпринять водителю для предотвращения опасных последствий заноса автомобиля при резком повороте рулевого колеса на скользкой дороге?",
        img: "Question/5/5.jpg",
        answer: 2,
        options: [
            { text: "Нажать на педаль тормоза", img: "" },
            { text: "Выключить сцепление", img: "" },
            { text: "Быстро, но плавно повернуть рулевое колесо в сторону заноса, затем опережающим воздействием на рулевое колесо выровнять траекторию движения автомобиля.", img: "" }
        ]
    },
    {
        q: "6. Какие знаки распространяют свое действие только на период времени, когда покрытие проезжей части влажное?",
        img: "Question/6/6.jpg",
        answer: 0,
        options: [
            { text: "Только a", img: "" },
            { text: "Все", img: "" },
            { text: "Только a и b", img: "" }
        ]
    },
    {
        q: "7. Нарушил ли водитель грузового автомобиля правила парковки?",
        img: "Question/7/7.jpg",
        answer: 1,
        options: [
            { text: "Не нарушил", img: "" },
            { text: "Нарушил", img: "" },
            { text: "Нарушил, если разрешенная максимальная масса автомобиля более 3,5 т", img: "" }
        ]
    },
    {
        q: "8. В каких случаях разрешено применять звуковые сигналы в населённых пунктах?",
        img: "Question/8/8.jpg",
        answer: 2,
        options: [
            { text: "В обоих перечисленных случаях", img: "" },
            { text: "Только для предупреждения о намерение произвести обгон", img: "" },
            { text: "Только для предотвращения дорожно-транспортного происшествия", img: "" }
        ]
    },
    {
        q: "9. Какие знаки разрешают Вам проезд на автомобиле к месту проживания?",
        img: "Question/9/9.jpg",
        answer: 1,
        options: [
            { text: "Только c", img: "" },
            { text: "Только a и c", img: "" },
            { text: "Все", img: "" },
            { text: "Только a", img: "" }
        ]
    },
    {
        q: "10. Разрешается ли Вам продолжить движение, если регулировщик поднял руку вверх после того, как Вы въехали на перекресток?",
        img: "Question/10/10.jpg",
        answer: 0,
        options: [
            { text: "Разрешается", img: "" },
            { text: "Не разрешается", img: "" },
            { text: "Разрешается, только если Вы поворачиваете направо", img: "" }
        ]
    }    
];