

//Array of Objects

const quiz = [
    
    {
            q: '1. Какие транспортные средства относятся к маршрутным транспортным средствам?',
            img: 'Question/1/1.jpg',
            answer: 2,
            options: [
                { text: 'Любые транспортные средства, перевозящие пассажиров', img: '' },
                { text: 'Автобусы', img: '' },
                { text: 'Транспортные средства общего пользования (троллейбус, автобус, трамвай, маршрутное такси), предназначенные для перевозки пассажиров и имеющие установленные маршруты с остановочными пунктами (остановками)', img: '' }
            ]
    },
    {
            q: '2. Главная дорога:',
            img: 'Question/2/2.jpg',
            answer: 2,
            options: [
                { text: 'Все ответы правильные', img: '' },
                { text: 'Дорога с асфальтобетонным покрытием по отношению к дороге, покрытой брусчаткой', img: '' },
                { text: 'Дорога с твердым покрытием по отношению к грунтовой дороге', img: '' }
            ]
    },
    {
            q: '3. Какой из указанных знаков требует обязательной остановки на нерегулируемых перекрестках?',
            img: 'Question/3/3.jpg',
            answer: 2,
            options: [
                { text: 'Только a', img: '' },
                { text: 'Все', img: '' },
                { text: 'Только b', img: '' },
                { text: 'b и c', img: '' }
            ]
    },
    {
            q: '4. Требования каких знаков из указанных вступают в силу непосредственно в том месте, где они установлены?',
            img: 'Question/4/4.jpg',
            answer: 2,
            options: [
                { text: 'Только b', img: '' },
                { text: 'Все', img: '' },
                { text: 'a и b', img: '' }
            ]
    },
    {
            q: '5. Вторым проедет перекресток:',
            img: 'Question/5/5.jpg',
            answer: 2,
            options: [
                { text: 'Белый автомобиль', img: '' },
                { text: 'Зеленый автомобиль', img: '' },
                { text: 'Зеленый автомобиль одновременно с трамваем', img: '' }
            ]
    },
    {
            q: '6. Первым проедет перекресток:',
            img: 'Question/6/6.jpg',
            answer: 2,
            options: [
                { text: 'Красный автомобиль', img: '' },
                { text: 'Синий автомобиль', img: '' },
                { text: 'Зеленый автомобиль', img: '' }
            ]
    },
    {
            q: '7. В каких случаях на дорогах, проезжая часть которых разделена линиями разметки, водители обязаны двигаться строго по полосам?',
            img: 'Question/7/7.jpg',
            answer: 1,
            options: [
                { text: 'Только при интенсивном движении', img: '' },
                { text: 'Во всех случаях', img: '' },
                { text: 'Только если полосы движения обозначены сплошными линиями разметки', img: '' }
            ]
    },
    {
            q: '8. Дальнейшее движение транспортного средства при неработающих фарах и задних габаритных огнях запрещается:',
            img: 'Question/8/8.jpg',
            answer: 1,
            options: [
                { text: 'Только в темное время суток', img: '' },
                { text: 'Во всех перечисленных случаях', img: '' },
                { text: 'Только в условиях недостаточной видимости', img: '' }
            ]
    },
    {
            q: '9. Какой знак предупреждает о приближении к нерегулируемому пешеходному переходу?',
            img: 'Question/9/9.jpg',
            answer: 1,
            options: [
                { text: 'a и b', img: '' },
                { text: 'Только a', img: '' },
                { text: 'Все', img: '' }
            ]
    },
    {
            q: '10. Как изменяется длина тормозного пути легкового автомобиля при движении с прицепом, не имеющим тормозной системы?',
            img: 'Question/10/10.jpg',
            answer: 1,
            options: [
                { text: 'Не изменяется', img: '' },
                { text: 'Увеличивается', img: '' },
                { text: 'Уменьшается, так как прицеп оказывает дополнительное сопротивление движению', img: '' }
            ]
    }
];