

//Array of Objects

const quiz = [
    
    {
        q: "1. В каких случаях запрещена стоянка на дорогах, имеющих менее трех полос движения в одну сторону?",
        img: "Question/1/1.jpg",
        answer: 0,
        options: [
            { text: 'Во всех перечисленных случаях.', img: '' },
            { text: 'Под мостами, эстакадами и подвесными дорогами.', img: '' },
            { text: 'На мостах, эстакадах и на путепроводах.', img: '' }
        ],
        // solutionText: "Question/1/1.0.jpg"
    },
    {
        q: "2. При возникновении заноса в результате торможения водитель должен:",
        img: "Question/2/2.jpg",
        answer: 0,
        options: [
            { text: 'Прекратить начатое торможение.', img: '' },
            { text: 'Выключить сцепление.', img: '' },
            { text: 'Выключить сцепление и тормозить стояночным тормозом.', img: '' },
            { text: 'До предела нажать тормозную педаль.', img: '' }
        ],
        // solutionText: "Question/2/2.0.jpg"
        
    },
    {
        q: "3. Прекратить начатое торможение.",
        img: "Question/3/3.jpg",
        answer: 0,
        options: [
            { text: 'Запрещается.', img: '' },
            { text: 'Разрешается для остановки.', img: '' },
            { text: 'Разрешается в любом случае, если на стоянке нет других транспортных средств.', img: '' },
            { text: 'Разрешается для въезда и выезда.', img: '' }
        ],
        // solutionText: "Question/3/3.0.jpg"
    },
    {
        q: "4. Разрешается ли объезжать стоящие перед переездом транспортные средства при закрытом шлагбауме?",
        img: "Question/4/4.jpg",
        answer: 0,
        options: [
            { text: 'Запрещается.', img: '' },
            { text: 'Разрешается, если нет встречных транспортных средств.', img: '' },
            { text: 'Разрешается только мотоциклам без бокового прицепа.', img: '' },
            { text: 'Запрещается если скорость объезжающего транспортного средства менее 8 км/час.', img: '' }
        ],
        // solutionText: "Question/4/4.0.jpg"
    },
    {
        q: "5. Третьим проедет перекресток:",
        img: "Question/5/5.jpg",
        answer: 0,
        options: [
            { text: 'Синий автомобиль.', img: '' },
            { text: 'Зеленый автомобиль.', img: '' },
            { text: 'Желтый автомобиль.', img: '' },
            { text: 'Красный автомобиль.', img: '' }
        ],
        // solutionText: "Question/5/5.0.jpg"
    },
    {
        q: "6. Когда водитель должен уступить дорогу пешеходам?",
        img: "Question/6/6.jpg",
        answer: 0,
        options: [
            { text: 'Во всех перечисленных случаях.', img: '' },
            { text: 'При выезде из двора.', img: '' },
            { text: 'При въезде во двор.', img: '' },
            { text: 'При выезде со стоянки на дорогу.', img: '' },
            { text: 'При выезде с заправочной станции.', img: '' }
        ],
        // solutionText: "Question/6/6.0.jpg"
    },
    {
        
        q: "7. Разрешается ли стоянка легковому автомобилю в показанной ситуации?",
        img: "Question/7/7.jpg",
        answer: 0,
        options: [
            { text: 'Запрещается.', img: '' },
            { text: 'Разрешается.', img: '' }
        ],
        // solutionText: "Question/7/7.0.jpg"
    },
    {
        
        q: "8. Перевозка грузов в грузовых автомобилях запрещается, если:",
        answer: 0,
        options: [
            { text: 'Если вес груза больше, чем установленная норма для данного грузового автомобиля', img: '' },
            { text: 'Груз выступает за габариты автомобиля спереди и сзади до 1 метра', img: '' },
            { text: 'Во всех перечисленных случаях', img: '' },
            { text: 'Крайняя точка груза по ширине находится на расстоянии (выступает) до 0,4 метра от габарита автомобиля', img: '' }
        ],
        // solutionText: "Question/8/8.0.jpg"
    },
    {
        q: "9. Чем может быть вызвано боковое скольжение автомо­биля?",
        img: 'Question/9/9.jpg',
        answer: 0,
        options: [
            { text: 'Во всех перечисленных случаях.', img: '' },
            { text: 'Только резким торможением.', img: '' },
            { text: 'Только резким поворотом.', img: '' },
            { text: 'Резким разгоном и резким торможением.', img: '' }
        ],
        // solutionText: "Question/9/9.0.jpg"
    },
    {
        q: "10. Какой наибольший суммарный люфт допускается правилами для категории автотранспортных средств N2, N3?",
        img: "Question/10/10.jpg",
        answer: 0,
        options: [
            { text: '25°', img: '' },
            { text: '16°', img: '' },
            { text: '26°', img: '' },
            { text: '30°', img: '' },
            { text: '20°', img: '' }
        ],
        // solutionText: "Question/10/10.0.jpg"
    }
];