

//Array of Objects

const quiz = [
    
    {
        q: "1. В каком случае водитель неправильно остановил машину для высадки пассажиров?",
        img: "Question/1/1.jpg",
        answer: 2,
        options: [
            { text: "На рисунке слева.", img: "" },
            { text: "На рисунке справа.", img: "" },
            { text: "На обоих рисунках.", img: "" }
        ]
    },
    {
        q: "2. На каком рисунке показано правильное направление движения?",
        img: "Question/2/2.jpg",
        answer: 2,
        options: [
            { text: "На обоих.", img: "" },
            { text: "На первом.", img: "" },
            { text: "На втором.", img: "" }
        ]
    },
    {
        q: "3. Что обозначает данная разметка?",
        img: "Question/3/3.jpg",
        answer: 1,
        options: [
            { text: "Место, где пешеходная дорожка пересекает проезжую часть.", img: "" },
            { text: "Место, где велосипедная дорожка пересекает проезжую часть.", img: "" },
            { text: "Пешеходный переход, где движение регулируется светофором.", img: "" }
        ]
    },
    {
        q: "4. Красный автомобиль проедет перекресток:",
        img: "Question/4/4.jpg",
        answer: 1,
        options: [
            { text: "Последним.", img: "" },
            { text: "Вторым.", img: "" },
            { text: "Первым.", img: "" }
        ]
    },
    {
        q: "5. При каком сигнале светофора водителю автомобиля можно закончить разворот?",
        img: "Question/5/5.jpg",
        answer: 1,
        options: [
            { text: "При любом.", img: "" },
            { text: "При зеленом.", img: "" },
            { text: "При красном.", img: "" }
        ]
    },
    {
        q: "6. В каком из перечисленных случаев разрешается разворот от правого края проезжей части или с правой обочины?",
        img: "Question/6/6.jpg",
        answer: 0,
        options: [
            { text: "Вне перекрестка, если ширина проезжей части недостаточна для разворота из крайнего левого положения.", img: "" },
            { text: "На регулируемом перекрестке.", img: "" },
            { text: "На нерегулируемом перекрестке, если транспортное средство, совершающее разворот, находится на главной дороге.", img: "" }
        ]
    },
    {
        q: "7. Может ли быть повышена максимальная скорость движения, определенная технической характеристикой транспортного средства?",
        img: "Question/7/7.jpg",
        answer: 0,
        options: [
            { text: "Не может быть превышена.", img: "" },
            { text: "Может быть повышена органами, ответственными за эксплуатацию дорог.", img: "" },
            { text: "Может быть повышена на дорогах вне населенных пунктов. На таких участках устанавливаются знаки 'Ограничение максимальной скорости'.", img: "" }
        ]
    },
    {
        q: "8. В каких местах разрешена преднамеренная остановка транспортных средств на автомагистралях?",
        img: "Question/8/8.jpg",
        answer: 2,
        options: [
            { text: "В местах, где видимость более 100 м и число полос движения более четырех.", img: "" },
            { text: "На крайней правой полосе проезжей части дороги.", img: "" },
            { text: "На специальных площадках для стоянки, обозначенных знаками 'Место стоянки' или 'Место отдыха'.", img: "" }
        ]
    },
    {
        q: "9. Знак автопоезда должен быть включен:",
        img: "Question/9/9.jpg",
        answer: 1,
        options: [
            { text: "При движении ночью или в условиях недостаточной видимости.", img: "" },
            { text: "При движении автопоезда, а также при его остановке и стоянке в темное время суток.", img: "" },
            { text: "Только при движении автопоезда.", img: "" },
            { text: "Только при движении автопоезда с грузом.", img: "" }
        ]
    },
    {
        q: "10. Разрешается ли установка шин, восстановленных по второму классу ремонта на легковых автомобилях?",
        img: "Question/10/10.jpg",
        answer: 1,
        options: [
            { text: "Разрешается на обоих осях автомобиля.", img: "" },
            { text: "Разрешается только на задней оси.", img: "" },
            { text: "Запрещается.", img: "" }
        ]
    }    
];