

//Array of Objects

const quiz = [
    
    {
        q: "1. Водитель, какого транспортного средства должен уступить дорогу?",
        img: "Question/1/1.jpg",
        answer: 1,
        options: [
            { text: "Водитель автомобиля скорой помощи.", img: "" },
            { text: "Водитель легкового автомобиля.", img: "" }
        ]
    },
    {
        q: "2. Какие транспортные средства запрещается обгонять при этом знаке?",
        img: "Question/2/2.jpg",
        answer: 1,
        options: [
            { text: "Легковые автомобили, мотоциклы и грузовые автомобили с полной массой менее 3,5 т.", img: "" },
            { text: "Все, кроме одиночных, движущихся со скоростью менее 40 км/ч.", img: "" },
            { text: "Все.", img: "" },
            { text: "Грузовые автомобили с полной массой более 3,5 т.", img: "" }
        ]
    },
    {
        q: "3. Эта дорожная разметка обозначает?",
        img: "Question/3/3.jpg",
        answer: 1,
        options: [
            { text: "Зону, в которой запрещается обгонять все транспортные средства, кроме одиночных, движущихся со скоростью менее 30 км/ч двухколесных мотоциклов, велосипедистов.", img: "" },
            { text: "Приближение к сужению проезжей части или к линии разметки, разделяющей транспортные потоки противоположных направлений.", img: "" },
            { text: "Приближение к полосе проезжей части, предназначенной для движения только маршрутных транспортных средств.", img: "" }
        ]
    },
    {
        q: "4. Третьим проедет перекресток:",
        img: "Question/4/4.jpg",
        answer: 0,
        options: [
            { text: "Зеленый автомобиль.", img: "" },
            { text: "Желтый автомобиль.", img: "" },
            { text: "Синий автомобиль.", img: "" }
        ]
    },
    {
        q: "5. Каким транспортным средствам разрешается движение в указанных направлениях?",
        img: "Question/5/5.jpg",
        answer: 2,
        options: [
            { text: "Водителям автомобиля и мотоцикла.", img: "" },
            { text: "Водителю автомобиля.", img: "" },
            { text: "Водителям трамвая и автомобиля.", img: "" }
        ]
    },
    {
        q: "6. В каком случае центробежная сила при повороте уменьшается?",
        img: "Question/6/6.jpg",
        answer: 2,
        options: [
            { text: "При резком повороте рулевого колеса в сторону поворота.", img: "" },
            { text: "При уменьшении радиуса поворота.", img: "" },
            { text: "При снижении скорости движения.", img: "" }
        ]
    },
    {
        q: "7. Кто должен уступить дорогу?",
        img: "Question/7/7.jpg",
        answer: 1,
        options: [
            { text: "Водитель легкового автомобиля.", img: "" },
            { text: "Водитель грузового автомобиля.", img: "" }
        ]
    },
    {
        q: "8. Разрешена ли стоянка автомобиля в этом месте?",
        img: "Question/8/8.jpg",
        answer: 0,
        options: [
            { text: "Запрещена.", img: "" },
            { text: "Разрешена.", img: "" }
        ]
    },
    {
        q: "9. Смещается ли прицеп автопоезда при движении на повороте?",
        img: "Question/9/9.jpg",
        answer: 2,
        options: [
            { text: "Смещается в сторону от центра поворота.", img: "" },
            { text: "Не смещается.", img: "" },
            { text: "Смещается к центру поворота.", img: "" }
        ]
    },
    {
        q: "10. С какой целью установлена табличка под данным знаком?",
        img: "Question/10/10.jpg",
        answer: 0,
        options: [
            { text: "Для уточнения расстояния от знака до начала зоны его действия.", img: "" },
            { text: "Для уточнение зоны действия запрещающего знака.", img: "" }
        ]
    }    
];