

//Array of Objects

const quiz = [
    
    {
        q: "1. Разрешается ли пешеходам переходить дорогу вне пешеходного перехода?",
        img: "Question/1/1.jpg",
        answer: 0,
        options: [
            { text: 'Если в пределах видимости дороги нет перекрестка или перекрестка, разрешается пересекать проезжую часть под прямым углом к краю проезжей части на дорогах с хорошей видимостью с обеих сторон, без разделительной зоны и без препятствий', img: '' },
            { text: 'Запрещается', img: '' },
            { text: 'Разрешается', img: '' }
        ],
        // solutionText: "Question/1/1.0.jpg"
    },
    {
        q: "2. Разрешается ли повернуть во двор в этом месте?",
        img: "Question/2/2.jpg",
        answer: 0,
        options: [
            { text: 'Разрешается', img: '' },
            { text: 'Запрещается', img: '' }
        ],
        // solutionText: "Question/2/2.0.jpg"
        
    },
    {
        q: "3. На каком расстоянии до начала опасного участка устанавливаются эти знаки в населенных пунктах?",
        img: "Question/3/3.jpg",
        answer: 0,
        options: [
            { text: '50-100 м.', img: '' },
            { text: '150-300 м.', img: '' },
            { text: '25-50 м.', img: '' },
            { text: '15-25 м.', img: '' },
            { text: '100-130 м.', img: '' }
        ],
        // solutionText: "Question/3/3.0.jpg"
    },
    {
        q: "4. Разрешена ли буксировка на автомагистрали?",
        img: "Question/4/4.jpg",
        answer: 0,
        options: [
            { text: 'Разрешена любым способом', img: '' },
            { text: 'Запрещена', img: '' },
            { text: 'Разрешена на гибкой сцепке', img: '' },
            { text: 'Разрешена со скоростью 50 км/ч', img: '' },
            { text: 'Разрешена только путем частичной погрузки или на жесткой сцепке', img: '' }
        ],
        // solutionText: "Question/4/4.0.jpg"
    },
    {
        q: "5. Должен ли водитель автобуса, движущегося по установленному маршруту, уступать дорогу в данной ситуации?",
        img: "Question/5/5.jpg",
        answer: 0,
        options: [
            { text: 'Должен', img: '' },
            { text: 'Не должен', img: '' },
            { text: 'Не должен, так как он движется прямо', img: '' }
        ],
        // solutionText: "Question/5/5.0.jpg"
    },
    {
        q: "6. Каким транспортным средствам разрешается повернуть направо?",
        img: "Question/6/6.jpg",
        answer: 0,
        options: [
            { text: 'Красному и зеленому автомобилям', img: '' },
            { text: 'Всем транспортным средствам', img: '' },
            { text: 'Только красному автомобилю', img: '' }
        ],
        // solutionText: "Question/6/6.0.jpg"
    },
    {
        
        q: "7. С какой максимальной скоростью разрешается дви­жение легковых автомобилей с прицепом на участках дорог, обозначенных таким дорожным знаком?",
        img: "Question/7/7.jpg",
        answer: 0,
        options: [
            { text: '80 км/ч.', img: '' },
            { text: '100 км/ч.', img: '' },
            { text: '110 км/ч.', img: '' },
            { text: '60 км/ч.', img: '' },
            { text: '70 км/ч.', img: '' }
        ],
        // solutionText: "Question/7/7.0.jpg"
    },
    {
        
        q: "8. В каком случае Правила не требуют подачи предупре­дительного сигнала?",
        img: "Question/7/7.jpg",
        answer: 0,
        options: [
            { text: 'Перед закруглением дороги, обозначенным знаком "Опасный поворот"', img: '' },
            { text: 'Перед остановкой у края проезжей части', img: '' },
            { text: 'Перед перестроением на соседнюю полосу движения', img: '' }
        ],
        // solutionText: "Question/8/8.0.jpg"
    },
    {
        q: "9. Этот дорожный знак означает, что:",
        img: 'Question/9/9.jpg',
        answer: 0,
        options: [
            { text: 'Запрещается движение транспортных средств, в том числе тягачей с прицепами, общая фактическая масса которых (включая массу пассажиров и груза) больше указанной на знаке', img: '' },
            { text: 'Запрещается движение грузовых автомобилей и составов транспортных средств (грузовых автомобилей с прицепами) грузоподъемностью больше указанной на знаке', img: '' }
        ],
        // solutionText: "Question/9/9.0.jpg"
    },
    {
        q: "10. Шины автотранспортных средств категории М2, M3 должны иметь остаточную высоту рисунка протектора не менее:",
        img: "Question/10/10.jpg",
        answer: 0,
        options: [
            { text: '2 мм.', img: '' },
            { text: '2,5 мм.', img: '' },
            { text: '0,8 мм.', img: '' },
            { text: '1,6 мм.', img: '' },
            { text: '1,6 мм.', img: '' }
        ],
        // solutionText: "Question/10/10.0.jpg"
    }
];