

//Array of Objects

const quiz = [
    
    {
        q: "1. Что должны сделать водители междугородних автобусов, прежде чем начать движения?",
        img: "Question/1/1.jpg",
        answer: 2,
        options: [
            { text: "Объяснить пассажирам, что во время движения нельзя ходить в салоне автобуса." },
            { text: "Объяснить пассажирам, как выйти, сойти и сесть на автобус." },
            { text: "Объяснить пассажирам об использовании аварийные выходы." }
        ]
    },
    {
        q: "2. Какой знак указывает обязательное направление движения на перекрестке?",
        img: "Question/2/2.jpg",
        answer: 4,
        options: [
            { text: "5" },
            { text: "2" },
            { text: "1" },
            { text: "3" },
            { text: "4" }
        ]
    },
    {
        q: "3. Эта дорожная разметка применяется для обозначения:",
        img: "Question/3/3.jpg",
        answer: 2,
        options: [
            { text: "Дорожной развязки на разных уровнях." },
            { text: "Участка дороги, на котором скорость движения ограничена до 40 км/ч." },
            { text: "Вертикальных элементов дорожных сооружений, когда они представляют опасность для движущихся транспортных средств." }
        ]
    },
    {
        q: "4. Водители транспортных средств должны уступить дорогу автобусу или троллейбусу:",
        img: "Question/4/4.jpg",
        answer: 0,
        options: [
            { text: "В населенном пункте, если он начинает движение от обозначенной остановки." },
            { text: "Если он начинает движение от остановки." },
            { text: "Если он движется по маршруту в часы 'ПИК'." }
        ]
    },
    {
        q: "5. В каком ответе правильно названы все транспортные средства, которым разрешено движение?",
        img: "Question/5/5.jpg",
        answer: 0,
        options: [
            { text: "Автомобили и мотоцикл." },
            { text: "Автомобили и трамвай." },
            { text: "Все транспортные средства." }
        ]
    },
    {
        q: "6. Водитель какого транспортного средства должен уступить дорогу?",
        img: "Question/6/6.jpg",
        answer: 1,
        options: [
            { text: "Водитель трамвая." },
            { text: "Водитель автомобиля." }
        ]
    },
    {
        q: "7. Разрешается ли водителю синего автомобиля выполнять обгон?",
        img: "Question/7/7.jpg",
        answer: 2,
        options: [
            { text: "Разрешается." },
            { text: "Разрешается, если красный автомобиль движется со скоростью менее 40 км/час." },
            { text: "Запрещается." }
        ]
    },
    {
        q: "8. На каком рисунке водитель поставил автомобиль на стоянку с нарушением правил?",
        img: "Question/8/8.jpg",
        answer: 0,
        options: [
            { text: "На левом и среднем." },
            { text: "На всех." },
            { text: "Только на левом." }
        ]
    },
    {
        q: "9. Применение торможения двигателем на скользкой дороге для заднеприводного автомобиля:",
        img: "Question/9/9.jpg",
        answer: 1,
        options: [
            { text: "Не оказывает какого-либо влияния на устойчивость автомобиля." },
            { text: "Повышает устойчивость автомобиля." },
            { text: "Снижает устойчивость автомобиля." }
        ]
    },
    {
        q: "10. При какой максимальной ширине транспортного средства с грузом или без груза допускается движение без разрешения ГСБДД?",
        img: "Question/10/10.jpg",
        answer: 3,
        options: [
            { text: "4,0 м." },
            { text: "2,0 м." },
            { text: "5,0 м." },
            { text: "2,55 м." },
            { text: "3,8 м." }
        ]
    }    
];