

//Array of Objects

const quiz = [
    
    {
        q: '1. Сколько групп имеется дорожных знаков по правилам дорожного движения?',
        img: 'Question/1/1.jpg',
        answer: 1,
        options: [
            { text: '6', img: '' },
            { text: '7', img: '' },
            { text: '5', img: '' }
        ]
    },
    {
        q: '2. О чем предупреждает этот знак?',
        img: 'Question/2/2.jpg',
        answer: 2,
        options: [
            { text: 'В переди есть крутой подъем', img: '' },
            { text: 'В переди есть разводной мост', img: '' },
            { text: 'Искусственная неровность дороги', img: '' }
        ]
    },
    {
        q: '3. С какой максимальной скоростью может двигаться грузовые автомобили с прицепом вне населенных пунктов?',
        img: 'Question/3/3.jpg',
        answer: 0,
        options: [
            { text: '70 км/ч', img: '' },
            { text: '60 км/ч', img: '' },
            { text: '90 км/ч', img: '' },
            { text: '80 км/ч', img: '' }
        ]
    },
    {
        q: '4. Какой из знаков предупреждает водителя о неровности дороги?',
        img: 'Question/4/4.jpg',
        answer: 2,
        options: [
            { text: 'a', img: '' },
            { text: 'b', img: '' },
            { text: 'c', img: '' }
        ]
    },
    {
        q: '5. Что подразумевается под тормозным путем?',
        img: 'Question/5/5.jpg',
        answer: 0,
        options: [
            { text: 'Расстояние, пройденное транспортным средством с момента нажатия на педаль тормоза до полной остановки', img: '' },
            { text: 'Расстояние, пройденное транспортным средством с момента обнаружения водителем опасности до полной остановки', img: '' }
        ]
    },
    {
        q: '6. Кому следует уступить дорогу белый автомобиль?',
        img: 'Question/6/6.jpg',
        answer: 2,
        options: [
            { text: 'Только легковому автомобилю.', img: '' },
            { text: 'Только автобусу', img: '' },
            { text: 'Никому', img: '' }
        ]
    },
    {
        q: '7. В каком направлении разрешено продолжить движение легковому автомобилю?',
        img: 'Question/7/7.jpg',
        answer: 2,
        options: [
            { text: 'Только налево или направо', img: '' },
            { text: 'Только прямо', img: '' },
            { text: 'В любых направлениях', img: '' }
        ]
    },
    {
        q: '8. Механическое транспортное средство – это ...',
        img: 'Question/8/8.jpg',
        answer: 0,
        options: [
            { text: 'Транспортное средство (кроме мопеда), приводимое в движение двигателем. Термин распространяется на любые тракторы и самоходные механизмы.', img: '' },
            { text: 'Транспортное средство, не оборудованное двигателем и предназначенное для движения в составе с механическим транспортным средством. Термин распространяется также на полуприцепы и прицепы-роспуски.', img: '' },
            { text: 'Устройство, предназначенное для перевозки людей, грузов или для производства специальных работ.', img: '' }
        ]
    },
    {
        q: '9. Как изменяется поле зрения водителя с увеличением скорости движения?',
        img: 'Question/9/9.jpg',
        answer: 2,
        options: [
            { text: 'Не изменяется', img: '' },
            { text: 'Расширяется', img: '' },
            { text: 'Сужается', img: '' }
        ]
    },
    {
        q: '10. Можно ли давать пострадавшему пищу, воду и лекарства при повреждении брюшной полости?',
        img: 'Question/10/10.jpg',
        answer: 0,
        options: [
            { text: 'Нет', img: '' },
            { text: 'Да', img: '' }
        ]
    }    
];