

//Array of Objects

const quiz = [
    
    {
        q: "1. Какие внешние световые приборы Вы должны использовать при движении в темное время суток на освещенных участках дорог населенного пункта?",
        img: "Question/1/1.jpg",
        answer: 0,
        options: [
            { text: "Фары ближнего света", img: "" },
            { text: "Ближнего или дальнего света фар", img: "" },
            { text: "Габаритные огни", img: "" }
        ]
    },
    {
        q: "2. В каком случае легковой автомобиль более устойчив против опрокидывания на повороте?",
        img: "Question/2/2.jpg",
        answer: 1,
        options: [
            { text: "Без пассажиров, но с грузом на верхнем багажнике", img: "" },
            { text: "Без груза и пассажиров", img: "" },
            { text: "С пассажирами, но без груза", img: "" }
        ]
    },
    {
        q: "3. В каких случаях Вам запрещается дальнейшее движение даже до места ремонта или стоянки с не горящими (из-за неисправности) фарами и задними габаритными огнями?",
        img: "Question/3/3.jpg",
        answer: 2,
        options: [
            { text: "Только в темное время суток", img: "" },
            { text: "Только в условиях недостаточной видимости", img: "" },
            { text: "В обоих перечисленных случаях", img: "" }
        ]
    },
    {
        q: "4. Какие знаки требует, что Вы должны уступить дорогу, если встречный разъезд затруднен?",
        img: "Question/4/4.jpg",
        answer: 0,
        options: [
            { text: "a и c", img: "" },
            { text: "Только c", img: "" },
            { text: "b и d", img: "" },
            { text: "b и c", img: "" }
        ]
    },
    {
        q: "5. В каком случае Вы совершите вынужденную остановку?",
        img: "Question/5/5.jpg",
        answer: 2,
        options: [
            { text: "В обоих перечисленных случаях", img: "" },
            { text: "Остановившись непосредственно перед пешеходным переходом, чтобы уступить дорогу пешеходу", img: "" },
            { text: "Остановившись на проезжей части из-за технической неисправности автомобиля", img: "" }
        ]
    },
    {
        q: "6. Какой из знаков обозначает пешеходную дорожку?",
        img: "Question/6/6.jpg",
        answer: 2,
        options: [
            { text: "Все знаки", img: "" },
            { text: "Только b и c", img: "" },
            { text: "Только b", img: "" }
        ]
    },
    {
        q: "7. Как влияет длительный разгон транспортного средства с включенной первой передачей на расход топлива?",
        img: "Question/7/7.jpg",
        answer: 2,
        options: [
            { text: "Расход топлива уменьшается", img: "" },
            { text: "Расход топлива не изменяется", img: "" },
            { text: "Расход топлива увеличивается", img: "" }
        ]
    },
    {
        q: "8. Какие знаки дополнительной информации указывают протяженность зоны действия знаков, с которыми они применяются?",
        img: "Question/8/8.jpg",
        answer: 1,
        options: [
            { text: "Только b", img: "" },
            { text: "b и c", img: "" },
            { text: "Только a", img: "" }
        ]
    },
    {
        q: "9. Как Вы можете в светлое время суток привлечь внимание водителя обгоняемого автомобиля при движении вне населенного пункта?",
        img: "Question/9/9.jpg",
        answer: 2,
        options: [
            { text: "Только звуковым сигналом", img: "" },
            { text: "Только кратковременным переключением фар с ближнего света на дальний", img: "" },
            { text: "Любым из перечисленных способов, включая совместную подачу этих сигналов", img: "" }
        ]
    },
    {
        q: "10. Какие из перечисленных транспортных средств разрешается эксплуатировать без огнетушителя?",
        img: "Question/10/10.jpg",
        answer: 0,
        options: [
            { text: "Все мотоциклы", img: "" },
            { text: "Автомобили", img: "" },
            { text: "Автобусы", img: "" },
            { text: "Только мотоциклы без бокового прицепа", img: "" }
        ]
    }    
];