

//Array of Objects

const quiz = [
    
    {
        q: "1. Вторым проедет перекресток:",
        img: "Question/1/1.jpg",
        answer: 0,
        options: [
            { text: 'Грузовой автотранспорт', img: '' },
            { text: 'Зеленый автомобиль.', img: '' },
            { text: 'Красный автомобиль.', img: '' }
        ],
        // solutionText: "Question/1/1.0.jpg"
    },
    {
        q: "2. Водители каких транспортных средств нарушили правила остановки?",
        img: "Question/2/2.jpg",
        answer: 0,
        options: [
            { text: 'А и Б', img: '' },
            { text: 'Б и В', img: '' },
            { text: 'Только А', img: '' },
            { text: 'Только B', img: '' },
            { text: 'Только Б', img: '' }
        ],
        // solutionText: "Question/2/2.0.jpg"
        
    },
    {
        q: "3. Какой знак обязывает уступить дорогу транспортным средствам, движущимся по пересекаемой дороге?",
        img: "Question/3/3.jpg",
        answer: 0,
        options: [
            { text: '3', img: '' },
            { text: '4', img: '' },
            { text: '5', img: '' },
            { text: '2', img: '' },
            { text: '1', img: '' }
        ],
        // solutionText: "Question/3/3.0.jpg"
    },
    {
        q: "4. Звуковым сигналом общей тревоги на железнодорожном переезде служат серия из:",
        img: "Question/4/4.jpg",
        answer: 0,
        options: [
            { text: 'Одного длинного и трех коротких сигналов.', img: '' },
            { text: 'Трех длинных и трех коротких сигналов.', img: '' },
            { text: 'Трех длинных и трех коротких сигналов.', img: '' },
            { text: 'Двух длинных и двух коротких сигналов.', img: '' }
        ],
        // solutionText: "Question/4/4.0.jpg"
    },
    {
        q: "5. B каком ответе правильно указана очередность проезда перекрестка?",
        img: "Question/5/5.jpg",
        answer: 0,
        options: [
            { text: 'Велосипед, автобус, автомобиль.', img: '' },
            { text: 'Автобус, автомобиль, велосипед.', img: '' },
            { text: 'Автомобиль, автобус, велосипед.', img: '' }
        ],
        // solutionText: "Question/5/5.0.jpg"
    },
    {
        q: "6. Что должен делать водитель автомобиля для прекращения начавшегося заноса задней оси заднеприводного автомобиля?",
        img: "Question/6/6.jpg",
        answer: 0,
        options: [
            { text: 'Повернуть рулевое колесо в сторону начавшегося заноса.', img: '' },
            { text: 'Нажать на педаль тормоза.', img: '' },
            { text: 'Повернуть рулевое колесо в сторону, противоположную заносу.', img: '' }
        ],
        // solutionText: "Question/6/6.0.jpg"
    },
    {
        
        q: "7. Разрешается ли опережение в показанной ситуации?",
        img: "Question/7/7.jpg",
        answer: 0,
        options: [
            { text: 'Разрешается.', img: '' },
            { text: 'Запрещается.', img: '' },
            { text: 'Разрешается, если скорость обгоняемого транспортного средства менее 40 км/ч.', img: '' }
        ],
        // solutionText: "Question/7/7.0.jpg"
    },
    {
        
        q: "8. Правильно ли поступил водитель, применив переключение света фар и звуковой сигнал, для привлечения внимания обгоняемого водителя на дороге вне населенного пункта?",
        answer: 0,
        options: [
            { text: 'Правильно.', img: '' },
            { text: 'Неправильно.', img: '' }
        ],
        // solutionText: "Question/8/8.0.jpg"
    },
    {
        q: "9. Что необходимо сделать при переломе ключицы у пострадавшего?",
        img: 'Question/9/9.jpg',
        answer: 0,
        options: [
            { text: 'Подложить валик из ваты или бинта в подмышечную область и прибинтовать согнутую в локте руку к туловищу.', img: '' },
            { text: 'Наложить шину в подмышечную область и прибинтовать выпрямленную руку к туловищу.', img: '' },
            { text: 'Наложить холодный компресс на место перелома, туго забинтовать.', img: '' }
        ],
        // solutionText: "Question/9/9.0.jpg"
    },
    {
        q: "10. Какое количество противотуманных фар разрешается устанавливать на легковом автомобиле?",
        img: "Question/10/10.jpg",
        answer: 0,
        options: [
            { text: 'Две.', img: '' },
            { text: 'По усмотрению водителя.', img: '' },
            { text: 'Четыре.', img: '' }
        ],
        // solutionText: "Question/10/10.0.jpg"
    }
];