

//Array of Objects

const quiz = [
    
    {
        q: "1. Разрешена ли Вам перевозка людей в салоне легкового автомобиля, буксирующего неисправное транспортное средство?",
        img: "Question/1/1.jpg",
        answer: 0,
        options: [
            { text: "Разрешено", img: "" },
            { text: "Запрещена", img: "" }
        ]
    },
    {
        q: "2. Как воспринимается водителем скорость своего автомобиля при длительном движении по ровной-широкой дороге на большой скорости?",
        img: "Question/2/2.jpg",
        answer: 1,
        options: [
            { text: "Кажется больше, чем в действительности", img: "" },
            { text: "Кажется меньше чем в действительности", img: "" },
            { text: "Восприятие скорости не меняется", img: "" }
        ]
    },
    {
        q: "3. При движении по какому участку дороги действие сильного бокового ветра наиболее опасно?",
        img: "Question/3/3.jpg",
        answer: 2,
        options: [
            { text: "По закрытому деревьями", img: "" },
            { text: "По открытому", img: "" },
            { text: "При выезде с закрытого участка на открытый", img: "" }
        ]
    },
    {
        q: "4. Как Вы можете в светлое время суток привлечь внимание водителя обгоняемого автомобиля при движении вне населенного пункта?",
        img: "Question/4/4.jpg",
        answer: 0,
        options: [
            { text: "Любым из перечисленных способов, включая совместную подачу этих сигналов", img: "" },
            { text: "Только звуковым сигналом", img: "" },
            { text: "Только кратковременным переключением фар с ближнего света на дальний", img: "" }
        ]
    },
    {
        q: "5. В данной ситуации Вы должны:",
        img: "Question/5/5.jpg",
        answer: 1,
        options: [
            { text: "Остановиться у знака", img: "" },
            { text: "Остановиться у стоп-линии", img: "" },
            { text: "При отсутствии других транспортных средств проехать перекресток без остановки", img: "" }
        ]
    },
    {
        q: "6. Для обеспечения безопасности при движении задним ходом в местах, где видимость ограничена, необходимо:",
        img: "Question/6/6.jpg",
        answer: 0,
        options: [
            { text: "Прибегнуть к помощи других лиц", img: "" },
            { text: "Включить аварийную сигнализацию", img: "" },
            { text: "Подать звуковой сигнал", img: "" }
        ]
    },
    {
        q: "7. Можете ли Вы продолжить движение по средней полосе после обгона?",
        img: "Question/7/7.jpg",
        answer: 1,
        options: [
            { text: "Да", img: "" },
            { text: "Нет", img: "" }
        ]
    },
    {
        q: "8. Зависит ли выбор бокового интервала от скорости движения?",
        img: "Question/8/8.jpg",
        answer: 0,
        options: [
            { text: "При увеличении скорости движения боковой интервал необходимо увеличить", img: "" },
            { text: "Выбор бокового интервала от скорости движения не зависит", img: "" }
        ]
    },
    {
        q: "9. Разрешено ли Вам остановиться на легковом автомобиле в указанном месте?",
        img: "Question/9/9.jpg",
        answer: 0,
        options: [
            { text: "Нет", img: "" },
            { text: "Да", img: "" }
        ]
    },
    {
        q: "10. С какой стороны остановившихся автобуса и троллейбуса пешеходы должны переходить дорогу?",
        img: "Question/10/10.jpg",
        answer: 0,
        options: [
            { text: "C задней стороны", img: "" },
            { text: "По желанию", img: "" },
            { text: "С передней стороны", img: "" }
        ]
    }    
];