

//Array of Objects

const quiz = [
    
    {
        q: '1. В какой формулировке указан правильный ответ термину "Преимущество"?',
        img: 'Question/1/1.jpg',
        answer: 0,
        options: [
            { text: 'Право на первоочередное движение в намеченном направлении по отношению к другим участникам движения', img: '' },
            { text: 'Требование, означающее, что участник дорожного движения не должен продолжать или начинать движение, осуществлять какой-либо маневр, если это может вынудить других участников движения, имеющих по отношению к нему приоритет, изменить направление движения или скорость', img: '' }
        ]
    },
    {
        q: '2. Кто должен уступить дорогу если встречный разъезд затруднен?',
        img: 'Question/2/2.jpg',
        answer: 1,
        options: [
            { text: 'Водитель, на стороне которого не имеется препятствие', img: '' },
            { text: 'Водитель, на стороне которого имеется препятствие', img: '' }
        ]
    },
    {
        q: '3. Какой знак предупреждает водителя об оборудовании огородительным устройством железнодорожного переезда?',
        img: 'Question/3/3.jpg',
        answer: 0,
        options: [
            { text: 'с', img: '' },
            { text: 'b', img: '' },
            { text: 'd', img: '' },
            { text: 'a', img: '' }
        ]
    },
    {
        q: '4. По какой траектории двигается прицеп легкового автомобиля при прохождении поворота?',
        img: 'Question/4/4.jpg',
        answer: 2,
        options: [
            { text: 'По траектории движения автомобиля', img: '' },
            { text: 'Дальше от центра поворота, чем траектория движения автомобиля', img: '' },
            { text: 'Ближе к центру поворота, чем траектория движения автомобиля', img: '' }
        ]
    },
    {
        q: '5. Можно ли использовать противотуманные фары совместно с фарами дальнего света в темное время суток на неосвещенных участках дорог?',
        img: 'Question/5/5.jpg',
        answer: 1,
        options: [
            { text: 'Нет', img: '' },
            { text: 'Да', img: '' }
        ]
    },
    {
        q: '6. Какой автомобиль должен уступить дорогу на перекрестке?',
        img: 'Question/6/6.jpg',
        answer: 1,
        options: [
            { text: 'Белый автомобиль', img: '' },
            { text: 'Жёлтый автомобиль', img: '' }
        ]
    },
    {
        q: '7. Какой из этих знаков указывает начало участка дороги, на котором на одной или нескольких полосах направление движения может изменяться на противоположное?',
        img: 'Question/7/7.jpg',
        answer: 1,
        options: [
            { text: 'a', img: '' },
            { text: 'с', img: '' },
            { text: 'b', img: '' }
        ]
    },
    {
        q: '8. При выезде из жилых зон водитель:',
        img: 'Question/8/8.jpg',
        answer: 0,
        options: [
            { text: 'Должен уступить дорогу другим участникам дорожного движения', img: '' },
            { text: 'Имеет приоритет, чем другим участникам дорожного движения', img: '' }
        ]
    },
    {
        q: '9. В случае потери сцепления колес с дорогой из-за образования "водяного клина" водителю следует:',
        img: 'Question/9/9.jpg',
        answer: 1,
        options: [
            { text: 'Снизить скорость резким нажатием на педаль тормоза', img: '' },
            { text: 'Снизить скорость, применяя торможение двигателем', img: '' },
            { text: 'Увеличить скорость', img: '' }
        ]
    },
    {
        q: '10. Признаки венозного кровотечения:',
        img: 'Question/10/10.jpg',
        answer: 2,
        options: [
            { text: 'Кровь розового цвета сильной пульсацией бьётся из сосудов', img: '' },
            { text: 'Кровотечение во внутренние органы из мелких кровеносных сосудов', img: '' },
            { text: 'Тёмно-красная кровь струится из сосудов', img: '' }
        ]
    }
    
];