

//Array of Objects

const quiz = [
    
    {
        q: "1. Разрешается ли выезд на перекресток водителю желтого автобуса?",
        img: "Question/1/1.jpg",
        answer: 2,
        options: [
            { text: "Разрешается", img: "" },
            { text: "Если автобус движется по установленному маршруту", img: "" },
            { text: "Запрещается", img: "" }
        ]
    },
    {
        q: "2. Укажите разрешенные направления движения:",
        img: "Question/2/2.jpg",
        answer: 3,
        options: [
            { text: "Только В.", img: "" },
            { text: "Только Б.", img: "" },
            { text: "Только А.", img: "" },
            { text: "А и Б.", img: "" },
            { text: "Б и В.", img: "" }
        ]
    },
    {
        q: "3. Какой знак запрещает стоянку по четным числам?",
        img: "Question/3/3.jpg",
        answer: 2,
        options: [
            { text: "1", img: "" },
            { text: "2", img: "" },
            { text: "5", img: "" },
            { text: "4", img: "" },
            { text: "3", img: "" }
        ]
    },
    {
        q: "4. Этот дорожный знак:",
        img: "Question/4/4.jpg",
        answer: 0,
        options: [
            { text: "Разрешает движение только с указанной или большей скоростью.", img: "" },
            { text: "Запрещает движение со скоростью, превышающей указанную на знаке.", img: "" },
            { text: "Указывает скорость, с которой рекомендуется движение на данном участке дороги.", img: "" }
        ]
    },
    {
        q: "5. Последним проедет перекресток:",
        img: "Question/5/5.jpg",
        answer: 1,
        options: [
            { text: "Зеленый автомобиль", img: "" },
            { text: "Красный автомобиль", img: "" },
            { text: "Синий автомобиль", img: "" }
        ]
    },
    {
        q: "6. При ослеплении водитель должен:",
        img: "Question/6/6.jpg",
        answer: 3,
        options: [
            { text: "Включить дальний свет и остановиться.", img: "" },
            { text: "Принять как можно правее к краю проезжей части и остановиться.", img: "" },
            { text: "Не меняя полосу движения, снизить скорость или остановиться, если впереди появятся транспортные средства.", img: "" },
            { text: "Включить аварийную световую сигнализацию и, не меняя полосу движения, снизить скорость и остановиться.", img: "" }
        ]
    },
    {
        q: "7. Что называется остановочным путем?",
        img: "Question/7/7.jpg",
        answer: 0,
        options: [
            { text: "Путь, пройденный автомобилем с момента обнаружения водителем опасности, до его полной остановки", img: "" },
            { text: "Дистанция, пройденная автомобилем за время, когда водителю стало известно об опасности до начала торможения", img: "" }
        ]
    },
    {
        q: "8. Какие световые приборы должны быть включены на транспортном средстве при движении в тоннеле с искусственным освещением?",
        img: "Question/8/8.jpg",
        answer: 2,
        options: [
            { text: "Аварийная световая сигнализация.", img: "" },
            { text: "Дальний свет фар.", img: "" },
            { text: "Ближний свет фар.", img: "" },
            { text: "Световые приборы не включаются.", img: "" }
        ]
    },
    {
        q: "9. Где положено хранить медицинскую аптечку в автомобиле?",
        img: "Question/9/9.jpg",
        answer: 1,
        options: [
            { text: "В кузове автомобиля на видном месте.", img: "" },
            { text: "В закрепленном состоянии в местах, установленных предприятием изготовителем.", img: "" },
            { text: "В багажнике легкового автомобиля.", img: "" }
        ]
    },
    {
        q: "10. Разрешается ли перевозка людей на грузовом прицепе?",
        img: "Question/10/10.jpg",
        answer: 1,
        options: [
            { text: "Разрешается.", img: "" },
            { text: "Запрещается.", img: "" },
            { text: "Разрешается только лицам, сопровождающим груз.", img: "" }
        ]
    }    
];