

//Array of Objects

const quiz = [
    
    {
        q: "1. Какой знак запрещает движение грузового автомобиля с прицепом, если суммарная разрешенная максимальная масса автомобиля и прицепа равна 7 т?",
        img: "Question/1/1.jpg",
        answer: 1,
        options: [
            { text: "5", img: "" },
            { text: "4", img: "" },
            { text: "3", img: "" },
            { text: "1", img: "" },
            { text: "2", img: "" }
        ]
    },
    {
        q: "2. Какой из знаков указывает знак направление объезда закрытого для движения участка проезжей части на дороге с разделительной полосой?",
        img: "Question/2/2.jpg",
        answer: 4,
        options: [
            { text: "1", img: "" },
            { text: "2", img: "" },
            { text: "4", img: "" },
            { text: "3", img: "" },
            { text: "5", img: "" }
        ]
    },
    {
        q: "3. Разрешается ли использовать для движения посадочную площадку, обозначенную разметкой?",
        img: "Question/3/3.jpg",
        answer: 1,
        options: [
            { text: "Разрешается.", img: "" },
            { text: "Запрещается.", img: "" },
            { text: "Разрешается при отсутствии трамвая на остановке.", img: "" }
        ]
    },
    {
        q: "4. Транспортные средства проедут перекресток следующем порядке:",
        img: "Question/4/4.jpg",
        answer: 1,
        options: [
            { text: "Красный с зеленым, синий.", img: "" },
            { text: "Все одновременно.", img: "" },
            { text: "Синий, красный, зеленый.", img: "" }
        ]
    },
    {
        q: "5. Движение разрешено:",
        img: "Question/5/5.jpg",
        answer: 2,
        options: [
            { text: "Трамваю. Синему автомобилю.", img: "" },
            { text: "Мотоциклу.", img: "" },
            { text: "Красному автомобилю.", img: "" },
            { text: "Трамваю и красному автомобилю.", img: "" },
            { text: "Синий одновременно с зеленым, красный.", img: "" }
        ]
    },
    {
        q: "6. Разрешается ли водителю красного автомобиля выполнить обгон в данной ситуации?",
        img: "Question/6/6.jpg",
        answer: 1,
        options: [
            { text: "Разрешается при условии, что скорость обгоняемого менее 40 км/ч.", img: "" },
            { text: "Разрешается.", img: "" },
            { text: "Запрещается.", img: "" }
        ]
    },
    {
        q: "7. Нарушает ли водитель правила при движении вне населенного пункта?",
        img: "Question/7/7.jpg",
        answer: 1,
        options: [
            { text: "Нет.", img: "" },
            { text: "Да.", img: "" }
        ]
    },
    {
        q: "8. Ближе какого расстояния от железнодорожных переездов запрещается стоянка транспортных средств?",
        img: "Question/8/8.jpg",
        answer: 1,
        options: [
            { text: "300 м.", img: "" },
            { text: "50 м.", img: "" },
            { text: "25 м.", img: "" },
            { text: "150 м.", img: "" },
            { text: "100 м.", img: "" }
        ]
    },
    {
        q: "9. Как выполнять непрямой массаж сердца и искусственное дыхание, если оживление (реанимацию) проводят 2 человека одновременно?",
        img: "Question/9/9.jpg",
        answer: 0,
        options: [
            { text: "Два раза вдувать воздух, затем 30 раз надавливать на область сердца и т.д.", img: "" },
            { text: "Один раз надавливать на грудную клетку, один раз вдувать воздух и т.д.", img: "" },
            { text: "После 2-3 раз вдуваний воздуха 15 раз надавливать на грудную клетку.", img: "" }
        ]
    },
    {
        q: "10. Кто регламентирует массу перевозимого груза и распределения нагрузки по осям?",
        img: "Question/10/10.jpg",
        answer: 0,
        options: [
            { text: "Предприятие-изготовитель данного транспортного средства.", img: "" },
            { text: "ГСБДД.", img: "" },
            { text: "Администрация автохозяйства.", img: "" }
        ]
    }    
];