

//Array of Objects

const quiz = [
    
    {
        q: "1. Разрешается ли пассажирам отвлекать водителя при управлении транспортным средством?",
        img: "Question/1/1.jpg",
        answer: 0,
        options: [
            { text: "Запрещается.", img: "" },
            { text: "Разрешается.", img: "" },
            { text: "Разрешается только для покупки разовых талонов в маршрутных транспортных средствах.", img: "" }
        ]
    },
    {
        q: "2. На какие транспортные средства действие этого знака не распространяется?",
        img: "Question/2/2.jpg",
        answer: 2,
        options: [
            { text: "На автомобиль, управляемый инвалидом, который обозначен опознавательным знаком 'Инвалид'.", img: "" },
            { text: "Маршрутное такси.", img: "" },
            { text: "Маршрутные транспортные средства.", img: "" },
            { text: "Таксистам, у которых работает таксомер, и транспортным средствам, на которых установлен опознавательный знак 'Инвалид'.", img: "" },
            { text: "Такси с включенным таксометром.", img: "" }
        ]
    },
    {
        q: "3. Кто из водителей правильно произвел остановку для высадки пассажиров?",
        img: "Question/3/3.jpg",
        answer: 1,
        options: [
            { text: "Только водитель такси.", img: "" },
            { text: "Водители мотоцикла и такси.", img: "" },
            { text: "Водитель такси и красного автомобиля.", img: "" },
            { text: "Все водители.", img: "" }
        ]
    },
    {
        q: "4. Что обозначает прерывистая широкая линия?",
        img: "Question/4/4.jpg",
        answer: 1,
        options: [
            { text: "Границу между проезжей частью дороги и обочиной.", img: "" },
            { text: "Границу между основной проезжей частью и полосой разгона или торможения.", img: "" },
            { text: "Площадки для остановки и стоянки транспортных средств.", img: "" }
        ]
    },
    {
        q: "5. Водитель какого транспортного средства имеет право на первоочередное движение?",
        img: "Question/5/5.jpg",
        answer: 1,
        options: [
            { text: "Водитель автомобиля.", img: "" },
            { text: "Водитель мотоцикла.", img: "" }
        ]
    },
    {
        q: "6. Разрешен ли обгон водителю красного автомобиля в такой ситуации?",
        img: "Question/6/6.jpg",
        answer: 0,
        options: [
            { text: "Разрешен.", img: "" },
            { text: "Разрешен только при отсутствии встречных транспортных средств.", img: "" },
            { text: "Запрещен.", img: "" }
        ]
    },
    {
        q: "7. Вы поворачиваете на дорогу с реверсивным движением. По какой полосе после поворота Вы имеете право двигаться?",
        img: "Question/7/7.jpg",
        answer: 2,
        options: [
            { text: "Вне населенных пунктов по возможности ближе к правому краю проезжей части.", img: "" },
            { text: "В населенных пунктах движение разрешается по любой полосе.", img: "" },
            { text: "По крайней правой полосе. Перестраиваться разрешается только после проезда реверсивного светофора или знака “Направления движения по полосам”, разрешающего движение и по другим полосам.", img: "" }
        ]
    },
    {
        q: "8. Стоянка запрещается:",
        img: "Question/8/8.jpg",
        answer: 1,
        options: [
            { text: "Более 10 метров перед пешеходным переходом.", img: "" },
            { text: "В тех местах, где стоящее транспортное средство делает невозможным движение (въезд или выезд) других транспортных средств или создает помехи для движения пешеходов.", img: "" },
            { text: "Более 30 метров от края пересекаемых проезжих частей.", img: "" },
            { text: "Далее одного метра за пешеходным переходом.", img: "" }
        ]
    },
    {
        q: "9. Какие правила торможения автопоезда должен соблюдать водитель?",
        img: "Question/9/9.jpg",
        answer: 1,
        options: [
            { text: "Тормозить резким порывистым нажатием на педаль тормоза, выключив при этом сцепление.", img: "" },
            { text: "Тормозить плавно, заблаговременно снизить скорость, не выключая сцепление.", img: "" }
        ]
    },
    {
        q: "10. Разрешается ли перевозить детей на мотоцикле без бокового прицепа?",
        img: "Question/10/10.jpg",
        answer: 0,
        options: [
            { text: "Разрешается детей старше 12-летнего возраста.", img: "" },
            { text: "Запрещается.", img: "" },
            { text: "Разрешается при наличии взрослого пассажира.", img: "" },
            { text: "Разрешается.", img: "" }
        ]
    }    
];