

//Array of Objects

const quiz = [
    
    {
        q: "1. Разрешается ли обгон на этом участке дороги?",
        img: "Question/1/1.jpg",
        answer: 1,
        options: [
            { text: "Разрешается, если обгоняемый автомобиль движется со скоростью меньше чем 40 км/ч.", img: "" },
            { text: "Запрещается.", img: "" },
            { text: "Разрешается, если обгон завершается до железнодорожного переезда.", img: "" }
        ]
    },
    {
        q: "2. Какой знак обязывает уступить дорогу транспортным средствам, движущимся по пересекаемой дороге?",
        img: "Question/2/2.jpg",
        answer: 2,
        options: [
            { text: "5", img: "" },
            { text: "3", img: "" },
            { text: "4", img: "" },
            { text: "1", img: "" },
            { text: "2", img: "" }
        ]
    },
    {
        q: "3. Что обязан выполнить водитель транспортного средства, приблизившись к перекрестку, перед которым нанесена ’’Стоп-линия\" и включен зеленый сигнал светофора?",
        img: "Question/3/3.jpg",
        answer: 1,
        options: [
            { text: "Остановиться у 'Стоп-линий', а затем возобновить движение.", img: "" },
            { text: "Продолжить движение через перекресток без остановки.", img: "" }
        ]
    },
    {
        q: "4. Водитель какого транспортного средства должен уступить дорогу?",
        img: "Question/4/4.jpg",
        answer: 0,
        options: [
            { text: "Водитель мотоцикла.", img: "" },
            { text: "Водитель автомобиля.", img: "" }
        ]
    },
    {
        q: "5. Что должен сделать водитель в данной ситуации?",
        img: "Question/5/5.jpg",
        answer: 1,
        options: [
            { text: "Проехать данный участок, так как дети пересекают проезжую часть не по пешеходному переходу.", img: "" },
            { text: "Уступить дорогу детям, переходящим проезжую часть.", img: "" },
            { text: "Объехать стоящее транспортное средство на минимальной скорости, заблаговременно включив ближний свет фар и периодически подавая звуковой сигнал.", img: "" }
        ]
    },
    {
        q: "6. Водитель какого транспортного средства правильно въезжает на пересечение с круговым движением?",
        img: "Question/6/6.jpg",
        answer: 0,
        options: [
            { text: "Оба водителя", img: "" },
            { text: "Только водитель легкового автомобиля", img: "" },
            { text: "Только водитель автобуса", img: "" }
        ]
    },
    {
        q: "7. Разрешается ли водителю автобуса остановиться для высадки пассажиров?",
        img: "Question/7/7.jpg",
        answer: 0,
        options: [
            { text: "Запрещается.", img: "" },
            { text: "Разрешается.", img: "" }
        ]
    },
    {
        q: "8. Вы выехали для обгона и неожиданно увидели встречный автомобиль. Если Вы не уверены в том, что сумеете завершить обгон, Вы должны:",
        img: "Question/8/8.jpg",
        answer: 2,
        options: [
            { text: "Продолжить обгон до его завершения, подавая звуковой сигнал и включив фары.", img: "" },
            { text: "Слегка увеличить скорость и быстрее завершить обгон.", img: "" },
            { text: "Снизить скорость и вернуться на ранее занимаемую полосу.", img: "" }
        ]
    },
    {
        q: "9. Должен ли водитель всегда включать и выключать фары в качестве предупредительного сигнала во время маневра?",
        img: "Question/9/9.jpg",
        answer: 1,
        options: [
            { text: "Только на дороге с интенсивным движением.", img: "" },
            { text: "Сигнал не подается в случаях, когда он может ввести в заблуждение других участников движения.", img: "" },
            { text: "Только в случае, если за ним движется другое транспортное средство.", img: "" },
            { text: "Только в случае, если его транспортное средство имеет указатели поворотов.", img: "" }
        ]
    },
    {
        q: "10. Разрешается ли следовать к месту стоянки или ремонта с недействующим рулевым управлением?",
        img: "Question/10/10.jpg",
        answer: 2,
        options: [
            { text: "Разрешается со скоростью, обеспечивающей безопасность движения.", img: "" },
            { text: "Разрешается при буксировке на жесткой сцепке.", img: "" },
            { text: "Запрещается.", img: "" }
        ]
    }    
];