

//Array of Objects

const quiz = [
    
    {
        q: "1. Как должен поступить водитель встречного автомобиля в данной ситуации?",
        img: "Question/1/1.jpg",
        answer: 1,
        options: [
            { text: "Остановиться на обочине.", img: "" },
            { text: "Продолжить движение, не создавая помех автомобилю с включенными проблесковыми маячками", img: "" }
        ]
    },
    {
        q: "2. В каком направлении разрешается движение автомобиля?",
        img: "Question/2/2.jpg",
        answer: 1,
        options: [
            { text: "Налево и направо.", img: "" },
            { text: "Во всех направлениях.", img: "" },
            { text: "Только прямо.", img: "" }
        ]
    },
    {
        q: "3. Что обозначает этот дорожный знак?",
        img: "Question/3/3.jpg",
        answer: 1,
        options: [
            { text: "Указывает расстояние до ближайшего поста ГАИ.", img: "" },
            { text: "Указывает номер дороги.", img: "" },
            { text: "Указывает расстояние до ближайшего населенного пункта.", img: "" },
            { text: "Дублирует 'Километровый знак'.", img: "" }
        ]
    },
    {
        q: "4. Разрешается ли въезд в разрывы разделительной полосы на автомагистрали?",
        img: "Question/4/4.jpg",
        answer: 2,
        options: [
            { text: "Разрешается.", img: "" },
            { text: "Разрешается только для разворота, кроме водителей грузовых автомобилей полной массой более 3,5 т.", img: "" },
            { text: "Запрещается.", img: "" },
            { text: "Разрешается маршрутным транспортным средствам.", img: "" }
        ]
    },
    {
        q: "5. Транспортные средства проедут перекресток в следующем порядке:",
        img: "Question/5/5.jpg",
        answer: 2,
        options: [
            { text: "Трамвай, красный, зеленый автомобили.", img: "" },
            { text: "Трамвай одновременно с зеленым автомобилем, красный автомобиль.", img: "" },
            { text: "Красный автомобиль, трамвай одновременно с зеленым автомобилем.", img: "" }
        ]
    },
    {
        q: "6. Водитель какого транспортного средства нарушает правила въезда на дорогу, при наличии на ней полосы разгона?",
        img: "Question/6/6.jpg",
        answer: 0,
        options: [
            { text: "Водитель зеленого автомобиля.", img: "" },
            { text: "Оба водителя.", img: "" },
            { text: "Водитель синего автомобиля.", img: "" },
            { text: "Оба водителя выезжают правильно.", img: "" }
        ]
    },
    {
        q: "7. Разрешается ли выезжать на крайнюю левую полосу, предназначенную для встречного движения на дорогах с двухсторонним движением, имеющих три полосы?",
        img: "Question/7/7.jpg",
        answer: 2,
        options: [
            { text: "Разрешается для обгона.", img: "" },
            { text: "Разрешается во всех случаях.", img: "" },
            { text: "Запрещается.", img: "" }
        ]
    },
    {
        q: "8. Когда водитель вынужден подавать предупреждающий знак перед остановкой?",
        img: "Question/8/8.jpg",
        answer: 1,
        options: [
            { text: "Только в случае, если сзади него движется другое транспортное средство.", img: "" },
            { text: "Во всех случаях.", img: "" },
            { text: "Только в населенных пунктах.", img: "" }
        ]
    },
    {
        q: "9. В каком ответе указаны все водители, нарушившие правила остановки?",
        img: "Question/9/9.jpg",
        answer: 0,
        options: [
            { text: "Водители всех транспортных средств.", img: "" },
            { text: "Водитель синей машины.", img: "" },
            { text: "Водители красного автомобиля и мотоцикла.", img: "" },
            { text: "Водитель мотоцикла.", img: "" }
        ]
    },
    {
        q: "10. Если эффективность торможения рабочей тормозной системы транспортных средств не отвечает требованиям Правил, то Вы должны:",
        img: "Question/10/10.jpg",
        answer: 2,
        options: [
            { text: "Прекратить дальнейшее движение.", img: "" },
            { text: "Продолжить намеченную поездку, при этом в светлое время суток включить ближний свет фар.", img: "" },
            { text: "Устранить неисправность на месте, а если это невозможно, следовать к месту стоянки или ремонта с соблюдением необходимых мер предосторожности.", img: "" }
        ]
    }
];