

//Array of Objects

const quiz = [
    
    {
        q: "1. Какому автомобилю разрешается остановка в зоне действия этих знаков?",
        img: "Question/1/1.jpg",
        answer: 0,
        options: [
            { text: 'Желтому автомобилю, обозначенному опознавательным знаком “Инвалид”', img: '' },
            { text: 'Красному автомобилю', img: '' },
            { text: 'Ни одному', img: '' },
            { text: 'Обоим автомобилям', img: '' }
        ],
        // solutionText: "Question/1/1.0.jpg"
    },
    {
        q: "2. По каким направлениям из числа обозначенных стрелками разрешается движение?",
        img: "Question/2/2.jpg",
        answer: 0,
        options: [
            { text: 'Только по направлению А и Г', img: '' },
            { text: 'Только по направлению В', img: '' },
            { text: 'Только по направлению Г', img: '' },
            { text: 'Только по направлению А', img: '' },
            { text: 'Только по направлению Б2', img: '' }
        ],
        // solutionText: "Question/2/2.0.jpg"
        
    },
    {
        q: "3. Эксплуатация каких транспортных средств запрещена, если у них отсутствуют аптечка и огнетушитель?",
        // img: "Question/3/3.jpg",
        answer: 0,
        options: [
            { text: 'Все указанные категории транспортных средств', img: '' },
            { text: 'Только категории транспортных средств М2, М3, N1', img: '' },
            { text: 'Только категории транспортных средств М1', img: '' },
            { text: 'Только категории транспортных средств N2, N3', img: '' }
        ],
        // solutionText: "Question/3/3.0.jpg"
    },
    {
        q: "4. Какой автомобиль проедет перекресток первым:",
        img: "Question/4/4.jpg",
        answer: 0,
        options: [
            { text: 'Зеленый автомобиль', img: '' },
            { text: 'Красный автомобиль', img: '' },
            { text: 'Синий автомобиль', img: '' },
            { text: 'Желтый автомобиль', img: '' }
        ],
        // solutionText: "Question/4/4.0.jpg"
    },
    {
        q: "5. Движение запрещено:",
        img: "Question/5/5.jpg",
        answer: 0,
        options: [
            { text: 'Синему, зеленому и белому автомобилям', img: '' },
            { text: 'Красному и белому автомобилям', img: '' },
            { text: 'Белому, синему и желтому автомобилям', img: '' }
        ],
        // solutionText: "Question/5/5.0.jpg"
    },
    {
        q: "6. Водители каких транспортных средств проедут перекресток первыми?",
        img: "Question/6/6.jpg",
        answer: 0,
        options: [
            { text: 'Водители автомобиля и автобуса', img: '' },
            { text: 'Водитель трамвая', img: '' }
        ],
        // solutionText: "Question/6/6.0.jpg"
    },
    {
        
        q: "7. Разрешается ли стоянка в этом месте?",
        img: "Question/7/7.jpg",
        answer: 0,
        options: [
            { text: 'Разрешается', img: '' },
            { text: 'Запрещается', img: '' }
        ],
        // solutionText: "Question/7/7.0.jpg"
    },
    {
        
        q: "8. Что обязан выполнить водитель перед началом движения?",
        answer: 0,
        options: [
            { text: 'Убедиться, что начало движения будет безопасным и он не создаст помех другим участникам движения', img: '' },
            { text: 'Выполнить все перечисленные действия', img: '' },
            { text: 'Проверить исправность и комплектность транспортного средства', img: '' },
            { text: 'Подать сигнал световым указателем поворота соответствующего направления', img: '' }
        ],
        // solutionText: "Question/8/8.0.jpg"
    },
    {
        q: "9. Как транспортировать пострадавшего с повреждением грудного отдела позвоночника?",
        img: 'Question/9/9.jpg',
        answer: 2,
        options: [
            { text: 'Лежа на боку на жестком щите', img: '' },
            { text: 'Лежа на спине на мягкой подстилке', img: '' },
            { text: 'Лежа на спине на жестком щите', img: '' }
        ],
        // solutionText: "Question/9/9.0.jpg"
    },
    {
        q: "10. Таким опознавательным знаком обозначается транспортное средство:",
        img: "Question/10/10.jpg",
        answer: 0,
        options: [
            { text: 'Транспортное средство, длина которого с грузом или без груза более 20м', img: '' },
            { text: 'Перевозящее людей в кузове-фургоне', img: '' },
            { text: 'Перевозящее тяжеловесные и крупногабаритные грузы', img: '' }
        ],
        // solutionText: "Question/10/10.0.jpg"
    }
];