

//Array of Objects

const quiz = [
    
    {
        q: "1. Синий автомобиль проедет перекресток:",
        img: "Question/1/1.jpg",
        answer: 1,
        options: [
            { text: "Вторым одновременно с красным." },
            { text: "Третьим одновременно с красным." },
            { text: "Первым одновременно с красным." }
        ]
    },
    {
        q: "2. При каком знаке обязательно останавливаться?",
        img: "Question/2/2.jpg",
        answer: 0,
        options: [
            { text: "4" },
            { text: "1" },
            { text: "2" },
            { text: "5" },
            { text: "3" }
        ]
    },
    {
        q: "3. Что обозначает эта вертикальная дорожная разметка?",
        img: "Question/3/3.jpg",
        answer: 1,
        options: [
            { text: "Обозначает бордюры на опасных участках." },
            { text: "Обозначает боковые поверхности ограждений дорог на других участках." },
            { text: "Обозначает направляющие столбики, надолбы, опоры ограждений и т.п." },
            { text: "Обозначает границы полос движения в опасных местах на дорогах." }
        ]
    },
    {
        q: "4. Должен ли водитель пропускать слепых пешеходов, подающих сигнал белой тростью?",
        img: "Question/4/4.jpg",
        answer: 1,
        options: [
            { text: "Должен на регулируемом пешеходном переходе." },
            { text: "Должен во всех случаях, в том числе и вне пешеходных переходов." },
            { text: "Должен на любом пешеходном переходе." },
            { text: "Должен на нерегулируемом пешеходном переходе." }
        ]
    },
    {
        q: "5. На каком рисунке водитель поворачивает правильно?",
        img: "Question/5/5.jpg",
        answer: 1,
        options: [
            { text: "На правом рисунке." },
            { text: "На левом рисунке." }
        ]
    },
    {
        q: "6. Какой автомобиль правильно поставлен на стоянку?",
        img: "Question/6/6.jpg",
        answer: 0,
        options: [
            { text: "Оба неправильно." },
            { text: "Оба правильно." },
            { text: "Красный." }
        ]
    },
    {
        q: "7. Если ширина проезжей части недостаточна для разворота из крайнего левого положения, допускается ли производить его от правого края проезжей части или с правой обочины?",
        img: "Question/7/7.jpg",
        answer: 1,
        options: [
            { text: "Допускается только от правого края проезжей части. С правой обочины не допускается." },
            { text: "Допускается. При этом водитель, производящий разворот, должен уступить дорогу попутным и встречным транспортным средствам." },
            { text: "Не допускается." }
        ]
    },
    {
        q: "8. По какой полосе разрешается движение безрельсовых транспортных средств в населенных пунктах, если имеются три полосы и более в одном направлении? Грузовые автомобили с разрешенной максимальной массой более 3.5т не учитывать.",
        img: "Question/8/8.jpg",
        answer: 0,
        options: [
            { text: "По любой полосе кроме крайней левой, на которую разрешается выезжать только при интенсивном движении на других полосах, а также для поворота налево, разворота и остановки на дороге с односторонним движением." },
            { text: "По возможности ближе к правому краю проезжей части." },
            { text: "По любой полосе." }
        ]
    },
    {
        q: "9. Что обозначают одновременно включенные красный и желтый сигналы светофора?",
        img: "Question/9/9.jpg",
        answer: 2,
        options: [
            { text: "Приближение к перекрестку транспортного средства, подающего звуковой или световой сигнал." },
            { text: "Можно начинать движение." },
            { text: "Запрещает движение и информирует о скором включении зеленого света." }
        ]
    },
    {
        q: "10. Что означает данный опознавательный знак, установленный на автомобиле?",
        img: "Question/10/10.jpg",
        answer: 0,
        options: [
            { text: "Автомобиль принадлежит водителю врачу." },
            { text: "Автомобиль принадлежит водителю инвалиду." },
            { text: "Автомобиль предназначен для оказания медпомощи на дому." }
        ]
    }    
];