

//Array of Objects

const quiz = [
    
    {
        q: '1. Прилегающая территория - ...?',
        img: 'Question/1/1.jpg',
        answer: 2,
        options: [
            { text: 'Место пересечения, примыкания или разветвления дорог на одном уровне.', img: '' },
            { text: 'Часть дороги, предназначенная для движения безрельсовых транспортных средств.', img: '' },
            { text: 'Территория, непосредственно прилегающая к дороге и не предназначенная для сквозного движения транспортных средств (дворы, жилые массивы, автостоянки, автозаправочные станции, предприятия и т. п.).', img: '' }
        ]
    },
    {
        q: '2. Суммарный люфт в рулевом управлении в регламентированных условиях испытаний автотранспортного средства категория М3 не должен превышать следующих значений:',
        img: 'Question/2/2.jpg',
        answer: 2,
        options: [
            { text: '10°', img: '' },
            { text: '25°', img: '' },
            { text: '20°', img: '' }
        ]
    },
    {
        q: '3. С какой целью применяется этот дорожный знак?',
        img: 'Question/3/3.jpg',
        answer: 0,
        options: [
            { text: 'Движение без остановки запрещено', img: '' },
            { text: 'Для принятия меры предосторожности', img: '' },
            { text: 'Для принудительного снижения скорости движения', img: '' }
        ]
    },
    {
        q: '4. При наличии каких знаков водитель пользуется преимуществом, если встречный разъезд затруднен препятствием?',
        img: 'Question/4/4.jpg',
        answer: 3,
        options: [
            { text: 'Только c', img: '' },
            { text: 'Только b', img: '' },
            { text: 'a и b', img: '' },
            { text: 'Только d', img: '' }
        ]
    },
    {
        q: '5. О чём обозначает эта вертикальная разметка?',
        img: 'Question/5/5.jpg',
        answer: 1,
        options: [
            { text: 'Обозначает приближение к опасному перекрёстку', img: '' },
            { text: 'Обозначает боковые поверхности ограждений дорог на закруглениях малого радиуса, крутых спусках, других опасных участках', img: '' },
            { text: 'Обозначает приближение к железнодорожному переезду', img: '' }
        ]
    },
    {
        q: '6. Разрешается ли водителю выполнить указанный манёвр на перекрёстке, двигаясь задним ходом?',
        img: 'Question/6/6.jpg',
        answer: 1,
        options: [
            { text: 'Разрешается', img: '' },
            { text: 'Запрещается', img: '' }
        ]
    },
    {
        q: '7. Принято считать, что среднее время реакции водителя составляет:',
        img: 'Question/7/7.jpg',
        answer: 2,
        options: [
            { text: 'Примерно 5 секунд', img: '' },
            { text: 'Примерно 0,2 секунды', img: '' },
            { text: 'Примерно 1 секунда', img: '' }
        ]
    },
    {
        q: '8. Что указывает этот дорожный знак?',
        img: 'Question/8/8.jpg',
        answer: 0,
        options: [
            { text: 'Запрещает движение транспортных средств с опасным грузом', img: '' },
            { text: 'Запрещает движение транспортных средств с тяжёлыми грузами', img: '' },
            { text: 'Запрещает движение транспортных средств с взрывчатыми и легковоспламеняющимися грузами', img: '' }
        ]
    },
    {
        q: '9. На повороте возник занос задней оси переднеприводного автомобиля. Ваши действия?',
        img: 'Question/9/9.jpg',
        answer: 0,
        options: [
            { text: 'Слегка увеличите подачу топлива, корректируя направление движения рулевым колесом', img: '' },
            { text: 'Уменьшите подачу топлива, рулевым колесом стабилизируете движение', img: '' },
            { text: 'Притормозите и повернёте рулевое колесо в сторону заноса', img: '' },
            { text: 'Значительно увеличите подачу топлива, не меняя положения рулевого колеса', img: '' }
        ]
    },
    {
        q: '10. Оказание первой помощи при травме головного мозга, сотрясении мозга или травме шейного отдела:',
        img: 'Question/10/10.jpg',
        answer: 2,
        options: [
            { text: 'Успокоение пострадавшего, охлаждение области ранения путём наложения холодного компресса, льда, на ослабление боли и уменьшение кровотечения.', img: '' },
            { text: 'Уложив пострадавшего набок, под область шеи подложить твёрдую подушку, крепко связать и отправить в больницу', img: '' },
            { text: 'Пострадавшего надо положить на твёрдые носилки, под область шеи подложить твёрдую подушку, не двигать, крепко связать и отправить в больницу', img: '' }
        ]
    }    
];