

//Array of Objects

const quiz = [
    
    {
        q: '1. Обеспечение безопасности дорожного движения —',
        img: 'Question/1/1.jpg',
        answer: 0,
        options: [
            { text: 'Деятельность, направленная на предупреждение причин возникновения дорожно-транспортных происшествий, снижение тяжести их последствий', img: '' },
            { text: 'Совокупность отношений, возникающих в процессе перемещения людей и грузов с помощью транспортных средств или без таковых в пределах дорог.', img: '' }
        ]
    },
    {
        q: '2. Какой знак предписывает совершить обязательную кратковременную остановку перед стоп-линией, а в её отсутствие перед краем пересекаемой проезжей части?',
        img: 'Question/2/2.jpg',
        answer: 2,
        options: [
            { text: 'a', img: '' },
            { text: 'a и d', img: '' },
            { text: 'b', img: '' },
            { text: 'b и c', img: '' },
            { text: 'd', img: '' }
        ]
    },
    {
        q: '3. Каким способом разрешается остановка и стоянка транспортных средств на нерасширенных участках проезжей части?',
        img: 'Question/3/3.jpg',
        answer: 0,
        options: [
            { text: 'Параллельно', img: '' },
            { text: 'Под углом', img: '' },
            { text: 'Любым способом', img: '' }
        ]
    },
    {
        q: '4. О чем предупреждает мигающий жёлтый сигнал светофора?',
        img: 'Question/4/4.jpg',
        answer: 0,
        options: [
            { text: 'Все ответы правильные', img: '' },
            { text: 'Разрешает движению', img: '' },
            { text: 'О нерегулируемом перекрестке', img: '' }
        ]
    },
    {
        q: '5. Какие знаки обозначают конец зоны запрещения обгона грузовыми автомобилями?',
        img: 'Question/5/5.jpg',
        answer: 2,
        options: [
            { text: 'Только a', img: '' },
            { text: 'Только b', img: '' },
            { text: 'a,b,c', img: '' },
            { text: 'Только a,b', img: '' }
        ]
    },
    {
        q: '6. Какое транспортное средство должен уступить дорогу?',
        img: 'Question/6/6.jpg',
        answer: 0,
        options: [
            { text: 'Автобус', img: '' },
            { text: 'Легковой автомобиль', img: '' }
        ]
    },
    {
        q: '7. Животных по дороге следует перегонять, как правило:',
        img: 'Question/7/7.jpg',
        answer: 1,
        options: [
            { text: 'В темное время суток', img: '' },
            { text: 'В светлое время суток', img: '' },
            { text: 'В любое время', img: '' }
        ]
    },
    {
        q: '8. Кто должен уступить дорогу внеперекрестков, на нерегулируемом пересечении велосипедной дорожки с дорогой?',
        img: 'Question/8/8.jpg',
        answer: 0,
        options: [
            { text: 'Велосипедисты и водители мопеда', img: '' },
            { text: 'Водители транспортных средств', img: '' }
        ]
    },
    {
        q: '9. Как следует выбирать передачу при торможении двигателем с учетом крутизны спуска?',
        img: 'Question/9/9.jpg',
        answer: 1,
        options: [
            { text: 'Чем круче спуск, тем выше передача', img: '' },
            { text: 'Чем круче спуск, тем ниже передача', img: '' },
            { text: 'Выбор передачи не зависит от крутизны спуска', img: '' }
        ]
    },
    {
        q: '10. Травма головного мозга характеризуется следующими основными признаками:',
        img: 'Question/10/10.jpg',
        answer: 3,
        options: [
            { text: 'Рвота - два-три раза, в тяжёлых случаях больше', img: '' },
            { text: 'Амнезия - потеря памяти, связана с полученной травмой и некоторые события жизни стираются из памяти', img: '' },
            { text: 'Потеря сознания может длиться от нескольких секунд до нескольких часов', img: '' },
            { text: 'Во всех случаях вышеуказанных', img: '' }
        ]
    }    
];