

//Array of Objects

const quiz = [
    
    {
        q: "1. Синий автомобиль проедет перекресток:",
        img: "Question/1/1.jpg",
        answer: 0,
        options: [
            { text: "Третьим.", img: "" },
            { text: "Вторым.", img: "" },
            { text: "Первым.", img: "" },
            { text: "Последним.", img: "" }
        ]
    },
    {
        q: "2. Какой знак называется “Пересечение с велосипедной дорожкой”?",
        img: "Question/2/2.jpg",
        answer: 4,
        options: [
            { text: "4", img: "" },
            { text: "5", img: "" },
            { text: "1", img: "" },
            { text: "3", img: "" },
            { text: "2", img: "" }
        ]
    },
    {
        q: "3. С каким дорожным знаком применяется эта разметка?",
        img: "Question/3/3.jpg",
        answer: 1,
        options: [
            { text: "С предупреждающим знаком \"Пересечение равнозначных дорог\".", img: "" },
            { text: "Со знаком \"Уступите дорогу\".", img: "" },
            { text: "Со всеми перечисленными знаками.", img: "" },
            { text: "Со знаком \"Движение без остановки запрещено\".", img: "" }
        ]
    },
    {
        q: "4. Автомобили проедут перекресток в следующем порядке:",
        img: "Question/4/4.jpg",
        answer: 0,
        options: [
            { text: "Синий с зеленым, желтый.", img: "" },
            { text: "Синий, желтый с зеленым.", img: "" },
            { text: "Желтый, зеленый, синий.", img: "" }
        ]
    },
    {
        q: "5. Автомобили проедут перекресток в следующем порядке:",
        img: "Question/5/5.jpg",
        answer: 1,
        options: [
            { text: "Желтый выедет на перекресток и остановится, чтобы пропустить зеленый; синий одновременно с красным.", img: "" },
            { text: "Зеленый, синий одновременно с красным, желтый.", img: "" },
            { text: "Синий одновременно с красным; зеленый, желтый.", img: "" }
        ]
    },
    {
        q: "6. На каком расстоянии от « Стоп- линии» или знака « Движение без остановки запрещено» должен остановиться водитель для пропуска приближающегося поезда?",
        img: "Question/6/6.jpg",
        answer: 2,
        options: [
            { text: "1,5 м.", img: "" },
            { text: "10 м", img: "" },
            { text: "Непосредственно у \"Стоп- линий\" и (или) знака.", img: "" },
            { text: "2,5 м.", img: "" },
            { text: "5 м.", img: "" }
        ]
    },
    {
        q: "7. Нарушает ли Правила водитель мотоцикла?",
        img: "Question/7/7.jpg",
        answer: 1,
        options: [
            { text: "Нет.", img: "" },
            { text: "Да.", img: "" }
        ]
    },
    {
        q: "8. В каких случаях водителю легкового автомобиля при езде вне населённых пунктов запрещается превышать установленную скорость?",
        img: "Question/8/8.jpg",
        answer: 3,
        options: [
            { text: "Если он буксирует другие транспортные средства.", img: "" },
            { text: "Только если он двигается с прицепом.", img: "" },
            { text: "Только если на дороге установлены дорожные знаки, ограничивающие скорость движения.", img: "" },
            { text: "Во всех перечисленных случаях.", img: "" }
        ]
    },
    {
        q: "9. Разрешается ли перевозить людей при буксировке на гибкой или жесткой сцепке в буксируемом механическом транспортном средстве?",
        img: "Question/9/9.jpg",
        answer: 1,
        options: [
            { text: "Разрешается в автобусе и троллейбусе.", img: "" },
            { text: "Разрешается в кабине грузового автомобиля и в легковом автомобиле.", img: "" },
            { text: "Запрещается.", img: "" },
            { text: "Разрешается в грузовом и легковом автомобилях.", img: "" }
        ]
    },
    {
        q: "10. Разрешается ли эксплуатация автомобиля, если отсутствует предусмотренные конструкцией транспортного средства зеркала заднего вида?",
        img: "Question/10/10.jpg",
        answer: 0,
        options: [
            { text: "Запрещается.", img: "" },
            { text: "Разрешается, если имеется хотя бы одно зеркало.", img: "" },
            { text: "Разрешается, если заднее стекло не закрыто шторками.", img: "" }
        ]
    }    
];