

//Array of Objects

const quiz = [
    
    {
        q: "1. В каких случаях увеличивается центробежная сила автомобиля на поворотах?",
        img: "Question/1/1.jpg",
        answer: 2,
        options: [
            { text: "С увеличением радиуса поворота.", img: "" },
            { text: "С уменьшением скорости движения.", img: "" },
            { text: "С увеличением скорости движения.", img: "" }
        ]
    },
    {
        q: "2. Действие, какого из знаков не распространяется на маршрутные транспортные средства?",
        img: "Question/2/2.jpg",
        answer: 1,
        options: [
            { text: "2", img: "" },
            { text: "4", img: "" },
            { text: "3", img: "" },
            { text: "5", img: "" },
            { text: "1", img: "" }
        ]
    },
    {
        q: "3. Разрешается ли в этом месте произвести разворот?",
        img: "Question/3/3.jpg",
        answer: 0,
        options: [
            { text: "Запрещается.", img: "" },
            { text: "Разрешается.", img: "" }
        ]
    },
    {
        q: "4. Автомобили проедут перекресток в следующем порядке:",
        img: "Question/4/4.jpg",
        answer: 2,
        options: [
            { text: "Синий; зеленый; красный.", img: "" },
            { text: "Зеленый; красный; синий.", img: "" },
            { text: "Красный; синий; зеленый.", img: "" }
        ]
    },
    {
        q: "5. Разрешается ли в этой обстановке водителю красного автомобиля продолжать движение через пешеходный переезд?",
        img: "Question/5/5.jpg",
        answer: 1,
        options: [
            { text: "Разрешается.", img: "" },
            { text: "Запрещается.", img: "" }
        ]
    },
    {
        q: "6. Сигнал регулировщика свистком служит:",
        img: "Question/6/6.jpg",
        answer: 0,
        options: [
            { text: "Для привлечения внимания участников движения.", img: "" },
            { text: "Разрешающим сигналом для пешеходов.", img: "" },
            { text: "Для замены в необходимых случаях сигнала “рука поднята вверх”.", img: "" }
        ]
    },
    {
        q: "7. В каких местах из перечисленных не запрещается остановка и стоянка транспортных средств?",
        img: "Question/7/7.jpg",
        answer: 2,
        options: [
            { text: "Ближе 30 м от края пересекаемой проезжей части.", img: "" },
            { text: "Во всех указанных местах.", img: "" },
            { text: "На мостах, путепроводах, имеющих 3 и более полосы движения в одном направлении.", img: "" }
        ]
    },
    {
        q: "8. Что запрещается водителю обгоняемого транспортного средства?",
        img: "Question/8/8.jpg",
        answer: 1,
        options: [
            { text: "Препятствовать обгону снижением скорости движения своего транспортного средства.", img: "" },
            { text: "Препятствовать обгону путем повышения скорости движения или иными действиями.", img: "" },
            { text: "Двигаться со скоростью более 40 км/час.", img: "" }
        ]
    },
    {
        q: "9. Откуда начинают бинтовать грудную клетку при обширном ее ранении?",
        img: "Question/9/9.jpg",
        answer: 1,
        options: [
            { text: "От подмышечных ямок.", img: "" },
            { text: "От нижних отделов грудной клетки.", img: "" },
            { text: "С середины грудной клетки.", img: "" }
        ]
    },
    {
        q: "10. В каком из перечисленных случаев разрешается эксплуатация транспортных средств?",
        img: "Question/10/10.jpg",
        answer: 0,
        options: [
            { text: "На переднюю ось легкового автомобиля категории М1 установлены шины, восстановленные по первому классу ремонта.", img: "" },
            { text: "На одну ось транспортного средства установлены диагональные шины совместно с радиальными.", img: "" },
            { text: "Шины по размеру и допустимой нагрузке не соответствуют модели транспортного средства.", img: "" }
        ]
    }    
];