

//Array of Objects

const quiz = [
    
    {
        q: "1. Какую дорогу считать главной?",
        img: "Question/1/1.jpg",
        answer: 0,
        options: [
            { text: "Дорогу с твёрдым покрытием по отношению к грунтовой или обозначенную соответствующими знаками.", img: "" },
            { text: "Дорогу с многополосной проезжей частью по отношению к дороге с одной полосой для движения в каждом направлении.", img: "" },
            { text: "Дорогу с продолжением в обе стороны по отношению к примыкающей на трехстороннем перекрестке.", img: "" }
        ]
    },
    {
        q: "2. Какой знак (табличка) указывает способ постановки транспортного средства на стоянку?",
        img: "Question/2/2.jpg",
        answer: 1,
        options: [
            { text: "1", img: "" },
            { text: "3", img: "" },
            { text: "4", img: "" },
            { text: "5", img: "" },
            { text: "2", img: "" }
        ]
    },
    {
        q: "3. Сплошная желтая линия горизонтальной разметки в сочетании со знаком \"Остановка запрещена\" разрешает остановку:",
        img: "Question/3/3.jpg",
        answer: 3,
        options: [
            { text: "Автобусам, троллейбусам и автомобилям такси.", img: "" },
            { text: "Автобусам и троллейбусам.", img: "" },
            { text: "Всем транспортным средствам, производящим высадку пассажиров.", img: "" },
            { text: "Только маршрутным транспортным средствам.", img: "" }
        ]
    },
    {
        q: "4. Только с разрешения начальника дистанции пути железной дороги допускается движение через переезд транспортных средств, скорость движения которых менее:",
        img: "Question/4/4.jpg",
        answer: 2,
        options: [
            { text: "3 км/ч.", img: "" },
            { text: "5 км/ч.", img: "" },
            { text: "8 км/ч.", img: "" },
            { text: "10 км/ч.", img: "" },
            { text: "30 км/ч.", img: "" }
        ]
    },
    {
        q: "5. Водитель красного автомобиля:",
        img: "Question/5/5.jpg",
        answer: 0,
        options: [
            { text: "Должен уступить дорогу.", img: "" },
            { text: "Имеет преимущество на первоочередное движение.", img: "" }
        ]
    },
    {
        q: "6. Разрешается ли разворот в разрывах разделительной полосы на участках дорог, обозначенных этим знаком?",
        img: "Question/6/6.jpg",
        answer: 1,
        options: [
            { text: "Разрешается.", img: "" },
            { text: "Запрещается.", img: "" },
            { text: "Разрешается только транспортным средствам с полной массой до 3,5 тонны.", img: "" }
        ]
    },
    {
        q: "7. Допускается ли движение транспортных средств по тротуарам и пешеходным дорожкам?",
        img: "Question/7/7.jpg",
        answer: 3,
        options: [
            { text: "Не допускается, так как это может поставить под угрозу безопасность пешеходов.", img: "" },
            { text: "Допускается, если это не затрудняет движение пешеходов.", img: "" },
            { text: "Допускается для объезда стоящего у тротуара другого транспортного средства.", img: "" },
            { text: "Допускается при обслуживании торговых и других предприятий, расположенных непосредственно у этих тротуаров или дорожек.", img: "" }
        ]
    },
    {
        q: "8. С какой максимальной скоростью разрешается движение междугородным автобусам на участках дорог, обозначенных таким дорожным знаком?",
        img: "Question/8/8.jpg",
        answer: 3,
        options: [
            { text: "80 км/ч.", img: "" },
            { text: "60 км/ч.", img: "" },
            { text: "50 км/ч.", img: "" },
            { text: "90 км/ч.", img: "" },
            { text: "70 км/ч.", img: "" }
        ]
    },
    {
        q: "9. Разрешается ли буксировка мотоциклов?",
        img: "Question/9/9.jpg",
        answer: 1,
        options: [
            { text: "Запрещается.", img: "" },
            { text: "Разрешается мотоциклам с боковым прицепом.", img: "" },
            { text: "Разрешается мотоциклам без бокового прицепа.", img: "" },
            { text: "Разрешается в равнинной местности.", img: "" }
        ]
    },
    {
        q: "10. Этот дорожный знак обозначает:",
        img: "Question/10/10.jpg",
        answer: 1,
        options: [
            { text: "Направление движения к объекту в населенном пункте.", img: "" },
            { text: "Дорогу, не имеющую сквозного проезда.", img: "" },
            { text: "Конец дополнительной полосы на подъеме или полосы разгона.", img: "" }
        ]
    }    
];