

//Array of Objects

const quiz = [
    
    {
        q: "1. Синий автомобиль пересечет перекресток:",
        img: "Question/1/1.jpg",
        answer: 0,
        options: [
            { text: "Четвертым.", img: "" },
            { text: "Вторым.", img: "" },
            { text: "Последним.", img: "" },
            { text: "Первым.", img: "" },
            { text: "Третьим.", img: "" }
        ]
    },
    {
        q: "2. Какой знак называется 'Конец дороги с односторонним движением'?",
        img: "Question/2/2.jpg",
        answer: 4,
        options: [
            { text: "2", img: "" },
            { text: "3", img: "" },
            { text: "5", img: "" },
            { text: "1", img: "" },
            { text: "4", img: "" }
        ]
    },
    {
        q: "3. Этот дорожный знак означает, что:",
        img: "Question/3/3.jpg",
        answer: 1,
        options: [
            { text: "Запрещается обгонять все механические транспортные средства, кроме одиночных, движущихся со скоростью менее 40 км/ч, двухколесных мотоциклов без бокового прицепа и велосипедов.", img: "" },
            { text: "Грузовым автомобилям, разрешенная максимальная масса которых превышает 3,5 т, запрещается обгонять все транспортные средства, кроме одиночных, движущихся со скоростью менее 40 км/ч.", img: "" }
        ]
    },
    {
        q: "4. Вторым проедет перекресток:",
        img: "Question/4/4.jpg",
        answer: 0,
        options: [
            { text: "Зеленый автомобиль.", img: "" },
            { text: "Синий автомобиль.", img: "" },
            { text: "Красный автомобиль.", img: "" }
        ]
    },
    {
        q: "5. Разрешается ли на этом перекрестке повернуть налево?",
        img: "Question/5/5.jpg",
        answer: 1,
        options: [
            { text: "Запрещается.", img: "" },
            { text: "Разрешается.", img: "" }
        ]
    },
    {
        q: "6. Разрешается ли движение по автомагистралям транспортных средств, скорость которых по технической характеристике или их состоянию менее 40 км/ч?",
        img: "Question/6/6.jpg",
        answer: 2,
        options: [
            { text: "Разрешается, если не установлен знак 'Ограничение минимальной скорости'.", img: "" },
            { text: "Разрешается не далее второй полосы.", img: "" },
            { text: "Запрещается.", img: "" }
        ]
    },
    {
        q: "7. Разрешается ли обгонять автобус в этом месте?",
        img: "Question/7/7.jpg",
        answer: 1,
        options: [
            { text: "Запрещается.", img: "" },
            { text: "Разрешается.", img: "" }
        ]
    },
    {
        q: "8. Аварийная световая сигнализация должна быть включена:",
        img: "Question/8/8.jpg",
        answer: 2,
        options: [
            { text: "При остановке и стоянке на неосвещенных участках дорог или в условиях недостаточной видимости при неисправных габаритных или стояночных огнях.", img: "" },
            { text: "При дорожно-транспортном происшествии.", img: "" },
            { text: "Во всех перечисленных случаях.", img: "" },
            { text: "При вынужденной остановке в местах, где остановка запрещена.", img: "" }
        ]
    },
    {
        q: "9. Что понимается под временем реакции?",
        img: "Question/9/9.jpg",
        answer: 1,
        options: [
            { text: "Время с момента, когда водитель начал тормозить, до полной остановки транспортного средства.", img: "" },
            { text: "Время с момента обнаружения водителем опасности, до начала ответных действий.", img: "" }
        ]
    },
    {
        q: "10. На задней стенке кузова автотранспортных средств категорий N2; N3; O3; O4; M2; M3 (кроме особо малых) должен быть нанесен:",
        img: "Question/10/10.jpg",
        answer: 0,
        options: [
            { text: "Хорошо видимый номерной знак.", img: "" },
            { text: "Опознавательный знак о принадлежности транспортного средства.", img: "" },
            { text: "Общеизвестные знаки.", img: "" }
        ]
    }    
];