

//Array of Objects

const quiz = [
    
    {
        q: "1. Дает ли преимущество в движении включенный проблесковый маячок оранжевого цвета?",
        img: "Question/1/1.jpg",
        answer: 0,
        options: [
            { text: 'Не дает', img: '' },
            { text: 'Дает', img: '' }
        ],
        // solutionText: "Question/1/1.0.jpg"
    },
    {
        q: "2. Эти знаки разрешают движение:",
        img: "Question/2/2.jpg",
        answer: 0,
        options: [
            { text: 'Прямо, направо и в обратном направлении', img: '' },
            { text: 'Только направо', img: '' },
            { text: 'Только прямо', img: '' },
            { text: 'Только налево', img: '' }
        ],
        // solutionText: "Question/2/2.0.jpg"
        
    },
    {
        q: "3. О чем предупреждает данная разметка?",
        img: "Question/3/3.jpg",
        answer: 0,
        options: [
            { text: 'О приближении транспортных средств к «СТОП-ЛИНИИ», когда она применяется в сочетаниии со знаком «Движение без остановки запрещено»', img: '' },
            { text: 'Указывает место, где транспортное средство должно уступить дорогу пешеходам', img: '' },
            { text: 'О приближении к месту обязательной остановки транспортных средств', img: '' }
        ],
        // solutionText: "Question/3/3.0.jpg"
    },
    {
        q: "4. На автомагистрали запрещено:",
        img: "Question/4/4.jpg",
        answer: 0,
        options: [
            { text: 'Все перечисленные действия', img: '' },
            { text: 'Остановка вне специальных площадок для стоянки, обозначенных знаком "Место стоянки" или "Место отдыха"', img: '' },
            { text: 'Движение задним ходом', img: '' },
            { text: 'Разворот и въезд в разрывы разделительной полосы', img: '' },
        ],
        // solutionText: "Question/4/4.0.jpg"
    },
    {
        q: "5. Кто из водителей имеет право двигаться в прямом направлении?",
        img: "Question/5/5.jpg",
        answer: 0,
        options: [
            { text: 'Водитель легкового автомобиля', img: '' },
            { text: 'Водители автобуса и мотоцикла', img: '' },
            { text: 'Водители легкового и грузового автомобилей', img: '' }
        ],
        // solutionText: "Question/5/5.0.jpg"
    },
    {
        q: "6. Водитель какого транспортного средства должен уступить дорогу?",
        img: "Question/6/6.jpg",
        answer: 0,
        options: [
            { text: 'Водитель трамвая', img: '' },
            { text: 'Водитель автомобиля', img: '' }
        ],
        // solutionText: "Question/6/6.0.jpg"
    },
    {
        
        q: "7. Что должен выполнять водитель при движении транспортного средства задним ходом?",
        img: "Question/7/7.jpg",
        answer: 0,
        options: [
            { text: 'Не создавать помех другим участникам движения. Для обеспечения безопасности движения он, при необходимости, должен прибегнуть к помощи других лиц', img: '' },
            { text: 'Включить габаритные огни', img: '' },
            { text: 'Использовать с помощью других лиц', img: '' },
            { text: 'Включить задние противотуманные фонари, если они имеются на транспортном средстве', img: '' }
        ],
        // solutionText: "Question/7/7.0.jpg"
    },
    {
        
        q: "8. Когда запрещается выезжать на сторону дороги, предназначенную для встречного движения?",
        answer: 0,
        options: [
            { text: 'Во всех перечисленных случаях', img: '' },
            { text: 'На дорогах с двухсторонним движением, имеющим четыре полосы и более', img: '' },
            { text: 'На дорогах двухсторонним движением, имеющих четыре полосы для движения при наличии дорожной разметки в виде двух сплошных линий, разделяющих транспортные потоки противоположных направлений', img: '' }
        ],
        // solutionText: "Question/8/8.0.jpg"
    },
    {
        q: "9. При движении по кривой дороге автомобиль более устойчив, если движение осуществляется:",
        img: 'Question/9/9.jpg',
        answer: 0,
        options: [
            { text: 'С включенной передачей', img: '' },
            { text: 'С выключенной передачей', img: '' },
            { text: 'С увеличением скорости', img: '' }
        ],
        // solutionText: "Question/9/9.0.jpg"
    },
    {
        q: "10. При каких условиях запрещается эксплуатация транспортных средств?",
        img: "Question/10/10.jpg",
        answer: 0,
        options: [
            { text: 'При всех указанных условиях', img: '' },
            { text: 'Не действует рабочая тормозная система', img: '' },
            { text: 'Подтекает жидкость из системы гидравлических тормозов', img: '' },
            { text: 'Компрессор не обеспечивает установленного давления в системе пневматических тормозов', img: '' }
        ],
        // solutionText: "Question/10/10.0.jpg"
    }
];