

//Array of Objects

const quiz = [
    
    {
        q: "1. О чем вас информирует данный знак?",
        img: "Question/1/1.jpg",
        answer: 1,
        options: [
            { text: "О запрете движения по правой полосе всем транспортным средствам, кроме маршрутных.", img: "" },
            { text: "О месте остановки автобуса и (или) троллейбуса.", img: "" }
        ]
    },
    {
        q: "2. Какой знак предупреждает о приближении к железнодорожному переезду со шлагбаумом?",
        img: "Question/2/2.jpg",
        answer: 3,
        options: [
            { text: "1", img: "" },
            { text: "2", img: "" },
            { text: "3", img: "" },
            { text: "4", img: "" },
            { text: "5", img: "" }
        ]
    },
    {
        q: "3. Каким грузовым автомобилям разрешается продолжать движение при этом знаке?",
        img: "Question/3/3.jpg",
        answer: 1,
        options: [
            { text: "Автомобилям с надписью 'Связь'.", img: "" },
            { text: "Автомобилям с пассажирами в специально оборудованном кузове.", img: "" },
            { text: "Автомобилям, перевозящим продукты в кузове-фургоне.", img: "" }
        ]
    },
    {
        q: "4. Разрешается ли переезжать через железнодорожный переезд сельскохозяйственным, дорожным и строительным механическим транспортным средствам на гусеничном ходу?",
        img: "Question/4/4.jpg",
        answer: 0,
        options: [
            { text: "Разрешается загруженными на механические транспортные средства в транспортном положении.", img: "" },
            { text: "Разрешается, если получено разрешение начальника дистанции пути железной дороги.", img: "" },
            { text: "Запрещается.", img: "" }
        ]
    },
    {
        q: "5. В каком направлении разрешено движение?",
        img: "Question/5/5.jpg",
        answer: 2,
        options: [
            { text: "Направо во второй проезд.", img: "" },
            { text: "Направо в первый и второй проезды.", img: "" },
            { text: "Направо в первый проезд.", img: "" },
            { text: "Прямо и направо в первый проезд.", img: "" }
        ]
    },
    {
        q: "6. Последним проедет перекресток:",
        img: "Question/6/6.jpg",
        answer: 2,
        options: [
            { text: "Синий автомобиль.", img: "" },
            { text: "Красный автомобиль.", img: "" },
            { text: "Зеленый автомобиль.", img: "" }
        ]
    },
    {
        q: "7. Данный знак:",
        img: "Question/7/7.jpg",
        answer: 1,
        options: [
            { text: "Запрещает движение всех транспортных средств, кроме колесных тракторов.", img: "" },
            { text: "Запрещает движение тракторов и самоходных машин.", img: "" },
            { text: "Запрещает движение всех видов механических транспортных средств, кроме двухколесного мотоцикла без коляски.", img: "" }
        ]
    },
    {
        q: "8. Транспортные средства проедут через перекресток в следующем порядке:",
        img: "Question/8/8.jpg",
        answer: 2,
        options: [
            { text: "Трамвай, красный, затем синий автомобили.", img: "" },
            { text: "Трамвай, синий автомобиль выйдет на перекресток, пропустит красный и завершит поворот.", img: "" },
            { text: "Синий автомобиль, трамвай, красный автомобиль.", img: "" }
        ]
    },
    {
        q: "9. Какое расстояние между транспортными средствами должна обеспечить гибкая сцепка?",
        img: "Question/9/9.jpg",
        answer: 4,
        options: [
            { text: "4-8м.", img: "" },
            { text: "2-4м.", img: "" },
            { text: "1-3м.", img: "" },
            { text: "3-6м.", img: "" },
            { text: "4-6м.", img: "" }
        ]
    },
    {
        q: "10. При какой неисправности запрещается дальнейшее движение транспортных средств?",
        img: "Question/10/10.jpg",
        answer: 0,
        options: [
            { text: "Не действует стеклоочиститель со стороны водителя во время дождя или снегопада.", img: "" },
            { text: "Не работают в установленном режиме или загрязнены внешние световые приборы и светоотражатели.", img: "" },
            { text: "Не работают предусмотренные конструкцией транспортных средств стеклоомыватели.", img: "" },
            { text: "Во всех перечисленных случаях.", img: "" }
        ]
    }    
];