

//Array of Objects

const quiz = [
    
    {
        q: "1. Лица, уполномоченные регулировать дорожное движение, должны иметь при себе:",
        img: "Question/1/1.jpg",
        answer: 0,
        options: [
            { text: "Все перечисленные отличительные знаки.", img: "" },
            { text: "Соответствующее удостоверение и отличительный знак- нарукавную повязку.", img: "" },
            { text: "Диск с красным сигналом (светоотражателем) или флажок.", img: "" },
            { text: "Жезл.", img: "" }
        ]
    },
    {
        q: "2. Какой знак разрешает разворот?",
        img: "Question/2/2.jpg",
        answer: 0,
        options: [
            { text: "2", img: "" },
            { text: "5", img: "" },
            { text: "3", img: "" },
            { text: "4", img: "" },
            { text: "1", img: "" }
        ]
    },
    {
        q: "3. Если высота автомобиля (с грузом или без груза) более указанной на знаке, водитель должен:",
        img: "Question/3/3.jpg",
        answer: 2,
        options: [
            { text: "Иметь разрешения на проезд от руководителя автохозяйства.", img: "" },
            { text: "Получить разрешения на проезд у ближайшего ГСБДД.", img: "" },
            { text: "Объехать участок дороги по другому маршруту.", img: "" }
        ]
    },
    {
        q: "4. Автомобили проедут перекресток в следующем порядке:",
        img: "Question/4/4.jpg",
        answer: 0,
        options: [
            { text: "Зеленый, синий, красный.", img: "" },
            { text: "Красный, синий, зеленый.", img: "" },
            { text: "Зеленый одновременно с красным, синий.", img: "" }
        ]
    },
    {
        q: "5. Преимущество в движении имеет:",
        img: "Question/5/5.jpg",
        answer: 2,
        options: [
            { text: "Водитель автобуса, выезжающий на перекресток при разрешающем сигнале светофора.", img: "" },
            { text: "Водитель автобуса, выезжающий на перекресток по главной дороге.", img: "" },
            { text: "Водитель легкого автомобиля, завершающий на перекрестке разворот.", img: "" }
        ]
    },
    {
        q: "6. Чем должен руководствоваться водитель, когда значение дорожных знаков и линий разметки противоречат друг другу?",
        img: "Question/6/6.jpg",
        answer: 0,
        options: [
            { text: "Дорожными знаками.", img: "" },
            { text: "Линиями разметки.", img: "" }
        ]
    },
    {
        q: "7. Водитель какого транспортного средства правильно выполняет обгон?",
        img: "Question/7/7.jpg",
        answer: 1,
        options: [
            { text: "Водитель легкового автомобиля", img: "" },
            { text: "Водитель грузового автомобиля", img: "" },
            { text: "Оба правильно", img: "" },
            { text: "Оба неправильно", img: "" }
        ]
    },
    {
        q: "8. При движении в тоннелях с искусственным освещением Правила обязывают водителя:",
        img: "Question/8/8.jpg",
        answer: 3,
        options: [
            { text: "Подавать звуковой сигнал.", img: "" },
            { text: "Включить аварийную световую сигнализацию.", img: "" },
            { text: "Двигаться со скоростью не более 40 км/ч.", img: "" },
            { text: "Включить ближний свет фар.", img: "" }
        ]
    },
    {
        q: "9. Для предотвращения опасных последствий заноса автомобиля водитель должен:",
        img: "Question/9/9.jpg",
        answer: 2,
        options: [
            { text: "Нажать на педаль сцепления.", img: "" },
            { text: "Резко нажать на педаль тормоза.", img: "" },
            { text: "Прекратить начатое торможение.", img: "" }
        ]
    },
    {
        q: "10. Какой знак указывает расстояние до начала или конца дороги?",
        img: "Question/10/10.jpg",
        answer: 1,
        options: [
            { text: "4", img: "" },
            { text: "1", img: "" },
            { text: "2", img: "" },
            { text: "5", img: "" },
            { text: "3", img: "" }
        ]
    }    
];