

//Array of Objects

const quiz = [
    
    {
        q: "1. В каких направлениях может двигаться автомобиль?",
        img: "Question/1/1.jpg",
        answer: 0,
        options: [
            { text: 'Во всех направлениях.', img: '' },
            { text: 'Только направо.', img: '' },
            { text: 'Только прямо.', img: '' },
            { text: 'Остановиться и ждать зеленого сигнала светофора.', img: '' }
        ],
        // solutionText: "Question/1/1.0.jpg"
    },
    {
        q: "2. Что обозначает этот знак?",
        img: "Question/2/2.jpg",
        answer: 0,
        options: [
            { text: 'Обязывает водителя уступить дорогу встречным транспортным средствам.', img: '' },
            { text: 'Обозначает конец участка дороги с односторонним движением.', img: '' },
            { text: 'Предоставляет преимущество перед встречными транспортными средствами.', img: '' }
        ],
        // solutionText: "Question/2/2.0.jpg"
        
    },
    {
        q: "3. Разрешено ли водителю легкового автомобиля совершить маневр, двигаясь по обозначенным траекториям ?",
        img: "Question/3/3.jpg",
        answer: 0,
        options: [
            { text: 'Разрешено по обеим.', img: '' },
            { text: 'Разрешено только по Б.', img: '' },
            { text: 'Разрешено только по А.', img: '' }
        ],
        // solutionText: "Question/3/3.0.jpg"
    },
    {
        q: "4. Данный светофор запрещает движение?",
        img: "Question/4/4.jpg",
        answer: 0,
        options: [
            { text: 'Только налево.', img: '' },
            { text: 'Только направо.', img: '' },
            { text: 'Прямо и направо.', img: '' },
            { text: 'Прямо и налево.', img: '' }
        ],
        // solutionText: "Question/4/4.0.jpg"
    },
    {
        q: "5. Красный автомобиль:",
        img: "Question/5/5.jpg",
        answer: 0,
        options: [
            { text: 'Имеет преимущество перед синим, так как едет по главной дороге.', img: '' },
            { text: 'Должен уступить дорогу синему, приблизившемуся к перекрестку справа.', img: '' }
        ],
        // solutionText: "Question/5/5.0.jpg"
    },
    {
        q: "6. При остановке или стоянке на неосвещенных участках дорог в условиях недостаточной видимости водитель механического транспортного средства должен:",
        img: "Question/6/6.jpg",
        answer: 0,
        options: [
            { text: 'Включить габаритные огни.', img: '' },
            { text: 'Включить дальний свет фар.', img: '' },
            { text: 'Включить дальний свет фар.', img: '' }
        ],
        // solutionText: "Question/6/6.0.jpg"
    },
    {
        
        q: "7. Когда транспортное средство должно двигаться только по крайней правой полосе?",
        img: "Question/7/7.jpg",
        answer: 0,
        options: [
            { text: 'Когда транспортное средство по техническим причинам не может превышать скорость 40 км/ч.', img: '' },
            { text: 'При перевозке тяжеловесных и крупногабаритных грузов.', img: '' },
            { text: 'Если водитель почувствовал болезненное состояние.', img: '' },
            { text: 'Если во время движения ослабло крепление груза.', img: '' }
        ],
        // solutionText: "Question/7/7.0.jpg"
    },
    {
        
        q: "8. Дает ли водителю преимущественное право проезда подача предупредительного сигнала?",
        answer: 0,
        options: [
            { text: 'Не дает.', img: '' },
            { text: 'Дает во всех случаях.', img: '' },
            { text: 'Дает при завершении маневра.', img: '' },
            { text: 'Дает при начале маневра.', img: '' }
        ],
        // solutionText: "Question/8/8.0.jpg"
    },
    {
        q: "9. Какая общая длина поезда сцепленных транспортных средств допускается Правилами при буксировке?",
        img: 'Question/9/9.jpg',
        answer: 0,
        options: [
            { text: '20 м.', img: '' },
            { text: '18 м.', img: '' },
            { text: '21 м.', img: '' },
            { text: '22 м.', img: '' }
        ],
        // solutionText: "Question/9/9.0.jpg"
    },
    {
        q: "10. С какого возраста правила разрешают управлять легковыми автомобилями?",
        img: "Question/10/10.jpg",
        answer: 0,
        options: [
            { text: 'С 18 лет.', img: '' },
            { text: 'С 16 лет.', img: '' },
            { text: 'С 14 лет.', img: '' }
        ],
        // solutionText: "Question/10/10.0.jpg" 
    }
];