

//Array of Objects

const quiz = [
    
    {
        q: '1. Перекресток — это ...',
        img: 'Question/1/1.jpg',
        answer: 1,
        options: [
            { text: 'Часть дороги, предназначенная для движения безрельсовых транспортных средств.', img: '' },
            { text: 'Место пересечения, примыкания или разветвления дорог на одном уровне.', img: '' },
            { text: 'Территория, непосредственно прилегающая к дороге и не предназначенная для сквозного движения транспортных средств (дворы, жилые массивы, автостоянки, автозаправочные станции, предприятия и т. п.).', img: '' }
        ]
    },
    {
        q: '2. Какой знак запрещает движение транспортных средств с опасным грузом?',
        img: 'Question/2/2.jpg',
        answer: 2,
        options: [
            { text: 'a', img: '' },
            { text: 'b', img: '' },
            { text: 'c', img: '' }
        ]
    },
    {
        q: '3. Разрешается ли водителю продолжить движение после переключения зеленого сигнала светофора на желтый, если возможно остановиться перед перекрестком, только применив экстренное торможение?',
        img: 'Question/3/3.jpg',
        answer: 0,
        options: [
            { text: 'Разрешается', img: '' },
            { text: 'Запрещается', img: '' }
        ]
    },
    {
        q: '4. ДЛЯ каких видов транспортных средств запрещает движение без остановки этот знак?',
        img: 'Question/4/4.jpg',
        answer: 1,
        options: [
            { text: 'Легковых автомобилей', img: '' },
            { text: 'Всех видов транспортных средств.', img: '' },
            { text: 'Грузовых автомобилей', img: '' }
        ]
    },
    {
        q: '5. Покажите безопасную дистанцию.',
        img: 'Question/5/5.jpg',
        answer: 0,
        options: [
            { text: 'B', img: '' },
            { text: 'А и В', img: '' },
            { text: 'C', img: '' }
        ]
    },
    {
        q: '6. Кто уступит дорогу на этом перекрестке?',
        img: 'Question/6/6.jpg',
        answer: 1,
        options: [
            { text: 'Мотоцикл и желтый автомобиль', img: '' },
            { text: 'Синий автомобиль', img: '' }
        ]
    },
    {
        q: '7. Какой знак указывает велосипедную дорожку?',
        img: 'Question/7/7.jpg',
        answer: 2,
        options: [
            { text: 'b', img: '' },
            { text: 'a', img: '' },
            { text: 'c', img: '' }
        ]
    },
    {
        q: '8. Как называется любая из продольных полос проезжей части, обозначенная или необозначенная дорожной разметкой и имеющая ширину, достаточную для движения автомобилей в один ряд?',
        img: 'Question/8/8.jpg',
        answer: 0,
        options: [
            { text: 'Полоса движения', img: '' },
            { text: 'Обочина', img: '' },
            { text: 'Прилегающая территория', img: '' },
            { text: 'Проезжая часть', img: '' }
        ]
    },
    {
        q: '9. Какие знаки из указанных относятся к обгону?',
        img: 'Question/9/9.jpg',
        answer: 2,
        options: [
            { text: 'a и b', img: '' },
            { text: 'b и c', img: '' },
            { text: 'a и c', img: '' }
        ]
    },
    {
        q: '10. Признаки шока:',
        img: 'Question/10/10.jpg',
        answer: 0,
        options: [
            { text: 'Во всех случаях вышеуказанных', img: '' },
            { text: 'Побледнение кожи и слизистых оболочек', img: '' },
            { text: 'Сильное потоотделение', img: '' },
            { text: 'Спутанность сознания, обморочное состояние', img: '' },
            { text: 'Сухость рта, жажда, учащённое дыхание', img: '' }
        ]
    }    
];