

//Array of Objects

const quiz = [
    
    {
        q: "1. Черный автомобиль проедет перекресток:",
        img: "Question/1/1.jpg",
        answer: 2,
        options: [
            { text: "Первым.", img: "" },
            { text: "Последним.", img: "" },
            { text: "Вторым.", img: "" }
        ]
    },
    {
        q: "2. В каком направлении разрешено движение?",
        img: "Question/2/2.jpg",
        answer: 0,
        options: [
            { text: "Прямо, направо и налево.", img: "" },
            { text: "Во всех направлениях.", img: "" },
            { text: "Только прямо.", img: "" }
        ]
    },
    {
        q: "3. Какому автомобилю разрешено движение при этом знаке?",
        img: "Question/3/3.jpg",
        answer: 1,
        options: [
            { text: "Двухосному грузовому автомобилю, фактическая масса которого 12 т.", img: "" },
            { text: "Трехосному грузовому автомобилю, фактическая масса которого 12 т.", img: "" },
            { text: "Прямо и направо.", img: "" }
        ]
    },
    {
        q: "4. Вторым проедет перекресток:",
        img: "Question/4/4.jpg",
        answer: 1,
        options: [
            { text: "Зеленый автомобиль.", img: "" },
            { text: "Синий автомобиль.", img: "" },
            { text: "Красный автомобиль.", img: "" }
        ]
    },
    {
        q: "5. О чем информируют черные стрелки на красном и желтом сигналах светофора?",
        img: "Question/5/5.jpg",
        answer: 1,
        options: [
            { text: "О разрешенных направлениях движения при красном и желтом сигналах светофора.", img: "" },
            { text: "О разрешенных направлениях движения при включении зеленого сигнала светофора.", img: "" }
        ]
    },
    {
        q: "6. Чем определяется число пассажиров при перевозке в кузове грузового автомобиля?",
        img: "Question/6/6.jpg",
        answer: 2,
        options: [
            { text: "Решением водителя.", img: "" },
            { text: "Указанием администрации.", img: "" },
            { text: "Числом оборудованных для сиденья мест.", img: "" },
            { text: "Срочностью перевозки.", img: "" }
        ]
    },
    {
        q: "7. Водитель какого автомобиля нарушил правила стоянки?",
        img: "Question/7/7.jpg",
        answer: 0,
        options: [
            { text: "Красный", img: "" },
            { text: "Никто не нарушил", img: "" },
            { text: "Оба нарушили", img: "" },
            { text: "Желтый", img: "" }
        ]
    },
    {
        q: "8. В каких случаях следует включать фары в дневное время при организации группы детей в автобусах?",
        img: "Question/8/8.jpg",
        answer: 3,
        options: [
            { text: "Только когда интенсивное движение", img: "" },
            { text: "На усмотрение водителя", img: "" },
            { text: "Только в условиях, когда видимость недостаточна", img: "" },
            { text: "Во всех случаях перевозки", img: "" }
        ]
    },
    {
        q: "9. На какой срок может быть наложен кровоостанавливающий жгут на голень зимой?",
        img: "Question/9/9.jpg",
        answer: 0,
        options: [
            { text: "Не более чем на 1 час.", img: "" },
            { text: "Не более чем на 2 часа.", img: "" },
            { text: "Не более чем на 3 часа.", img: "" }
        ]
    },
    {
        q: "10. Шины автобусов должны иметь остаточную высоту рисунка протектора не менее:",
        img: "Question/10/10.jpg",
        answer: 3,
        options: [
            { text: "1,6 мм.", img: "" },
            { text: "2,5 мм.", img: "" },
            { text: "1,0 мм.", img: "" },
            { text: "2,0 мм.", img: "" },
            { text: "0,8 мм.", img: "" }
        ]
    }    
];