

//Array of Objects

const quiz = [
    
    {
        q: "1. Этот дорожный знак обозначает:",
        img: "Question/1/1.jpg",
        answer: 0,
        options: [
            { text: 'Участок дороги, на котором имеется пешеходный переход', img: '' },
            { text: 'Участок дороги, на котором имеется тротуар или пешеходная дорожка', img: '' }
        ],
        // solutionText: "Question/1/1.0.jpg"
    },
    {
        q: "2. Каким транспортным средствам разрешена стоянка?",
        img: "Question/2/2.jpg",
        answer: 0,
        options: [
            { text: 'Легковому автомобилю и мотоциклу', img: '' },
            { text: 'Ко всем автомобилям', img: '' },
            { text: 'Только легковому автомобилю', img: '' },
            { text: 'Только мотоциклу', img: '' },
            { text: 'Только грузовому автомобилю', img: '' }
        ],
        // solutionText: "Question/2/2.0.jpg"
        
    },
    {
        q: "3. Этот дорожный знак предупреждает:",
        img: "Question/3/3.jpg",
        answer: 0,
        options: [
            { text: 'О необорудованном шлагбаумом железнодорожном переезде с одним путем', img: '' },
            { text: 'О необорудованном шлагбаумом Железнодорожном переезд с двумя путями', img: '' },
            { text: 'О приближение к железнодорожному переезду с одним путем', img: '' }
        ],
        // solutionText: "Question/3/3.0.jpg"
    },
    {
        q: "4. Синий автомобиль проедет перекресток:",
        img: "Question/4/4.jpg",
        answer: 0,
        options: [
            { text: 'Первым', img: '' },
            { text: 'Вторым', img: '' }
        ],
        // solutionText: "Question/4/4.0.jpg"
    },
    {
        q: "5. Каким транспортным средствам разрешено движение?",
        img: "Question/5/5.jpg",
        answer: 0,
        options: [
            { text: 'Легковому автомобилю', img: '' },
            { text: 'Грузовому автомобилю', img: '' },
            { text: 'Мотоциклу', img: '' },
            { text: 'Автобусу', img: '' },
            { text: 'Легковому и и грузовому автомобилям', img: '' }
        ],
        // solutionText: "Question/5/5.0.jpg"
    },
    {
        q: "6. Водитель какого транспортного средства должен уступить дорогу?",
        img: "Question/6/6.jpg",
        answer: 0,
        options: [
            { text: 'Водитель автомобиля', img: '' },
            { text: 'Водитель мотоцикла', img: '' }
        ],
        // solutionText: "Question/6/6.0.jpg"
    },
    {
        
        q: "7. На дороге с двухсторонним движением, имеющей три полосы, Вам необходимо повернуть направо. С какой полосы Вы осуществите данный маневр?",
        img: "Question/7/7.jpg",
        answer: 0,
        options: [
            { text: 'С правой полосы', img: '' },
            { text: 'Со средней полосы', img: '' },
            { text: 'С правой или средней полосы', img: '' },
            { text: 'Со средней полосы, но лишь когда занята правая полоса', img: '' }
        ],
        // solutionText: "Question/7/7.0.jpg"
    },
    {
        
        q: "8. В каких местах разрешается стоянка транспортных средств под углом к краю проезжей части?",
        img: "Question/8/8.jpg",
        answer: 0,
        options: [
            { text: 'На расширенных участках проезжей части, с условием, что не будет создана помеха другим участникам движения', img: '' },
            { text: 'На дорогах с двумя полосами движения в каждом направлении', img: '' },
            { text: 'Только на дорогах с односторонним движением', img: '' },
            { text: 'На дорогах с тремя и более полосами движения в каждом направлении', img: '' }
        ],
        // solutionText: "Question/8/8.0.jpg"
    },
    {
        q: "9. Какой материал лучше подходит для использования в качестве иммобилизирующей шины при переломе костей?",
        img: 'Question/9/9.jpg',
        answer: 0,
        options: [
            { text: 'Кусок доски', img: '' },
            { text: 'Бинт', img: '' },
            { text: 'Ткань', img: '' }
        ],
        // solutionText: "Question/9/9.0.jpg"
    },
    {
        q: "10. Разрешается ли следовать к месту стоянки или ремонта в темное время суток на дорогах без искусственного освещения или в условиях недостаточной видимости с негорящими задними габаритными огнями?",
        img: "Question/10/10.jpg",
        answer: 0,
        options: [
            { text: 'Запрещается', img: '' },
            { text: 'Разрешается с особой осторожностью', img: '' }
        ],
        // solutionText: "Question/10/10.0.jpg"
    }
];