

//Array of Objects

const quiz = [
    
    {
        q: "1. К Вам приближается транспортное средство, на котором включен проблесковый маячок синего цвета и специальный звуковой сигнал. Как Вы должны поступить, если движетесь навстречу такому транспортному средству?",
        img: "Question/1/1.jpg",
        answer: 1,
        options: [
            { text: "Остановиться на обочине или у тротуара.", img: "" },
            { text: "Продолжать движение, не создавая помех транспортному средству с включёнными специальными сигналами.", img: "" }
        ]
    },
    {
        q: "2. Что означает дополнительный информационный знак под нижеуказанным знаком?",
        img: "Question/2/2.jpg",
        answer: 0,
        options: [
            { text: "Обозначает участок дороги, на котором установили фото и видео наблюдение со стороны ГИБДД.", img: "" },
            { text: "Обозначает участок дороги, на котором запрещено фото и видео фиксация.", img: "" }
        ]
    },
    {
        q: "3. По какому пути из числа обозначенных стрелками разрешено движение?",
        img: "Question/3/3.jpg",
        answer: 2,
        options: [
            { text: "Прямо, налево и в обратном направлении.", img: "" },
            { text: "Налево и в обратном направлении.", img: "" },
            { text: "Только прямо.", img: "" }
        ]
    },
    {
        q: "4. Транспортные средства проедут перекресток в следующем порядке:",
        img: "Question/4/4.jpg",
        answer: 1,
        options: [
            { text: "Трамвай, автомобиль, мотоцикл.", img: "" },
            { text: "Мотоцикл, автомобиль, трамвай.", img: "" },
            { text: "Трамвай, мотоцикл, автомобиль.", img: "" }
        ]
    },
    {
        q: "5. Вторым проедет перекресток:",
        img: "Question/5/5.jpg",
        answer: 2,
        options: [
            { text: "Зеленый автомобиль.", img: "" },
            { text: "Красный автомобиль.", img: "" },
            { text: "Синий автомобиль.", img: "" }
        ]
    },
    {
        q: "6. При остановке в темное время суток на неосвещенных участках дорог в случае неисправности габаритных огней необходимо:",
        img: "Question/6/6.jpg",
        answer: 1,
        options: [
            { text: "Включить ближний свет.", img: "" },
            { text: "Отвезти транспортное средство за пределы дороги, а если это невозможно, его необходимо обозначить в соответствии с требованиями Правил.", img: "" },
            { text: "Принять правее и включить ближний свет фар.", img: "" }
        ]
    },
    {
        q: "7. Разрешена ли остановка в этом месте?",
        img: "Question/7/7.jpg",
        answer: 0,
        options: [
            { text: "Запрещена.", img: "" },
            { text: "Разрешена.", img: "" }
        ]
    },
    {
        q: "8. На каком рисунке показаны разрешенные направления движения?",
        img: "Question/8/8.jpg",
        answer: 2,
        options: [
            { text: "На среднем рисунке.", img: "" },
            { text: "На левом рисунке.", img: "" },
            { text: "На правом рисунке.", img: "" },
            { text: "На среднем и правом рисунке.", img: "" }
        ]
    },
    {
        q: "9. Задние противотуманные фонари могут применяться:",
        img: "Question/9/9.jpg",
        answer: 2,
        options: [
            { text: "При разгрузке груза в темное время суток.", img: "" },
            { text: "При движении в тоннелях.", img: "" },
            { text: "Только в условиях недостаточной видимости.", img: "" },
            { text: "При движении в колонне в темное время суток.", img: "" },
            { text: "Во всех перечисленных случаях.", img: "" }
        ]
    },
    {
        q: "10. Разрешается ли эксплуатация транспортных средств, у которых между сдвоенными шинами имеются инородные предметы?",
        img: "Question/10/10.jpg",
        answer: 2,
        options: [
            { text: "Разрешается при движении со скоростью не более 40 км/ч.", img: "" },
            { text: "Разрешается только по правой полосе дороги при наличии двух и более полос для движения в данном направлении.", img: "" },
            { text: "Запрещается.", img: "" }
        ]
    }    
];