

//Array of Objects

const quiz = [
    
    {
        q: "1. Что должен сделать водитель, если неожиданно лопнула шина?",
        img: "Question/1/1.jpg",
        answer: 2,
        options: [
            { text: "Тормозить рабочим тормозом до полной остановки машины.", img: "" },
            { text: "Остановить машину с помощью стояночного тормоза.", img: "" },
            { text: "Держать руль, сохранить движение по прямой, снизить скорость и остановить машину.", img: "" }
        ]
    },
    {
        q: "2. Какой из знаков устанавливается непосредственно перед опасным участком дороги?",
        img: "Question/2/2.jpg",
        answer: 2,
        options: [
            { text: "1", img: "" },
            { text: "3", img: "" },
            { text: "5", img: "" },
            { text: "4", img: "" },
            { text: "2", img: "" }
        ]
    },
    {
        q: "3. Разрешается ли буксировка легкового автомобиля на участке дороги, обозначенном этим дорожным знаком?",
        img: "Question/3/3.jpg",
        answer: 1,
        options: [
            { text: "Разрешается.", img: "" },
            { text: "Запрещается.", img: "" }
        ]
    },
    {
        q: "4. Транспортные средства проедут перекресток в следующем порядке:",
        img: "Question/4/4.jpg",
        answer: 1,
        options: [
            { text: "Трамваи 1 и 2 одновременно с зеленым автомобилем; красный, синий автомобили.", img: "" },
            { text: "Трамвай 1 одновременно с зеленым автомобилем; красный автомобиль, трамвай 2; синий автомобиль.", img: "" }
        ]
    },
    {
        q: "5. По каким направлениям разрешено движение транспортных средств?",
        img: "Question/5/5.jpg",
        answer: 1,
        options: [
            { text: "Только автомобилю налево.", img: "" },
            { text: "Трамваю налево, автомобилю налево и в обратном направлении.", img: "" },
            { text: "Трамваю налево или прямо.", img: "" },
            { text: "Трамваю налево или прямо, автомобилю после трамвая.", img: "" },
            { text: "Трамваю и автомобилю налево.", img: "" }
        ]
    },
    {
        q: "6. Водителю какого автомобиля разрешена остановка?",
        img: "Question/6/6.jpg",
        answer: 0,
        options: [
            { text: "Водителю грузового автомобиля если для движения в одном направлении имеется 3 полосы и более.", img: "" },
            { text: "Обоим водителям.", img: "" },
            { text: "Водителю легкового автомобиля.", img: "" },
            { text: "Водителю грузового автомобиля.", img: "" }
        ]
    },
    {
        q: "7. Разворот запрещается:",
        img: "Question/7/7.jpg",
        answer: 2,
        options: [
            { text: "Ближе 15 м перед перекрестками.", img: "" },
            { text: "Вне населенных пунктов на участках с видимостью дороги в одном направлении менее 100 м.", img: "" },
            { text: "При видимости дороги менее 100 м хотя бы в одном направлении.", img: "" },
            { text: "На перекрестках и ближе 15 м от них.", img: "" }
        ]
    },
    {
        q: "8. Когда транспортному средству, скорость движения которого не превышает 40 км/ч., разрешается выезжать на левую полосу проезжей части?",
        img: "Question/8/8.jpg",
        answer: 1,
        options: [
            { text: "При перестроении перед поворотом или разворотом.", img: "" },
            { text: "Во всех перечисленных случаях.", img: "" },
            { text: "При обгоне, опережении или объезде.", img: "" },
            { text: "Во всех перечисленных случаях, а также если имеются три полосы и более для движения в одном направлении.", img: "" }
        ]
    },
    {
        q: "9. Кто имеет право обучать вождению в учебных организациях?",
        img: "Question/9/9.jpg",
        answer: 0,
        options: [
            { text: "Мастер обучения вождению, имеющий документы на право обучения вождению.", img: "" },
            { text: "Водитель 1-го и 2-го класса, имеющий водительский стаж 5 лет.", img: "" },
            { text: "Опытный водитель.", img: "" },
            { text: "Водитель со стажем 3 года.", img: "" }
        ]
    },
    {
        q: "10. Как обозначается груз, выступающий за габариты транспортного средства в темное время суток и в условиях недостаточной видимости?",
        img: "Question/10/10.jpg",
        answer: 1,
        options: [
            { text: "Сигнальными щитками или флажками (с нанесенными по диагонали красными и белыми чередующими полосами).", img: "" },
            { text: "Светоотражающими приспособлениями или фонарями спереди белого, сзади красного, сбоку оранжевого цвета.", img: "" },
            { text: "Флажками – сзади красными, спереди белыми.", img: "" }
        ]
    }    
];