

//Array of Objects

const quiz = [
    
    {
        q: "1. Разрешается ли водителю управлять транспортным средством под воздействием лекарственных препаратов, снижающих скорость реакции и внимание?",
        img: "Question/1/1.jpg",
        answer: 0,
        options: [
            { text: "Запрещается.", img: "" },
            { text: "Разрешается, если стаж водителя более 2-х лет.", img: "" },
            { text: "Разрешается.", img: "" }
        ]
    },
    {
        q: "2. Что означает вставка на синем фоне с наименованием населенного пункта на этом знаке?",
        img: "Question/2/2.jpg",
        answer: 1,
        options: [
            { text: "Указанный объект находится в данном населенном пункте.", img: "" },
            { text: "Данный объект находится вне этого населенного пункта и движение к нему осуществляется не по автомагистрали.", img: "" },
            { text: "К указанному населенному пункту будет осуществляться движение по автомагистрали.", img: "" }
        ]
    },
    {
        q: "3. Что обозначает данная разметка?",
        img: "Question/3/3.jpg",
        answer: 1,
        options: [
            { text: "Место, где необходимо остановиться, чтобы пропустить пешеходов, переходящих проезжую часть.", img: "" },
            { text: "Место, где велосипедная дорожка пересекает проезжую часть.", img: "" },
            { text: "Нерегулируемый пешеходный переход.", img: "" }
        ]
    },
    {
        q: "4. Транспортные средства проедут перекресток в следующем порядке:",
        img: "Question/4/4.jpg",
        answer: 2,
        options: [
            { text: "Красный, зеленый, синий автомобили.", img: "" },
            { text: "Зеленый, синий, красный автомобили.", img: "" },
            { text: "Зеленый, красный и вместе с ним синий автомобиль.", img: "" },
            { text: "Синий и красный автомобили, зеленый.", img: "" }
        ]
    },
    {
        q: "5. Как должен поступить водитель, поворачивая направо в показанной ситуации?",
        img: "Question/5/5.jpg",
        answer: 2,
        options: [
            { text: "Используя преимущественное право, подать звуковой сигнал и продолжать движение в намеченном направлении.", img: "" },
            { text: "Снизить скорость движения и следовать с особой осторожностью.", img: "" },
            { text: "Пропустить пешеходов, переходящих проезжую часть.", img: "" }
        ]
    },
    {
        q: "6. Если на транспортном средстве установлен опознавательный знак ’Ограничение скорости’, то водителю этого транспортного средства:",
        img: "Question/6/6.jpg",
        answer: 0,
        options: [
            { text: "Запрещается превышать указанную на знаке скорость.", img: "" },
            { text: "Разрешается превышать указанную на знаке скорость только на участках дорог, где скорость движения повышена установкой соответствующего дорожного знака.", img: "" }
        ]
    },
    {
        q: "7. Каким должен быть знак остановки «авария» или мигающий красный свет в жилом районе, по крайней мере, на расстоянии от автомобиля (кроме мотоцикла без бокового прицепа)?",
        img: "Question/7/7.jpg",
        answer: 0,
        options: [
            { text: "15 м.", img: "" },
            { text: "30 м.", img: "" },
            { text: "40 м.", img: "" },
            { text: "10 м.", img: "" }
        ]
    },
    {
        q: "8. Где на проезжей части вне населенных пунктов водители должны вести транспортные средства?",
        img: "Question/8/8.jpg",
        answer: 1,
        options: [
            { text: "По любой полосе.", img: "" },
            { text: "По возможности ближе к правому краю проезжей части.", img: "" },
            { text: "Только по правой полосе. Выезд на левую полосу разрешается для поворота налево или разворота.", img: "" }
        ]
    },
    {
        q: "9. Обгон запрещается:",
        img: "Question/9/9.jpg",
        answer: 1,
        options: [
            { text: "На железнодорожных переездах и более чем 100 м от них.", img: "" },
            { text: "На железнодорожных переездах и ближе, чем за 100 м перед ними.", img: "" },
            { text: "На железнодорожных переездах и более чем 100 м от них вне населенных пунктов.", img: "" }
        ]
    },
    {
        q: "10. Разрешается ли установка шин с различным рисунком протектора на одну ось транспортного средства?",
        img: "Question/10/10.jpg",
        answer: 0,
        options: [
            { text: "Запрещается.", img: "" },
            { text: "Разрешается только на заднюю ось автомобиля с передним ведущим мостом.", img: "" },
            { text: "Разрешается.", img: "" },
            { text: "Разрешается только на грузовой автомобиль.", img: "" }
        ]
    }    
];