

//Array of Objects

const quiz = [
    
    {
        q: '1. Какой знак обозначает пересечение с второстепенной дорогой?',
        img: 'Question/1/1.jpg',
        answer: 2,
        options: [
            { text: 'd', img: '' },
            { text: 'e', img: '' },
            { text: 'a', img: '' },
            { text: 'b', img: '' },
            { text: 'c', img: '' }
        ]
    },
    {
        q: '2. Мигающий желтый цвет светофора:',
        img: 'Question/2/2.jpg',
        answer: 1,
        options: [
            { text: 'Информирует о наличии регулируемого перекрестка', img: '' },
            { text: 'Разрешает движение и информирует о наличии нерегулируемого перекрестка или пешеходного перехода, предупреждает об опасности.', img: '' },
            { text: 'Сигнализирует о смене светофора', img: '' }
        ]
    },
    {
        q: '3. В каком направлении разрешено движение водителю грузового автомобиля?',
        img: 'Question/3/3.jpg',
        answer: 3,
        options: [
            { text: 'Только направо', img: '' },
            { text: 'Во всех направлениях', img: '' },
            { text: 'Направо, налево и развернуться', img: '' },
            { text: 'Прямо и направо', img: '' }
        ]
    },
    {
        q: '4. При повороте направо, вы должны:',
        img: 'Question/4/4.jpg',
        answer: 0,
        options: [
            { text: 'Вы уступаете дорогу пешеходам и проезжающим транспортным средствам, пересекающим улицу в направлении движения и поворота', img: '' },
            { text: 'Вы уступаете дорогу только транспортным средствам', img: '' },
            { text: 'Вы уступите дорогу пешеходам во всей проезжей части', img: '' }
        ]
    },
    {
        q: '5. На каком рисунке изображена дорога с двумя проезжими частями?',
        img: 'Question/5/5.jpg',
        answer: 1,
        options: [
            { text: 'На рисунке "В”', img: '' },
            { text: 'Ни в каком из рисунков', img: '' },
            { text: 'На рисунке "А”', img: '' }
        ]
    },
    {
        q: '6. Какой знак информирует о том, что данная дорога не имеет сквозного проезда "Тупик"?',
        img: 'Question/6/6.jpg',
        answer: 1,
        options: [
            { text: 'e', img: '' },
            { text: 'd', img: '' },
            { text: 'b', img: '' },
            { text: 'c', img: '' },
            { text: 'a', img: '' }
        ]
    },
    {
        q: '7. Каким транспортным средством разрешено движение?',
        img: 'Question/7/7.jpg',
        answer: 2,
        options: [
            { text: 'Мотоциклу и легковому автомобилю на право и прямо', img: '' },
            { text: 'Мотоциклу направо, легковому автомобилю на все направления', img: '' },
            { text: 'Мотоциклу направо, легковому автомобилю прямо и направо', img: '' }
        ]
    },
    {
        q: '8. В каком направлении данный светофор разрешает движение?',
        img: 'Question/8/8.jpg',
        answer: 3,
        options: [
            { text: 'Только налево', img: '' },
            { text: 'Прямо и налево', img: '' },
            { text: 'Только направо', img: '' },
            { text: 'Прямо и направо', img: '' }
        ]
    },
    {
        q: '9. Сколько проезжих частей имеет данная дорога?',
        img: 'Question/9/9.jpg',
        answer: 0,
        options: [
            { text: '1', img: '' },
            { text: '2', img: '' },
            { text: '4', img: '' }
        ]
    },
    {
        q: '10. Какой допустимый суммарный люфт в рулевом управлении для автотранспортов категории N1?',
        img: 'Question/10/10.jpg',
        answer: 1,
        options: [
            { text: '10°', img: '' },
            { text: '20°', img: '' },
            { text: '25°', img: '' }
        ]
    }
    
];