

//Array of Objects

const quiz = [
    
        {
            q: '1. Что называется разрешённой максимальной массой транспортного средства?',
            img: 'Question/1/1.jpg',
            answer: 1,
            options: [
                { text: 'Масса транспортного средства с грузом, водителем и пассажирами', img: '' },
                { text: 'Максимальная масса (величина) снаряженного транспортного средства с грузом, водителем и пассажирами, установленная предприятием-изготовителем', img: '' },
                { text: 'Максимальная масса (величина) снаряженного транспортного средства без груза, без водителя и без пассажирами, установленная предприятием-изготовителем', img: '' }
            ]
    },
    {
            q: '2. Где могут двигаться пешеходы в жилой зоне?',
            img: 'Question/2/2.jpg',
            answer: 2,
            options: [
                { text: 'Только по тротуарам', img: '' },
                { text: 'В один ряд по краю проезжей части', img: '' },
                { text: 'По тротуарам и по проезжей части', img: '' }
            ]
    },
    {
            q: '3. Какие из указанных знаков запрещают движение транспортных средств, скорость которых по технической характеристике или их состоянию менее 40 км/ч?',
            img: 'Question/3/3.jpg',
            answer: 2,
            options: [
                { text: 'a и b', img: '' },
                { text: 'Только c', img: '' },
                { text: 'Только a', img: '' }
            ]
    },
    {
            q: '4. Какие из указанных знаков разрешают движение грузовым автомобилям с разрешенной максимальной массой не более 3,5 т?',
            img: 'Question/4/4.jpg',
            answer: 2,
            options: [
                { text: 'Только c', img: '' },
                { text: 'a и b', img: '' },
                { text: 'Только a и c', img: '' }
            ]
    },
    {
            q: '5. Что обозначает эта разметка с надписью “50”?',
            img: 'Question/5/5.jpg',
            answer: 0,
            options: [
                { text: 'Разрешенную максимальную скорость на данном участке дороги', img: '' },
                { text: 'Рекомендуемую скорость движения на данном участке дороги', img: '' },
                { text: 'Номер дороги или маршрута', img: '' }
            ]
    },
    {
            q: '6. Первым проедет перекрёсток?',
            img: 'Question/6/6.jpg',
            answer: 1,
            options: [
                { text: 'Красный автомобиль', img: '' },
                { text: 'Зеленый автомобиль', img: '' },
                { text: 'Синий автомобиль', img: '' }
            ]
    },
    {
            q: '7. Какой автомобиль проедет перекрёсток третьим?',
            img: 'Question/7/7.jpg',
            answer: 1,
            options: [
                { text: 'Зеленый автомобиль', img: '' },
                { text: 'Красный автомобиль', img: '' },
                { text: 'Синий автомобиль', img: '' }
            ]
    },
    {
            q: '8. В каких случаях разрешено применять звуковые сигналы в населенных пунктах?',
            img: 'Question/8/8.jpg',
            answer: 2,
            options: [
                { text: 'Только для предупреждения о намерении произвести обгон', img: '' },
                { text: 'В обоих перечисленных случаях', img: '' },
                { text: 'Только для предотвращения дорожно-транспортного происшествия', img: '' }
            ]
    },
    {
            q: '9. На каком автомобиле изображен, водитель которого нарушает правила перевозки грузов?',
            img: 'Question/9/9.jpg',
            answer: 2,
            options: [
                { text: 'А', img: '' },
                { text: 'B', img: '' },
                { text: 'А и B', img: '' }
            ]
    },
    {
            q: '10. Как оказывается первая помощь при переломах конечностей, если отсутствуют транспортные шины и подручные средства для их изготовления?',
            img: 'Question/10/10.jpg',
            answer: 1,
            options: [
                { text: 'Верхнюю конечность, согнутую в локте, подвешивают на косынке и прибинтовывают к туловищу. Нижние конечности плотно прижимают друг к другу и прибинтовывают', img: '' },
                { text: 'Верхнюю конечность, согнутую в локте, подвешивают на косынке и прибинтовывают к туловищу. Нижние конечности прибинтовывают друг к другу, обязательно проложив между ними мягкую ткань', img: '' },
                { text: 'Верхнюю конечность, вытянутую вдоль тела, прибинтовывают к туловищу. Нижние конечности прибинтовывают друг к другу, проложив между ними мягкую ткань', img: '' }
            ]
    }
];