

//Array of Objects

const quiz = [
        {
            q: '1. Синий автомобиль проедет перекресток:',
            img: 'Question/1/21.jpg',
            answer: 3,
            options: [
                { text: 'Первым.', img: '' },
                { text: 'Вторым.', img: '' },
                { text: 'Вторым.', img: '' },
                { text: 'Последним.', img: '' }
            ]
    },
    {
            q: '2. Какой знак требует уступить дорогу встречным транспортным средствам?',
            img: 'Question/2/22.jpg',
            answer: 1,
            options: [
                { text: '1', img: '' },
                { text: '2', img: '' },
                { text: '5', img: '' },
                { text: '4', img: '' },
                { text: '3', img: '' }
            ]
    },
    {
            q: '3. Разрешается ли пересекать сплошную линию горизонтальной разметки?',
            img: 'Question/3/23.jpg',
            answer: 1,
            options: [
                { text: 'Разрешается только при маневрировании, когда линия обозначает границы полос движения одного направления.', img: '' },
                { text: 'Разрешается только в случае, если линия обозначает край проезжей части дороги.', img: '' },
                { text: 'Разрешается, если она находится справа от водителя.', img: '' }
            ]
    },
    {
            q: '4. Как должен поступить водитель в показанной ситуации?',
            img: 'Question/4/24.jpg',
            answer: 0,
            options: [
                { text: 'Дать возможность пешеходам закончить переход проезжей части данного направления.', img: '' },
                { text: 'Подать звуковой сигнал для предотвращения дорожно-транспортного происшествия и, не уступая дорогу пешеходам, проехать переход, так как он находится на главной дороге.', img: '' }
            ]
    },
    {
            q: '5. Красный автомобиль проедет перекресток:',
            img: 'Question/5/25.jpg',
            answer: 1,
            options: [
                { text: 'Первым.', img: '' },
                { text: 'Последним.', img: '' },
                { text: 'Третьим.', img: '' },
                { text: 'Вторым.', img: '' }
            ]
    },
    {
            q: '6. Если за пешеходным переходом образовался затор, который вынудит водителя остановиться на пешеходном переходе, водитель обязан:',
            img: 'Question/6/26.jpg',
            answer: 1,
            options: [
                { text: 'Остановиться на пешеходном переходе, соблюдая необходимую дистанцию от вперед стоящего транспортного средства.', img: '' },
                { text: 'Остановиться и не въезжать на пешеходный переход,так как это создает помеху для движения пешеходов.', img: '' },
                { text: 'Остановиться за 15 м перед пешеходным переходом.', img: '' },
                { text: 'Остановиться за 5 м перед пешеходным переходом.', img: '' }
            ]
    },
    {
            q: '7. Разрешается ли обгон в этом месте?',
            img: 'Question/7/27.jpg',
            answer: 3,
            options: [
                { text: 'Разрешается.', img: '' },
                { text: 'Запрещается только на дорогах вне населенных пунктов.', img: '' },
                { text: 'Разрешается на дорогах вне населенных пунктов.', img: '' },
                { text: 'Запрещается.', img: '' }
            ]
    },
    {
            q: '8. Сигналом, запрещающим движение через железнодорожный переезд, является положение дежурного, обращенного к водителю:',
            img: 'Question/8/28.jpg',
            answer: 1,
            options: [
                { text: 'Левым или правым плечом с поднятым над головой жезлом (красным флагом).', img: '' },
                { text: 'Грудью или спиной с поднятым над головой жезлом (красным флагом) или с вытянутыми в стороны руками.', img: '' },
                { text: 'Любым плечом или грудью с поднятым над головой жезлом (красным флагом).', img: '' }
            ]
    },
    {
            q: '9. После преодоления глубокого брода водитель обязан?',
            img: 'Question/9/29.jpg',
            answer: 1,
            options: [
                { text: 'Двигаться с ускорением на более высоких передачах', img: '' },
                { text: 'На короткой дистанции пробега несколькими резкими нажатиями на тормозную педаль просушить тормозные накладки', img: '' }
            ]
    },
    {
            q: '10. Таким опознавательным знаком обозначается транспортное средство:',
            img: 'Question/10/30.jpg',
            answer: 1,
            options: [
                { text: 'Управляемое глухонемым или глухим водителем.', img: '' },
                { text: 'Перевозящее опасные грузы.', img: '' },
                { text: 'Перевозящее тяжеловесные и крупногабаритные грузы.', img: '' },
                { text: 'Управляемое инвалидом.', img: '' }
            ]
    }   
];