

//Array of Objects

const quiz = [
    
    {
        q: "1. С какой максимальной скоростью разрешается движение в кузове грузового автомобиля при перевозке людей вне населённого пункта?",
        img: "Question/1/1.jpg",
        answer: 1,
        options: [
            { text: "80 км/ч.", img: "" },
            { text: "60 км/ч.", img: "" },
            { text: "50 км/ч.", img: "" },
            { text: "70 км/ч.", img: "" },
            { text: "40 км/ч.", img: "" }
        ]
    },
    {
        q: "2. Какому грузовому автомобилю можно продолжать движение при этом знаке?",
        img: "Question/2/2.jpg",
        answer: 1,
        options: [
            { text: "Порожнему автомобилю грузоподъемностью 8 т.", img: "" },
            { text: "Автомобилю, разрешенная максимальная масса которого не более 8 т.", img: "" },
            { text: "Автомобилю, загруженному до 8 т.", img: "" }
        ]
    },
    {
        q: "3. Что означает эта разметка?",
        img: "Question/3/3.jpg",
        answer: 1,
        options: [
            { text: "Место перегона скота.", img: "" },
            { text: "Место, где велосипедная дорожка пересекает проезжую часть.", img: "" },
            { text: "Пешеходный переход.", img: "" }
        ]
    },
    {
        q: "4. Что запрещено на автомагистрали водителям грузовых автомобилей, разрешенная максимальная масса которых менее 3,5 т?",
        img: "Question/4/4.jpg",
        answer: 3,
        options: [
            { text: "Буксировка механических транспортных средств.", img: "" },
            { text: "Движение далее второй полосы, кроме перестроения для разворота или поворота налево.", img: "" },
            { text: "Все перечисленные действия.", img: "" },
            { text: "Движение задним ходом.", img: "" }
        ]
    },
    {
        q: "5. Разрешается ли останавливаться на полосе, обозначенной этим знаком для посадки пассажиров?",
        img: "Question/5/5.jpg",
        answer: 2,
        options: [
            { text: "Разрешается.", img: "" },
            { text: "Запрещается.", img: "" },
            { text: "Разрешается, если полоса расположена у правого края проезжей части, и если она не отделена от остальной проезжей части сплошной линией разметки.", img: "" }
        ]
    },
    {
        q: "6. Водитель какого транспортного средства должен уступить дорогу?",
        img: "Question/6/6.jpg",
        answer: 0,
        options: [
            { text: "Водитель грузовика", img: "" },
            { text: "Водитель автобуса", img: "" }
        ]
    },
    {
        q: "7. Укажите очередность проезда перекрестка:",
        img: "Question/7/7.jpg",
        answer: 2,
        options: [
            { text: "Синий, красный одновременно с зеленым.", img: "" },
            { text: "Красный, синий, зеленый.", img: "" },
            { text: "Красный одновременно с зеленым, синий.", img: "" }
        ]
    },
    {
        q: "8. Должен ли водитель уступить дорогу другим транспортным средствам при перестроении?",
        img: "Question/8/8.jpg",
        answer: 1,
        options: [
            { text: "Должен во всех случаях при взаимном перестроении.", img: "" },
            { text: "Должен, если транспортное средство движется попутно по соседней полосе.", img: "" },
            { text: "Не должен.", img: "" }
        ]
    },
    {
        q: "9. Что должен делать водитель тягача?",
        img: "Question/9/9.jpg",
        answer: 1,
        options: [
            { text: "Продолжать движение, не изменяя скорость.", img: "" },
            { text: "Остановиться и пропустить автомобили, скопившиеся сзади.", img: "" },
            { text: "Указать рукой на обгон по параллельной полосе.", img: "" }
        ]
    },
    {
        q: "10. Что обозначает данный опознавательный знак?",
        img: "Question/10/10.jpg",
        answer: 0,
        options: [
            { text: "Транспортное средство, оборудованное шипованными шинами.", img: "" },
            { text: "Впереди участок дороги с тремя полосами для движения в данной направлении.", img: "" },
            { text: "Впереди участок дороги, имеющий неровности на проезжей части.", img: "" }
        ]
    }
];