

//Array of Objects

const quiz = [
    
    {
        q: "1. Может ли лицо, имеющее доверенность на право распоряжения транспортным средством, передавать управление транспортным средством в своем присутствии другому лицу?",
        img: "Question/1/1.jpg",
        answer: 0,
        options: [
            { text: "Может, при наличии у этого лица водительского удостоверения на право управления транспортным средством данной категории, и оно указано в страховом полисе обязательного страхования гражданской ответственности владельца транспортного средства.", img: "" },
            { text: "Не может.", img: "" },
            { text: "Может.", img: "" }
        ]
    },
    {
        q: "2. Разрешается ли буксировка автомобиля, если на дороге установлен этот знак?",
        img: "Question/2/2.jpg",
        answer: 1,
        options: [
            { text: "Разрешается только легковым автомобилям.", img: "" },
            { text: "Запрещается.", img: "" },
            { text: "Разрешается на любой сцепке.", img: "" },
            { text: "Разрешается на жесткой сцепке.", img: "" }
        ]
    },
    {
        q: "3. С каким дорожным знаком применяется стоп- линия?",
        img: "Question/3/3.jpg",
        answer: 1,
        options: [
            { text: "Со знаком \"Уступите дорогу\" и со знаком \"Движение без остановки запрещено\".", img: "" },
            { text: "Со знаком \"Движение без остановки запрещено\".", img: "" },
            { text: "Со знаком \"Уступите дорогу\".", img: "" }
        ]
    },
    {
        q: "4. В каком ответе правильно указана последовательность действий водителя автомобиля?",
        img: "Question/4/4.jpg",
        answer: 2,
        options: [
            { text: "Пропустил трамвай и развернулся на перекрестке.", img: "" },
            { text: "Пропустил мотоцикл и развернулся на перекрестке.", img: "" },
            { text: "Пропустил трамвай, мотоцикл и развернулся на перекрестке.", img: "" }
        ]
    },
    {
        q: "5. Автомобили проедут перекресток в следующем порядке:",
        img: "Question/5/5.jpg",
        answer: 1,
        options: [
            { text: "Синий одновременно с красным; зеленый; желтый.", img: "" },
            { text: "Желтый въедет на перекресток и остановится, чтобы пропустить синий; зеленый; синий одновременно с красным; желтый.", img: "" },
            { text: "Зеленый; синий одновременно с красным; желтый.", img: "" }
        ]
    },
    {
        q: "6. Когда водитель должен переключить дальний свет на ближний, если он может ослепить других водителей? Не менее чем:",
        img: "Question/6/6.jpg",
        answer: 1,
        options: [
            { text: "За 100 м до встречного транспортного средства.", img: "" },
            { text: "За 150 м до встречного транспортного средства, а также и при большем расстоянии, если водитель встречного транспортного средства периодическим переключением света фар показывает необходимость этого.", img: "" },
            { text: "За 300 м до встречного транспортного средства.", img: "" },
            { text: "За 250 м до встречного транспортного средства.", img: "" }
        ]
    },
    {
        q: "7. С какой максимальной скоростью разрешено движение водителю легкового автомобиля, буксирующего прицеп вне населенного пункта?",
        img: "Question/7/7.jpg",
        answer: 1,
        options: [
            { text: "100 км/ч.", img: "" },
            { text: "80 км/ч.", img: "" },
            { text: "70 км/ч.", img: "" },
            { text: "50 км/ч.", img: "" },
            { text: "90 км/ч.", img: "" }
        ]
    },
    {
        q: "8. Разрешается ли стоянка автомобиля в этом месте?",
        img: "Question/8/8.jpg",
        answer: 0,
        options: [
            { text: "Разрешается.", img: "" },
            { text: "Запрещается.", img: "" }
        ]
    },
    {
        q: "9. Для чего применяется 5% раствор йода (настойка йода), входящий в комплект аптечки, которой оснащены автотранспортные средства?",
        img: "Question/9/9.jpg",
        answer: 0,
        options: [
            { text: "Для обработки кожи вокруг раны.", img: "" },
            { text: "Для смазывания кожи при химических ожогах первой степени, вызванных крепкой щелочью.", img: "" },
            { text: "Для смазывания всей поверхности раны при сильном загрязнении раны.", img: "" }
        ]
    },
    {
        q: "10. Каковы требования для организованной перевозки группа детей?",
        img: "Question/10/10.jpg",
        answer: 1,
        options: [
            { text: "На передней и задней части транспортного средства, должна быть знак «Перевозка детей»", img: "" },
            { text: "Во всех перечисленных случаях", img: "" },
            { text: "При организации группы детей в автомобиле должен присутствовать наблюдатель", img: "" }
        ]
    }    
];