

//Array of Objects

const quiz = [
    
    {
        q: "1. В каком ответе полностью указаны места в условиях, когда нет места выхода и посадки для пассажиров?",
        img: "Question/1/1.jpg",
        answer: 0,
        options: [
            { text: 'Со стороны тротуара или обочины', img: '' },
            { text: 'На проезжей части или тротуаре', img: '' },
            { text: 'На обочине или на проезжей части', img: '' },
            { text: 'На тротуаре', img: '' }
        ],
        // solutionText: "Question/1/1.0.jpg"
    },
    {
        q: "2. В каком ответе правильно указаны все разрешенные направления движения?",
        img: "Question/2/2.jpg",
        answer: 0,
        options: [
            { text: 'А и Б', img: '' },
            { text: 'А и В', img: '' },
            { text: 'А', img: '' },
            { text: 'Б', img: '' },
            { text: 'В', img: '' }
        ],
        // solutionText: "Question/2/2.0.jpg"
        
    },
    {
        q: "3. Этот дорожный знак с табличкой обозначает:",
        img: "Question/3/3.jpg",
        answer: 0,
        options: [
            { text: 'Место и способ постановки легковых автомобилей и мотоциклов на стоянке', img: '' },
            { text: 'Место стоянки транспортных средств с разрешенной максимальной массой более 3,5 т. Табличка указывает, что у края проезжей части высокий бордюрный камень', img: '' },
            { text: 'Место стоянки транспортных средств, способ постановки автомобиля, указанный на табличке запрещается', img: '' }
        ],
        // solutionText: "Question/3/3.0.jpg"
    },
    {
        q: "4. Должны ли водители транспортных средств с обозначенным маршрутом, движущихся в указанном направлении, пропускать слепых пешеходов, сигнализирующих белым крестом за пределами пешеходного перехода?",
        img: "Question/4/4.jpg",
        answer: 0,
        options: [
            { text: 'Должны во всех случаях', img: '' },
            { text: 'Не должны пропускать', img: '' },
            { text: '', img: '' }
        ],
        // solutionText: "Question/4/4.0.jpg"
    },
    {
        q: "5. Транспортные средства проедут перекресток в следующем порядке:",
        img: "Question/5/5.jpg",
        answer: 0,
        options: [
            { text: 'Мотоцикл, трамвай и автомобиль', img: '' },
            { text: 'Трамвай и автомобиль, мотоцикл', img: '' },
            { text: 'Трамвай, мотоцикл, автомобиль', img: '' }
        ],
        // solutionText: "Question/5/5.0.jpg"
    },
    {
        q: "6. Трамвай, мотоцикл, автомобиль",
        img: "Question/6/6.jpg",
        answer: 0,
        options: [
            { text: 'Мотоциклу', img: '' },
            { text: 'Автомобилю и мотоциклу', img: '' },
            { text: 'Всем транспортным средствам', img: '' }
        ],
        // solutionText: "Question/6/6.0.jpg"
    },
    {
        
        q: "7. В каком направлении разрешено движение?",
        img: "Question/7/7.jpg",
        answer: 0,
        options: [
            { text: 'Только налево', img: '' },
            { text: 'Прямо и направо', img: '' },
            { text: 'Только прямо', img: '' },
            { text: 'Только прямо', img: '' }
        ],
        // solutionText: "Question/7/7.0.jpg"
    },
    {
        
        q: "8. Если транспортное средство из-за габаритов или по другим причинам не может выполнить поворот из крайнего положения, допускается ли производить его с отступлением от этого правила?",
        answer: 0,
        options: [
            { text: 'Допускается, если это не создает помех другим транспортным средствам. Для обеспечения безопасности движения водитель, в случае необходимости, должен прибегнуть к помощи других лиц', img: '' },
            { text: 'Не допускается', img: '' },
            { text: 'Допускается, но только не на перекрестке', img: '' },
            { text: 'Допускается на дорогах вне населенных пунктов', img: '' }
        ],
        // solutionText: "Question/8/8.0.jpg"
    },
    {
        q: "9. На каком расстоянии между транспортными средствами должна обеспечиваться жесткая сцепка?",
        img: 'Question/9/9.jpg',
        answer: 0,
        options: [
            { text: '4 м.', img: '' },
            { text: '3 м.', img: '' },
            { text: '6 м.', img: '' },
            { text: '5 м.', img: '' },
            { text: '2 м.', img: '' }
        ],
        // solutionText: "Question/9/9.0.jpg"
    },
    {
        q: "10. Разрешается ли велосипедистам ездить по тротуарам?",
        img: "Question/10/10.jpg",
        answer: 0,
        options: [
            { text: 'Запрещается', img: '' },
            { text: 'Разрешается', img: '' },
            { text: 'Разрешается при отсутствии пешеходов', img: '' }
        ],
        // solutionText: "Question/10/10.0.jpg"
    }
];