

//Array of Objects

const quiz = [
    {
        q: "1. Разрешается ли пешеходам переходить проезжую часть вне пешеходного перехода при наличии разделительной полосы?",
        img: "Question/1/1.jpg",
        answer: 3,
        options: [
            { text: "Разрешается в местах, где дорога просматривается в обе стороны.", img: "" },
            { text: "Разрешается только в населенных пунктах.", img: "" },
            { text: "Разрешается только вне населенных пунктов.", img: "" },
            { text: "Запрещается.", img: "" }
        ]
    },
    {
        q: "2. Каким грузовым автомобилям из перечисленных этот знак не запрещает дальнейшее движение?",
        img: "Question/2/2.jpg",
        answer: 2,
        options: [
            { text: "Автомобилям с разрешенной максимальной массой более 3,5 т.", img: "" },
            { text: "Автомобилям, перевозящим опасные грузы.", img: "" },
            { text: "Грузовым автомобилям с белой наклонной полосой на бортах.", img: "" },
            { text: "Автомобилям грузоподъемностью более 3,5 т.", img: "" }
        ]
    },
    {
        q: "3. Разрешается ли пересекать прерывистую двойную линию разметки, при отсутствии реверсивных светофоров или когда они отключены?",
        img: "Question/3/3.jpg",
        answer: 3,
        options: [
            { text: "Разрешается с любой стороны.", img: "" },
            { text: "Разрешается, если она расположена слева от водителя.", img: "" },
            { text: "Запрещается.", img: "" },
            { text: "Разрешается, если она расположена справа от водителя.", img: "" }
        ]
    },
    {
        q: "4. Водитель какого транспортного средства имеет право на первоочередное движение?",
        img: "Question/4/4.jpg",
        answer: 1,
        options: [
            { text: "Водитель автомобиля.", img: "" },
            { text: "Водитель велосипеда.", img: "" }
        ]
    },
    {
        q: "5. Каким транспортным средствам разрешено движение при этом сигнале светофора?",
        img: "Question/5/5.jpg",
        answer: 2,
        options: [
            { text: "Всем транспортным средствам.", img: "" },
            { text: "Трамваю, желтому и красному автомобилям.", img: "" },
            { text: "Желтому и красному автомобилям.", img: "" }
        ]
    },
    {
        q: "6. В населенном пункте водитель автобуса или троллейбуса начинает движение от обозначенной остановки. Он должен:",
        img: "Question/6/6.jpg",
        answer: 2,
        options: [
            { text: "Используя преимущество, начинать движение в намеченном направлении.", img: "" },
            { text: "Уступить дорогу объезжавшему его транспортному средству.", img: "" },
            { text: "Начинать движение, только убедившись, что ему уступают дорогу.", img: "" }
        ]
    },
    {
        q: "7. Водитель какого транспортного средства нарушил правила стоянки?",
        img: "Question/7/7.jpg",
        answer: 3,
        options: [
            { text: "Водитель красного автомобиля.", img: "" },
            { text: "Оба водителя не нарушили.", img: "" },
            { text: "Водитель синего автомобиля.", img: "" },
            { text: "Оба водителя нарушили.", img: "" }
        ]
    },
    {
        q: "8. Как должен поступить водитель легкового автомобиля в показанной ситуации?",
        img: "Question/8/8.jpg",
        answer: 0,
        options: [
            { text: "При выезде из двора пропустить пешехода и транспортные средства.", img: "" },
            { text: "Быстрее завершить поворот, чтобы не создавать помехи транспортным средствам.", img: "" }
        ]
    },
    {
        q: "9. Как пользоваться тормозами на скользкой дороге?",
        img: "Question/9/9.jpg",
        answer: 1,
        options: [
            { text: "Выключить сцепление и плавно тормозить.", img: "" },
            { text: "Плавно тормозить, не выключая сцепления, и не производить резких поворотов рулевым колесом.", img: "" },
            { text: "Тормозить резким, прерывистым нажатием на педаль тормоза.", img: "" }
        ]
    },
    {
        q: "10. Таким опознавательным знаком обозначаются транспортные средства:",
        img: "Question/10/10.jpg",
        answer: 1,
        options: [
            { text: "Перевозящие опасные грузы.", img: "" },
            { text: "Управляемые инвалидами.", img: "" },
            { text: "Управляемые глухими или глухонемыми водителями.", img: "" }
        ]
    }    
];