

//Array of Objects

const quiz = [
    
    {
        q: '1. В какой формулировке указан правильный ответ термину “Преимущество”?',
        img: 'Question/1/1.jpg',
        answer: 1,
        options: [
            { text: 'Требование, означающее, что участник дорожного движения не должен продолжать или начинать движение, осуществлять какой-либо маневр, если это может вынудить других участников движения, имеющих по отношению к нему приоритет, изменить направление движения или скорость', img: '' },
            { text: 'Право на первоочередное движение в намеченном направлении по отношению к другим участникам движения.', img: '' }
        ]
    },
    {
        q: '2. Какой знак обозначает, что разрешено обходить препятствие справа или слева?',
        img: 'Question/2/2.jpg',
        answer: 0,
        options: [
            { text: 'e', img: '' },
            { text: 'd', img: '' },
            { text: 'a', img: '' },
            { text: 'b', img: '' },
            { text: 'c', img: '' }
        ]
    },
    {
        q: '3. В каком случае Вам необходимо двигаться со скоростью до 50 км/ч?',
        img: 'Question/3/3.jpg',
        answer: 1,
        options: [
            { text: 'Во всех случаях', img: '' },
            { text: 'Только в том случае, когда покрытие на дороге влажное', img: '' }
        ]
    },
    {
        q: '4. Можете ли Вы остановиться в этом месте для посадки или высадки пассажиров?',
        img: 'Question/4/4.jpg',
        answer: 0,
        options: [
            { text: 'Да', img: '' },
            { text: 'Нет', img: '' }
        ]
    },
    {
        q: '5. В этом случае Вы:',
        img: 'Question/5/5.jpg',
        answer: 1,
        options: [
            { text: 'Можете продолжить движение без остановки', img: '' },
            { text: 'Должны остановиться перед знаком и ждать разрешающего сигнала светофора', img: '' }
        ]
    },
    {
        q: '6. Белый автомобиль проедет перекрёсток:',
        img: 'Question/6/6.jpg',
        answer: 0,
        options: [
            { text: 'Последним', img: '' },
            { text: 'Вторым', img: '' },
            { text: 'Первым', img: '' }
        ]
    },
    {
        q: '7. В каких из перечисленных случаев запрещена буксировка на гибкой сцепке?',
        img: 'Question/7/7.jpg',
        answer: 1,
        options: [
            { text: 'Только на горных дорогах', img: '' },
            { text: 'Только в гололедицу', img: '' },
            { text: 'Только в тёмное время суток и в условиях недостаточной видимости', img: '' },
            { text: 'Во всех перечисленных случаях', img: '' }
        ]
    },
    {
        q: '8. Движение каких транспортных средств запрещает этот дорожный знак?',
        img: 'Question/8/8.jpg',
        answer: 0,
        options: [
            { text: 'Движение транспортных средств с опасными грузами', img: '' },
            { text: 'Грузовых автомобилей с разрешённой максимальной массой более 3.5 тонн', img: '' },
            { text: 'Движение транспортных средств с взрывчатыми и легковоспламеняющимися грузами', img: '' }
        ]
    },
    {
        q: '9. Обязаны ли Вы, двигаясь по правой полосе, уступить дорогу водителю автомобиля, который намерен перестроиться на Вашу полосу?',
        img: 'Question/9/9.jpg',
        answer: 0,
        options: [
            { text: 'Обязаны', img: '' },
            { text: 'Не обязаны', img: '' }
        ]
    },
    {
        q: '10. Кто из водителей нарушил правила остановки?',
        img: 'Question/10/10.jpg',
        answer: 0,
        options: [
            { text: 'Только водитель красного автомобиля', img: '' },
            { text: 'Только водитель синего автомобиля', img: '' },
            { text: 'Оба нарушили', img: '' }
        ]
    }    
];