

//Array of Objects

const quiz = [
    
    {
        q: "1. Водитель какого транспортного средства имеет право на первоочередное движение?",
        img: "Question/1/1.jpg",
        answer: 0,
        options: [
            { text: "Водитель легкового автомобиля.", img: "" },
            { text: "Водитель дорожной машины.", img: "" }
        ]
    },
    {
        q: "2. Какие из этих знаков указывают на 'выход на дорогу с односторонним движением'?",
        img: "Question/2/2.jpg",
        answer: 2,
        options: [
            { text: "Второй и четвертый.", img: "" },
            { text: "Третий и пятый.", img: "" },
            { text: "Первый и пятый.", img: "" }
        ]
    },
    {
        q: "3. В каких направлениях разрешается движение?",
        img: "Question/3/3.jpg",
        answer: 3,
        options: [
            { text: "По направлению А.", img: "" },
            { text: "По направлению Б.", img: "" },
            { text: "По направлениям Б и В.", img: "" },
            { text: "По направлениям А, Б и В.", img: "" },
            { text: "По направлению В.", img: "" }
        ]
    },
    {
        q: "4. В каких случаях запрещается выезжать на железнодорожный переезд?",
        img: "Question/4/4.jpg",
        answer: 2,
        options: [
            { text: "Если скорость движения механического транспортного средства превышает 8 км/ч.", img: "" },
            { text: "Сельскохозяйственная машина загружена на механическое транспортное средство.", img: "" },
            { text: "Шлагбаум открыт, но горит запрещающий сигнал светофора.", img: "" }
        ]
    },
    {
        q: "5. Автомобили проедут перекресток в следующем порядке:",
        img: "Question/5/5.jpg",
        answer: 1,
        options: [
            { text: "Красный, зеленый, синий.", img: "" },
            { text: "Все три одновременно.", img: "" },
            { text: "Синий, красный, зеленый.", img: "" }
        ]
    },
    {
        q: "6. Чем может быть вызвано интенсивное перемещение вперед пассажиров и неукрепленного груза?",
        img: "Question/6/6.jpg",
        answer: 1,
        options: [
            { text: "Только резким разгоном.", img: "" },
            { text: "Только резким торможением.", img: "" },
            { text: "Резким разгоном и резким торможением.", img: "" }
        ]
    },
    {
        q: "7. Как обозначается груз, выступающий за габариты транспортного средства спереди или сзади более чем на 1 м. в дневное время?",
        img: "Question/7/7.jpg",
        answer: 1,
        options: [
            { text: "Белыми флажками.", img: "" },
            { text: "Флажками или щитками с красно-белыми линиями по диагонали.", img: "" },
            { text: "Красными флажками.", img: "" }
        ]
    },
    {
        q: "8. Данная горизонтальная разметка выполняет следующую функцию:",
        img: "Question/8/8.jpg",
        answer: 0,
        options: [
            { text: "Обозначает пешеходный переход, стрелки указывают направление движения пешеходов.", img: "" },
            { text: "Обозначает специальную дорожку для пешеходов.", img: "" },
            { text: "Обозначает дорожку для велосипедистов, стрелки показывают направление движения.", img: "" }
        ]
    },
    {
        q: "9. Какие опасные последствия может вызвать резкое открытие дроссельной заслонки на скользкой дороге?",
        img: "Question/9/9.jpg",
        answer: 2,
        options: [
            { text: "Прекращение работы двигателя.", img: "" },
            { text: "Выход из строя деталей карбюратора.", img: "" },
            { text: "Боковой занос автомобиля.", img: "" }
        ]
    },
    {
        q: "10. Какое количество людей разрешается перевозить в кузове грузового автомобиля?",
        img: "Question/10/10.jpg",
        answer: 2,
        options: [
            { text: "По указанию администрации.", img: "" },
            { text: "Не более 20 человек.", img: "" },
            { text: "Число перевозимых людей не должно превышать количество оборудованных для сидения мест.", img: "" },
            { text: "По усмотрению водителя.", img: "" }
        ]
    }    
];