

//Array of Objects

const quiz = [
    
    {
        q: "1. Разрешается ли остановка автомобиля с опознавательным знаком 'Инвалид' в зоне действия этих знаков?",
        img: "Question/1/1.jpg",
        answer: 0,
        options: [
            { text: "Разрешается.", img: "" },
            { text: "Запрещается.", img: "" }
        ]
    },
    {
        q: "2. Какой знак предупреждает о приближении к опасному повороту дороги?",
        img: "Question/2/2.jpg",
        answer: 3,
        options: [
            { text: "5", img: "" },
            { text: "4", img: "" },
            { text: "3", img: "" },
            { text: "2", img: "" },
            { text: "1", img: "" }
        ]
    },
    {
        q: "3. По какому пути разрешено движение?",
        img: "Question/3/3.jpg",
        answer: 2,
        options: [
            { text: "А.", img: "" },
            { text: "B.", img: "" },
            { text: "A и B.", img: "" }
        ]
    },
    {
        q: "4. Учебная езда на автомагистрали:",
        img: "Question/4/4.jpg",
        answer: 2,
        options: [
            { text: "Разрешена со скоростью не более 60 км/час при достаточных навыках управления у обучаемого с мастером обучения вождению.", img: "" },
            { text: "Разрешена со скоростью не более 70 км/час.", img: "" },
            { text: "Запрещена.", img: "" },
            { text: "Разрешена, если механическое транспортное средство, на котором производится обучение, обозначено опознавательным знаком.", img: "" }
        ]
    },
    {
        q: "5. Автомобили проедут перекресток в следующем порядке:",
        img: "Question/5/5.jpg",
        answer: 2,
        options: [
            { text: "Зеленый; синий; красный.", img: "" },
            { text: "Синий одновременно с зеленым; красный.", img: "" },
            { text: "Синий; красный; зеленый.", img: "" }
        ]
    },
    {
        q: "6. С какой максимальной скоростью может осуществляться буксировка в данных условиях?",
        img: "Question/6/6.jpg",
        answer: 0,
        options: [
            { text: "50 км/ч.", img: "" },
            { text: "70 км/ч.", img: "" },
            { text: "30 км/ч.", img: "" },
            { text: "80 км/ч.", img: "" }
        ]
    },
    {
        q: "7. Где должен остановить автомобиль водитель при наличии обочины на дороге?",
        img: "Question/7/7.jpg",
        answer: 0,
        options: [
            { text: "На самой обочине.", img: "" },
            { text: "На проезжей части, на расстоянии 0,5 м от обочины.", img: "" },
            { text: "Как можно правее на обочине дороги.", img: "" }
        ]
    },
    {
        q: "8. Какие правила нарушил водитель легкового автомобиля?",
        img: "Question/8/8.jpg",
        answer: 1,
        options: [
            { text: "Только правила стоянки.", img: "" },
            { text: "Правила остановки и стоянки.", img: "" }
        ]
    },
    {
        q: "9. Минимально допускаемое Правилами значение остаточной высоты рисунка протектора шин автотранспортных средств категории N2; N3; 03; 04 составляет:",
        img: "Question/9/9.jpg",
        answer: 4,
        options: [
            { text: "0,5 мм.", img: "" },
            { text: "2 мм.", img: "" },
            { text: "3 мм.", img: "" },
            { text: "1,6 мм.", img: "" },
            { text: "1 мм.", img: "" }
        ]
    },
    {
        q: "10. Владельцы механических транспортных средств и прицепов к ним должны зарегистрировать их в ГСБДД независимо от технического состояния с момента приобретения (получения) в течении:",
        img: "Question/10/10.jpg",
        answer: 0,
        options: [
            { text: "10 суток.", img: "" },
            { text: "2 суток.", img: "" },
            { text: "15 суток.", img: "" },
            { text: "30 суток.", img: "" },
            { text: "5 суток.", img: "" }
        ]
    }    
];