

//Array of Objects

const quiz = [
    
    {
        q: "1. Что означает мигание зеленого сигнала светофора?",
        img: "Question/1/1.jpg",
        answer: 1,
        options: [
            { text: "Запрещает дальнейшее движение", img: "" },
            { text: "Разрешает движение и информирует о том, что вскоре будет включен запрещающий сигнал", img: "" },
            { text: "Предупреждает о неисправности светофора", img: "" }
        ]
    },
    {
        q: "2. Разрешено ли водителю ставить автомобиль на стоянку в указанном месте?",
        img: "Question/2/2.jpg",
        answer: 0,
        options: [
            { text: "нет", img: "" },
            { text: "да", img: "" }
        ]
    },
    {
        q: "3. Вы намерены проехать перекресток в прямом направлении. Ваши действия?",
        img: "Question/3/3.jpg",
        answer: 1,
        options: [
            { text: "Уступите дорогу красному автомобилю, поскольку он первым въехал на перекресток", img: "" },
            { text: "Убедитесь, что красный автомобиль уступает дорогу, и проедете перекресток первым", img: "" }
        ]
    },
    {
        q: "4. Вы намерены повернуть налево. Кому следует уступить дорогу?",
        img: "Question/4/4.jpg",
        answer: 0,
        options: [
            { text: "Никому", img: "" },
            { text: "Только легковому автомобилю", img: "" },
            { text: "Только автобусу", img: "" }
        ]
    },
    {
        q: "5. В каких случаях Вы можете наезжать на прерывистые линии разметки, разделяющие проезжую часть на полосы движения?",
        img: "Question/5/5.jpg",
        answer: 2,
        options: [
            { text: "Во всех перечисленных случаях", img: "" },
            { text: "Только если на дороге нет других транспортных средств", img: "" },
            { text: "Только при перестроении", img: "" }
        ]
    },
    {
        q: "6. Обязан ли мотоциклист уступить Вам дорогу в данной ситуации?",
        img: "Question/6/6.jpg",
        answer: 0,
        options: [
            { text: "Да", img: "" },
            { text: "Нет", img: "" }
        ]
    },
    {
        q: "7. В каких из перечисленных случаев запрещена буксировка на гибкой сцепке?",
        img: "Question/7/7.jpg",
        answer: 2,
        options: [
            { text: "Во всех перечисленных случаях", img: "" },
            { text: "Только в темное время суток и в условиях недостаточной видимости", img: "" },
            { text: "В гололёд и на скользкой дороге", img: "" },
            { text: "Только на горных дорогах", img: "" }
        ]
    },
    {
        q: "8. Какие из этих знаков устанавливают в начале дороги с односторонним движением?",
        img: "Question/8/8.jpg",
        answer: 2,
        options: [
            { text: "b или c", img: "" },
            { text: "Только a", img: "" },
            { text: "Только b", img: "" },
            { text: "b или d", img: "" }
        ]
    },
    {
        q: "9. Сколько полос движений имеет данная дорога?",
        img: "Question/9/9.jpg",
        answer: 1,
        options: [
            { text: "Три полосы для движения", img: "" },
            { text: "Две полосы для движения", img: "" },
            { text: "Одну полосу для движения", img: "" }
        ]
    },
    {
        q: "10. Что означает разметка в виде надписи 'СТОП' на проезжей части?",
        img: "Question/10/10.jpg",
        answer: 2,
        options: [
            { text: "Предупреждает о приближении к знаку 'Уступите дорогу'", img: "" },
            { text: "Предупреждает о приближении к стоп-линии перед регулируемым перекрестком", img: "" },
            { text: "Предупреждает о приближении к стоп-линии и знаку 'Движение без остановки запрещено'", img: "" }
        ]
    }
];