

//Array of Objects

const quiz = [
    
    {
        q: "1. Разрешается ли перевозка людей в буксируемом легковом автомобиле?",
        img: "Question/1/1.jpg",
        answer: 0,
        options: [
            { text: "Разрешается при буксировке на гибкой или жесткой сцепке.", img: "" },
            { text: "Запрещается.", img: "" }
        ]
    },
    {
        q: "2. О чем информирует водителя табличка, установленная под данным знаком?",
        img: "Question/2/2.jpg",
        answer: 1,
        options: [
            { text: "Во время стоянки запрещено выключать двигатель.", img: "" },
            { text: "Стоянка разрешена только с выключенным двигателем.", img: "" }
        ]
    },
    {
        q: "3. Что обозначает данная разметка?",
        img: "Question/3/3.jpg",
        answer: 1,
        options: [
            { text: "Полосу движения специальных автомобилей.", img: "" },
            { text: "Обозначает границу полосы реверсивного движения.", img: "" },
            { text: "Полосу для движения маршрутных транспортных средств.", img: "" }
        ]
    },
    {
        q: "4. Вторым проедет перекресток:",
        img: "Question/4/4.jpg",
        answer: 0,
        options: [
            { text: "Красный автомобиль одновременно с синим.", img: "" },
            { text: "Желтый автомобиль.", img: "" },
            { text: "Зеленый автомобиль.", img: "" }
        ]
    },
    {
        q: "5. Первым проедет перекресток:",
        img: "Question/5/5.jpg",
        answer: 0,
        options: [
            { text: "Зеленый автомобиль.", img: "" },
            { text: "Синий автомобиль.", img: "" },
            { text: "Красный автомобиль.", img: "" }
        ]
    },
    {
        q: "6. Чем должен руководствоваться водитель при проезде железнодорожного переезда?",
        img: "Question/6/6.jpg",
        answer: 0,
        options: [
            { text: "Всеми перечисленными требованиями.", img: "" },
            { text: "Указаниями и сигналами дежурного по переезду.", img: "" },
            { text: "Положением шлагбаума и световой сигнализацией.", img: "" },
            { text: "Дорожными знаками и разметкой.", img: "" }
        ]
    },
    {
        q: "7. В чем должен убедиться водитель, прежде чем начать обгон?",
        img: "Question/7/7.jpg",
        answer: 0,
        options: [
            { text: "В том, что водитель транспортного средства, движущегося впереди по той же полосе, не подал сигнал о повороте (перестроении) налево.", img: "" },
            { text: "В том, что он движется гораздо быстрее водителя обгоняемого транспортного средства.", img: "" },
            { text: "В том, что участок дороги, на который он намерен выехать, свободен на расстоянии 1000 м.", img: "" }
        ]
    },
    {
        q: "8. Остановка и стоянка транспортных средств запрещается в местах, где расстояние между сплошной линией продольной разметки и остановившимся транспортным средством менее:",
        img: "Question/8/8.jpg",
        answer: 1,
        options: [
            { text: "4,0 м.", img: "" },
            { text: "3,0 м.", img: "" },
            { text: "2,0 м.", img: "" },
            { text: "6,0 м.", img: "" },
            { text: "5,0 м.", img: "" }
        ]
    },
    {
        q: "9. Каковы признаки отравления парами бензина?",
        img: "Question/9/9.jpg",
        answer: 0,
        options: [
            { text: "Возбуждение подобное опьянению, головокружение, головная боль, тошнота, рвота. Судороги скелетных мышц.", img: "" },
            { text: "Потемнение в глазах, головокружение, потеря равновесия, падение. Заторможенность. Падение кровяного давления. Холодные конечности.", img: "" }
        ]
    },
    {
        q: "10. Каким водителям разрешается перевозка людей в кузове грузового автомобиля более 8 человек?",
        img: "Question/10/10.jpg",
        answer: 0,
        options: [
            { text: "Водителям, имеющим удостоверение на право управления транспортными средствами категории 'D' и 'С' и стаж управления транспортными средствами одной из этих категорий более 3-х лет.", img: "" },
            { text: "Водителям, имеющим удостоверение на право управления транспортным средством категории 'С' с трехлетним стажем работы на данном автомобиле.", img: "" }
        ]
    }    
];