

//Array of Objects

const quiz = [
    
    {
        q: "1. Какой автомобиль нарушил правила остановки?",
        img: "Question/1/1.jpg",
        answer: 2,
        options: [
            { text: "Оба не нарушали.", img: "" },
            { text: "Зеленый автомобиль.", img: "" },
            { text: "Оба нарушили.", img: "" }
        ]
    },
    {
        q: "2. Какой из перечисленных знаков отменяет все ранее введенные ограничения?",
        img: "Question/2/2.jpg",
        answer: 3,
        options: [
            { text: "2", img: "" },
            { text: "5", img: "" },
            { text: "3", img: "" },
            { text: "4", img: "" },
            { text: "1", img: "" }
        ]
    },
    {
        q: "3. На каком рисунке водитель совершил маневр, не нарушая требований правил?",
        img: "Question/3/3.jpg",
        answer: 1,
        options: [
            { text: "2", img: "" },
            { text: "1", img: "" },
            { text: "3", img: "" }
        ]
    },
    {
        q: "4. Транспортные средства проедут перекресток в следующем порядке:",
        img: "Question/4/4.jpg",
        answer: 0,
        options: [
            { text: "Трамвай, автомобиль и автобус одновременно.", img: "" },
            { text: "Автобус, трамвай, автомобиль.", img: "" },
            { text: "Трамвай, автобус, автомобиль.", img: "" }
        ]
    },
    {
        q: "5. Разрешается ли водителю автобуса двигаться по полосе, обозначенной этим знаком, если полоса отделена сплошной линией разметки?",
        img: "Question/5/5.jpg",
        answer: 2,
        options: [
            { text: "Запрещается", img: "" },
            { text: "Разрешается только не маршрутным автобусам", img: "" },
            { text: "Разрешается, если автобус движется по установленному маршруту", img: "" }
        ]
    },
    {
        q: "6. Как нужно транспортировать раненного с повреждением грудной клетки?",
        img: "Question/6/6.jpg",
        answer: 1,
        options: [
            { text: "В положении лежа на здоровом боку или сидя.", img: "" },
            { text: "Лежа на поврежденном боку или полусидя.", img: "" },
            { text: "В положении лежа на спине или на животе.", img: "" }
        ]
    },
    {
        q: "7. Как определяется количество полос для движения безрельсовых транспортных средств?",
        img: "Question/7/7.jpg",
        answer: 2,
        options: [
            { text: "Дорожной разметкой.", img: "" },
            { text: "Дорожными знаками \"Направления движения по полосам\" или \"Направление движения по полосе\".", img: "" },
            { text: "Всеми перечисленными способами.", img: "" }
        ]
    },
    {
        q: "8. Разрешается ли обгонять автопоезд в данной ситуации, если он движется со скоростью менее 40 км/час?",
        img: "Question/8/8.jpg",
        answer: 1,
        options: [
            { text: "Разрешается.", img: "" },
            { text: "Запрещается.", img: "" }
        ]
    },
    {
        q: "9. На дороге с двухсторонним движением, имеющей три полосы, вы должны повернуть направо. С какой полосы произведете этот маневр?",
        img: "Question/9/9.jpg",
        answer: 1,
        options: [
            { text: "Со средней полосы.", img: "" },
            { text: "С правой полосы.", img: "" },
            { text: "Со средней, только в том случае, когда правая сторона занята.", img: "" },
            { text: "С правой или средней полосы.", img: "" }
        ]
    },
    {
        q: "10. Как следует выезжать из глубокой колеи в зимнее время на заднеприводном автомобиле?",
        img: "Question/10/10.jpg",
        answer: 0,
        options: [
            { text: "Выезжать на небольшой скорости, в первоначальный момент энергично повернуть рулевое колесо в противоположную сторону выезда, а затем в сторону выезда.", img: "" },
            { text: "Начать выезжать из колеи как можно быстрее, сначала повернуть рулевое колесо в сторону выезда, а затем в противоположную.", img: "" }
        ]
    }
];