

//Array of Objects

const quiz = [
    
    {
        q: "1. На сухой дороге для экстренной остановки необходимо:",
        img: "Question/1/1.jpg",
        answer: 2,
        options: [
            { text: "Выключить сцепление и сразу нажать на педаль тормоза.", img: "" },
            { text: "Выключить передачу (поменять скорость) и резко нажать на педаль тормоза.", img: "" },
            { text: "Нажать на педаль тормоза, не выключая сцепление.", img: "" }
        ]
    },
    {
        q: "2. Что означает этот знак?",
        img: "Question/2/2.jpg",
        answer: 0,
        options: [
            { text: "Рекомендуемое направление движения для грузовых автомобилей, тракторов и самоходных машин, если на перекрестке их движение в одном из направлений запрещено.", img: "" },
            { text: "Обязательное направление движения грузовых автомобилей, полная масса которых более 3,5т", img: "" },
            { text: "Направление движения только для грузовых автомобилей.", img: "" },
            { text: "Направление движения грузовых автомобилей, осуществляющих междугородние перевозки.", img: "" }
        ]
    },
    {
        q: "3. Этот дорожный знак предупреждает, что впереди:",
        img: "Question/3/3.jpg",
        answer: 0,
        options: [
            { text: "Место, где дорога выходит на набережную или берег какого-либо водоема.", img: "" },
            { text: "Участок дороги с водной преградой, на котором имеется разводной мост.", img: "" },
            { text: "Участок дороги с водной преградой, не имеющий моста или паромной переправы.", img: "" }
        ]
    },
    {
        q: "4. Автомобили проедут перекресток в следующем порядке:",
        img: "Question/4/4.jpg",
        answer: 0,
        options: [
            { text: "Красный выедет на перекресток и остановится, чтобы пропустить синий, и одновременно с красным проедет зеленый; синий; красный закончит разворот.", img: "" },
            { text: "Красный, синий, зеленый.", img: "" },
            { text: "Синий, зеленый, красный.", img: "" }
        ]
    },
    {
        q: "5. Третьим проедет перекресток:",
        img: "Question/5/5.jpg",
        answer: 1,
        options: [
            { text: "Красный автомобиль.", img: "" },
            { text: "Синий автомобиль.", img: "" },
            { text: "Зеленый автомобиль.", img: "" }
        ]
    },
    {
        q: "6. Кто из водителей легковых автомобилей нарушает правила при движении в населенном пункте?",
        img: "Question/6/6.jpg",
        answer: 0,
        options: [
            { text: "Оба не нарушают.", img: "" },
            { text: "Только водитель автомобиля 'Б'.", img: "" },
            { text: "Оба нарушают.", img: "" }
        ]
    },
    {
        q: "7. Что должен учитывать водитель при выборе скорости движения?",
        img: "Question/7/7.jpg",
        answer: 0,
        options: [
            { text: "Все перечисленные факторы.", img: "" },
            { text: "Дорожные и метрологические условия.", img: "" },
            { text: "Интенсивность движения, особенности и состояние транспортного средства и груза.", img: "" }
        ]
    },
    {
        q: "8. По какому направлению водитель автомобиля правильно выполняет обгон?",
        img: "Question/8/8.jpg",
        answer: 0,
        options: [
            { text: "По направлению 'Б'.", img: "" },
            { text: "По направлению 'А' и 'Б'.", img: "" },
            { text: "По направлению 'А'.", img: "" }
        ]
    },
    {
        q: "9. Что должен учитывать водитель при определении наибольшей ширины полосы движения автопоезда?",
        img: "Question/9/9.jpg",
        answer: 1,
        options: [
            { text: "Только габариты автопоезда по ширине.", img: "" },
            { text: "Габариты транспортного средства по ширине, а также влияние прицепа и смещение его к центру поворота.", img: "" }
        ]
    },
    {
        q: "10. Разрешается ли перевозка детей на переднем сиденье легкового автомобиля?",
        img: "Question/10/10.jpg",
        answer: 1,
        options: [
            { text: "Разрешается независимо от возраста при наличии взрослого пассажира.", img: "" },
            { text: "Разрешается перевозка детей достигших 12-летнего возраста и старше.", img: "" },
            { text: "Разрешается перевозка детей в возрасте не моложе 7 лет.", img: "" }
        ]
    }    
];