

//Array of Objects

const quiz = [
    
    {
        q: '1. На какому термину соответствует этот примечание? Прекращение движения транспортного средства по причине технической неисправности или опасности, создаваемой перевозимым грузом, состоянием водителя, пассажира, препятствием на дороге или метеорологическими условиями.',
        img: 'Question/1/1.jpg',
        answer: 2,
        options: [
            { text: 'Дорожно-транспортное происшествие', img: '' },
            { text: 'Обеспечение безопасности дорожного движения', img: '' },
            { text: 'Вынужденная остановка', img: '' }
        ]
    },
    {
        q: '2. Разрешается ли перевозка людей при буксировке на жёсткой сцепке в буксируемом автобусе или троллейбусе?',
        img: 'Question/2/2.jpg',
        answer: 0,
        options: [
            { text: 'Запрещается', img: '' },
            { text: 'Разрешается', img: '' }
        ]
    },
    {
        q: '3. Какой знак указывает дорогу для выезда в аварийных случаях?',
        img: 'Question/3/3.jpg',
        answer: 0,
        options: [
            { text: 'b', img: '' },
            { text: 'c', img: '' },
            { text: 'a и d', img: '' }
        ]
    },
    {
        q: '4. Когда водитель должен снижать скорость при наличии полосы торможения, намеревающийся повернуть?',
        img: 'Question/4/4.jpg',
        answer: 0,
        options: [
            { text: 'После перестроения на полосе торможения', img: '' },
            { text: 'До перестроения на полосу торможения', img: '' }
        ]
    },
    {
        q: '5. Какой знак указывает место остановки транспортных средств при запрещающем сигнале светофора (регулировщика)?',
        img: 'Question/5/5.jpg',
        answer: 3,
        options: [
            { text: 'd', img: '' },
            { text: 'a', img: '' },
            { text: 'b', img: '' },
            { text: 'c', img: '' }
        ]
    },
    {
        q: '6. Какое транспортное средство должно уступить дорогу?',
        img: 'Question/6/6.jpg',
        answer: 0,
        options: [
            { text: 'Грузовой автомобиль', img: '' },
            { text: 'Легковой автомобиль', img: '' }
        ]
    },
    {
        q: '7. Что означает жест вытянутой в сторону левой руки или вытянутой правой руки и согнутой в локте под прямым углом вверх?',
        img: 'Question/7/7.jpg',
        answer: 0,
        options: [
            { text: 'Левого поворота или разворота', img: '' },
            { text: 'Остановки', img: '' },
            { text: 'Правого поворота или разворота', img: '' }
        ]
    },
    {
        q: '8. Какие знаки предупреждают об участке дороги с повышенной скользкостью проезжей части?',
        img: 'Question/8/8.jpg',
        answer: 1,
        options: [
            { text: 'Только a', img: '' },
            { text: 'Только c', img: '' },
            { text: 'a и b', img: '' }
        ]
    },
    {
        q: '9. При каком способе вождения будет обеспечен наименьший расход топлива?',
        img: 'Question/9/9.jpg',
        answer: 0,
        options: [
            { text: 'При плавном ускорении и плавном замедлении', img: '' },
            { text: 'При резком ускорении и плавном замедлении', img: '' },
            { text: 'При плавном ускорении и резком замедлении', img: '' }
        ]
    },
    {
        q: '10. Признаки артериального кровотечения:',
        img: 'Question/10/10.jpg',
        answer: 0,
        options: [
            { text: 'Кровь розового цвета сильной пульсацией бьётся из сосудов', img: '' },
            { text: 'Кровотечение во внутренние органы из мелких кровеносных сосудов', img: '' },
            { text: 'Тёмно-красная кровь струится из сосудов', img: '' }
        ]
    }    
];