

//Array of Objects

const quiz = [
    
    {
        q: "1. Как следует обозначить буксируемый автомобиль при отсутствии или неисправности аварийной сигнализации?",
        img: "Question/1/1.jpg",
        answer: 2,
        options: [
            { text: "Включить габаритные огни", img: "" },
            { text: "Включить задний противотуманные фонари", img: "" },
            { text: "Установить на задней части буксируемого автомобиля знак аварийной остановки", img: "" }
        ]
    },
    {
        q: "2. В каком из указанных мест Вы можете произвести остановку?",
        img: "Question/2/2.jpg",
        answer: 0,
        options: [
            { text: "Только B", img: "" },
            { text: "Только А", img: "" },
            { text: "Ни в каком", img: "" },
            { text: "Только B и C", img: "" }
        ]
    },
    {
        q: "3. Предотвращает ли система ABS автомобиля скольжение и бокового заноса при повороте?",
        img: "Question/3/3.jpg",
        answer: 2,
        options: [
            { text: "Только предотвращает возможность проскальзывания автомобиля", img: "" },
            { text: "Только предотвращает возможность бокового заноса автомобиля в сторону", img: "" },
            { text: "Не предотвращает возможность скольжения и бокового заноса автомобиля", img: "" }
        ]
    },
    {
        q: "4. Какое расстояние проедет транспортное средство за одну секунду при скорости движения 90 км/ч?",
        img: "Question/4/4.jpg",
        answer: 0,
        options: [
            { text: "25 м", img: "" },
            { text: "35 м", img: "" },
            { text: "15 м", img: "" }
        ]
    },
    {
        q: "5. В какой момент следует начинать отпускать стояночный тормоз при трогании на подъеме?",
        img: "Question/5/5.jpg",
        answer: 0,
        options: [
            { text: "Одновременно с началом движения", img: "" },
            { text: "До начала движения", img: "" },
            { text: "После начала движения", img: "" }
        ]
    },
    {
        q: "6. Должны ли Вы уступить дорогу встречному грузовому автомобилю?",
        img: "Question/6/6.jpg",
        answer: 0,
        options: [
            { text: "Нет", img: "" },
            { text: "Да", img: "" }
        ]
    },
    {
        q: "7. Разрешена ли Вам остановка в указанном месте на перекрестке?",
        img: "Question/7/7.jpg",
        answer: 2,
        options: [
            { text: "Разрешена, если расстояние от Вашего транспортного средства до линии разметки не менее 3 м", img: "" },
            { text: "Разрешена", img: "" },
            { text: "Запрещена", img: "" }
        ]
    },
    {
        q: "8. Разрешается ли устанавливать шторки или жалюзи на заднем стекле легкового автомобиля?",
        img: "Question/8/8.jpg",
        answer: 1,
        options: [
            { text: "Запрещается", img: "" },
            { text: "Разрешается, но только при наличии с обеих сторон зеркал заднего вида", img: "" }
        ]
    },
    {
        q: "9. Вы намерены повернуть налево. Кому следует уступить дорогу?",
        img: "Question/9/9.jpg",
        answer: 1,
        options: [
            { text: "Только автобусу", img: "" },
            { text: "Обоим транспортным средствам", img: "" },
            { text: "Только грузовому автомобилю", img: "" }
        ]
    },
    {
        q: "10. Разрешено ли Вам въехать на железнодорожный переезд?",
        img: "Question/10/10.jpg",
        answer: 1,
        options: [
            { text: "Да, если отсутствует приближающийся поезд", img: "" },
            { text: "Запрещается", img: "" },
            { text: "Да", img: "" }
        ]
    }    
];