

//Array of Objects

const quiz = [
    
    {
        q: "1. Если в результате дорожно-транспортного происшествия нет пострадавших, а материальный ущерб несущественен, могут ли водители сами покинуть место происшествия и прибыть на ближайший пост ГСБДД или в органы внутренних дел для оформления происшествия?",
        img: "Question/1/1.jpg",
        answer: 2,
        options: [
            { text: "Могут.", img: "" },
            { text: "Не могут.", img: "" },
            { text: "Могут, предварительно составив схему происшествия и подписав ее.", img: "" }
        ]
    },
    {
        q: "2. Водители, каких транспортных средств нарушили правила стоянки?",
        img: "Question/2/2.jpg",
        answer: 1,
        options: [
            { text: "А и Б.", img: "" },
            { text: "Б, В и Г.", img: "" },
            { text: "Только Г.", img: "" },
            { text: "Б и Г.", img: "" },
            { text: "В и Г.", img: "" }
        ]
    },
    {
        q: "3. Каким транспортным средствам разрешено движение по дороге, на которой установлен этот знак?",
        img: "Question/3/3.jpg",
        answer: 2,
        options: [
            { text: "Транспортным средствам, максимальная скорость которых не менее 40 км/ч.", img: "" },
            { text: "Всем транспортным средствам.", img: "" },
            { text: "Автомобилям, автобусам и мотоциклам.", img: "" },
            { text: "Механическим транспортным средствам.", img: "" }
        ]
    },
    {
        q: "4. Первым проедет перекресток:",
        img: "Question/4/4.jpg",
        answer: 2,
        options: [
            { text: "Красный автомобиль.", img: "" },
            { text: "Синий автомобиль.", img: "" },
            { text: "Зеленый автомобиль.", img: "" }
        ]
    },
    {
        q: "5. При красном сигнале данного светофора движение запрещается:",
        img: "Question/5/5.jpg",
        answer: 3,
        options: [
            { text: "С обгоном.", img: "" },
            { text: "По всей ширине проезжей части.", img: "" },
            { text: "Только в один ряд.", img: "" },
            { text: "По полосе, над которой он расположен.", img: "" }
        ]
    },
    {
        q: "6. Если встречный разъезд на уклонах, обозначенных соответствующими знаками, затруднен, необходимо уступить дорогу:",
        img: "Question/6/6.jpg",
        answer: 2,
        options: [
            { text: "Транспортному средству, движущемуся на спуск.", img: "" },
            { text: "Маршрутному транспортному средству.", img: "" },
            { text: "Транспортному средству, движущемуся на подъем.", img: "" }
        ]
    },
    {
        q: "7. Разрешается ли обгон на этом участке дороги?",
        img: "Question/7/7.jpg",
        answer: 0,
        options: [
            { text: "Запрещается.", img: "" },
            { text: "Разрешается.", img: "" }
        ]
    },
    {
        q: "8. При выборе скорости движения водителю запрещается:",
        img: "Question/8/8.jpg",
        answer: 2,
        options: [
            { text: "Превышать скорость, указанную на опознавательном знаке, установленном на транспортном средстве в соответствии с настоящими Правилами.", img: "" },
            { text: "Резко тормозить, если это не требуется для обеспечения безопасности движения.", img: "" },
            { text: "Запрещаются оба перечисленных действия.", img: "" }
        ]
    },
    {
        q: "9. Как правильно снять с пострадавшего рубашку, пиджак при ранении руки?",
        img: "Question/9/9.jpg",
        answer: 1,
        options: [
            { text: "Одежду снимать с обеих рук одновременно.", img: "" },
            { text: "Одежду начинать снимать со здоровой руки, затем освобождать больную руку.", img: "" },
            { text: "Одежду начинать снимать с больной руки, затем освобождать здоровую руку.", img: "" }
        ]
    },
    {
        q: "10. Разрешается ли буксировка мопедов?",
        img: "Question/10/10.jpg",
        answer: 1,
        options: [
            { text: "Разрешается.", img: "" },
            { text: "Запрещается.", img: "" },
            { text: "Разрешается только в светлое время суток по дорогам, не имеющим твердого покрытия.", img: "" }
        ]
    }    
];