

//Array of Objects

const quiz = [
    
    {
        q: '1. Полоса движения:',
        img: 'Question/1/1.jpg',
        answer: 2,
        options: [
            { text: 'Часть дороги, предназначенная для движения безрельсовых транспортных средств', img: '' },
            { text: 'Элемент дороги, разделяющий смежные проезжие части и не предназначенный для движения и остановки транспортных средств, расположенный выше уровня дороги и (или) обозначенный дорожной разметкой 1.1', img: '' },
            { text: 'Любая из продольных полос проезжей части, обозначенная или необозначенная дорожной разметкой и имеющая ширину, достаточную для движения автомобилей в один ряд', img: '' }
        ]
    },
    {
        q: '2. Пассажирам запрещается:',
        img: 'Question/2/2.jpg',
        answer: 3,
        options: [
            { text: 'Отвлекать водителя или мешать ему во время движения транспортного средства', img: '' },
            { text: 'Открывать двери транспортного средства во время движения', img: '' },
            { text: 'Стоять, сидеть на бортах или на грузе, расположенном на уровне или выше бортов, во время движения на бортовом грузовом автомобиле', img: '' },
            { text: 'Все выше указанные ответы верны', img: '' }
        ]
    },
    {
        q: '3. Какой из указанных знаков распространяет свое действие только на ту полосу, над которой он установлен?',
        img: 'Question/3/3.jpg',
        answer: 1,
        options: [
            { text: 'b и c', img: '' },
            { text: 'Только a', img: '' },
            { text: 'Только b', img: '' }
        ]
    },
    {
        q: '4. В случае, если значение сигналов светофора противоречат требованиям дорожных знаков приоритета:',
        img: 'Question/4/4.jpg',
        answer: 0,
        options: [
            { text: 'Водители должны руководствоваться сигналами светофора', img: '' },
            { text: 'Водители должны руководствоваться требованиями знаков приоритета', img: '' }
        ]
    },
    {
        q: '5. При выезде из жилой зоны необходимо уступить дорогу:',
        img: 'Question/5/5.jpg',
        answer: 0,
        options: [
            { text: 'Всем транспортным средствам', img: '' },
            { text: 'Только транспортным средствам, приближающимся слева', img: '' },
            { text: 'Только транспортным средствам с включенным проблесковым маячком', img: '' },
            { text: 'Только транспортным средствам, приближающимся справа', img: '' }
        ]
    },
    {
        q: '6. Желтый автомобиль проедет перекрёсток:',
        img: 'Question/6/6.jpg',
        answer: 2,
        options: [
            { text: 'Третьим', img: '' },
            { text: 'Вторым', img: '' },
            { text: 'Последним', img: '' }
        ]
    },
    {
        q: '7. Какие ограничения, относящиеся к обгону, действуют на железнодорожных переездах и вблизи них?',
        img: 'Question/7/7.jpg',
        answer: 2,
        options: [
            { text: 'Обгон запрещен только на после переезда.', img: '' },
            { text: 'Обгон запрещен на переезде и на расстоянии 100 м до и после него.', img: '' },
            { text: 'Обгон запрещен на переезде и ближе чем за 100 м перед ним.', img: '' }
        ]
    },
    {
        q: '8. Не менее скольких предупредительных устройств должно устанавливаться при буксировке на гибкой сцепке?',
        img: 'Question/8/8.jpg',
        answer: 2,
        options: [
            { text: 'Не менее трёх', img: '' },
            { text: 'Не менее одного', img: '' },
            { text: 'Не менее двух', img: '' }
        ]
    },
    {
        q: '9. Двигаясь в прямом направлении, Вы внезапно попали на небольшой участок скользкой дороги. Что следует предпринять?',
        img: 'Question/9/9.jpg',
        answer: 0,
        options: [
            { text: 'Проехать не меняя траектории и скорости движения', img: '' },
            { text: 'Повернуть руль, чтобы съехать с этого участка дороги', img: '' },
            { text: 'Плавно затормозить', img: '' }
        ]
    },
    {
        q: '10. Разметка в виде треугольника на полосе движения:',
        img: 'Question/10/10.jpg',
        answer: 2,
        options: [
            { text: 'Указывает место, где Вам необходимо остановиться.', img: '' },
            { text: 'Обозначает опасный участок дороги.', img: '' },
            { text: 'Предупреждает Вас о приближении к месту, где нужно уступить дорогу.', img: '' }
        ]
    }    
];