

//Array of Objects

const quiz = [
    
    {
        q: '1. В каких случаях немаршрутные транспортные средства могут двигаться по правой полосе, обозначенной буквой «А»?',
        img: 'Question/1/1.jpg',
        answer: 0,
        options: [
            { text: 'Во всех вышеперечисленных случаях, если не мешает движению маршрутных транспортных средств.', img: '' },
            { text: 'При посадке и высадке пассажиров', img: '' },
            { text: 'При повороте направо', img: '' }
        ]
    },
    {
        q: '2. С какой максимальной скоростью разрешается движение в жилых зонах?',
        img: 'Question/2/2.jpg',
        answer: 0,
        options: [
            { text: '20 км/ч', img: '' },
            { text: '30 км/ч', img: '' },
            { text: '5 км/ч', img: '' },
            { text: '40 км/ч', img: '' }
        ]
    },
    {
        q: '3. Синий автомобиль проедет перекресток:',
        img: 'Question/3/3.jpg',
        answer: 0,
        options: [
            { text: 'Последним', img: '' },
            { text: 'Первым.', img: '' },
            { text: 'Вторым.', img: '' }
        ]
    },
    {
        q: '4. Этот дополнительная табличка означает:',
        img: 'Question/4/4.jpg',
        answer: 0,
        options: [
            { text: 'Расстояние до объекта', img: '' },
            { text: 'Зона действия знака', img: '' }
        ]
    },
    {
        q: '5. На каком из рисунков показана разделительная полоса?',
        img: 'Question/5/5.jpg',
        answer: 2,
        options: [
            { text: 'B', img: '' },
            { text: 'A', img: '' },
            { text: 'Ни на одном изображении нет разделительной области', img: '' }
        ]
    },
    {
        q: '6. В случае, когда правые колёса автомобиля наезжают на неукреплённую влажную обочину, рекомендуется:',
        img: 'Question/6/6.jpg',
        answer: 2,
        options: [
            { text: 'Затормозить и плавно направить автомобиль на проезжую часть', img: '' },
            { text: 'Затормозить и полностью остановиться', img: '' },
            { text: 'Не прибегая к торможению, плавно направить автомобиль на проезжую часть', img: '' }
        ]
    },
    {
        q: '7. Какой знак обозначает примыкание второстепенной дороги?',
        img: 'Question/7/7.jpg',
        answer: 0,
        options: [
            { text: 'b', img: '' },
            { text: 'e', img: '' },
            { text: 'a', img: '' },
            { text: 'c', img: '' },
            { text: 'd', img: '' }
        ]
    },
    {
        q: '8. Эта табличка означает:',
        img: 'Question/8/8.jpg',
        answer: 0,
        options: [
            { text: 'Указывает на принудительную эвакуацию автомобилей, остановившихся в зоне действие знака', img: '' },
            { text: 'Разрешает эвакуацию остановившихся транспортных средств в зоне действие знака', img: '' },
            { text: 'Запрещает эвакуацию остановившихся транспортных средств в зоне действие знака', img: '' }
        ]
    },
    {
        q: '9. На перекрёстке кругового движения:',
        img: 'Question/9/9.jpg',
        answer: 1,
        options: [
            { text: 'Транспортные средства въезжающий на перекресток имеют приоритет (преимущество) по отношению к транспортным средствам движущиеся на перекрестке', img: '' },
            { text: 'Транспортные средства, движущиеся на перекрестке с круговым движением, имеют приоритет (преимущество) по отношению к транспортным средствам, въезжающим на перекресток', img: '' }
        ]
    },
    {
        q: '10. На рисунке изображен-...',
        img: 'Question/10/10.jpg',
        answer: 1,
        options: [
            { text: 'Нерегулируемый, равнозначный перекресток', img: '' },
            { text: 'Нерегулируемый, перекресток неравнозначных дорог', img: '' },
            { text: 'Регулируемый перекресток', img: '' }
        ]
    }    
];