

//Array of Objects

const quiz = [
    
    {
        q: "1. В каком из перечисленных случаев Правила обязывают водителя предоставить свое транспортное средство в распоряжение работника органов внутренних дел?",
        img: "Question/1/1.jpg",
        answer: 0,
        options: [
            { text: 'Для выполнения неотложных служебных заданий', img: '' },
            { text: 'В любом случае', img: '' },
            { text: 'Для следования к месту работы', img: '' }
        ],
        // solutionText: "Question/1/1.0.jpg"
    },
    {
        q: "2. Водитель какого транспортного средства имеет право на первоочередное движение?",
        img: "Question/2/2.jpg",
        answer: 0,
        options: [
            { text: 'Водитель грузового автомобиля', img: '' },
            { text: 'Водитель автобуса', img: '' }
        ],
        // solutionText: "Question/2/2.0.jpg"
        
    },
    {
        q: "3. Какой знак запрещает движение транспортных средств с дистанцией между ними, меньше указанной на знаке?",
        img: "Question/3/3.jpg",
        answer: 0,
        options: [
            { text: '3', img: '' },
            { text: '4', img: '' },
            { text: '5', img: '' },
            { text: '2', img: '' },
            { text: '1', img: '' }
        ],
        // solutionText: "Question/3/3.0.jpg"
    },
    {
        q: "4. Разрешается ли автобусу въезжать на перекресток в данной ситуации?",
        img: "Question/4/4.jpg",
        answer: 0,
        options: [
            { text: 'Запрещается', img: '' },
            { text: 'Разрешается', img: '' },
            { text: 'Разрешается, если автобус движется по установленному маршруту', img: '' }
        ],
        // solutionText: "Question/4/4.0.jpg"
    },
    {
        q: "5. Из какой полосы следует поворачивать направо в показанной ситуации?",
        img: "Question/5/5.jpg",
        answer: 0,
        options: [
            { text: 'Только из крайней правой полосы, обозначенной разметкой "А"', img: '' },
            { text: 'Только из второй полосы', img: '' }
        ],
        // solutionText: "Question/5/5.0.jpg"
    },
    {
        q: "6. Этот сигнал регулировщика означает, что:",
        img: "Question/6/6.jpg",
        answer: 0,
        options: [
            { text: 'Разрешено движение синему, красному, зеленому автомобилям. Запрещено желтому, белому', img: '' },
            { text: 'Разрешено движение синему, зеленому автомобилям. Запрещено красному, желтому, белому', img: '' }
        ],
        // solutionText: "Question/6/6.0.jpg"
    },
    {
        
        q: "7. С какой максимальной скоростью разрешается движение легковых автомобилей на участках дорог вне населенных пунктов?",
        img: "Question/7/7.jpg",
        answer: 0,
        options: [
            { text: '100 км/ч.', img: '' },
            { text: '80 км/ч.', img: '' },
            { text: '110 км/ч.', img: '' },
            { text: '90 км/ч.', img: '' },
            { text: '70 км/ч.', img: '' }
        ],
        // solutionText: "Question/7/7.0.jpg"
    },
    {
        
        q: "8. На перекрестке организовано круговое движение. Проезжая часть, по которой вы подъезжаете к перекрестку, имеет две полосы для движения. Какую полосу Вы обязаны занять для поворота при въезде на перекресток?",
        answer: 0,
        options: [
            { text: 'Правую или левую полосу', img: '' },
            { text: 'Правую полосу', img: '' },
            { text: 'Левую полосу', img: '' }
        ],
        // solutionText: "Question/8/8.0.jpg"
    },
    {
        q: "9. Вы остановились на подъеме в ожидании разрешающего сигнала светофора. При этом удерживать автомобиль на месте лучше всего:",
        img: 'Question/9/9.jpg',
        answer: 0,
        options: [
            { text: 'Стояночным тормозом', img: '' },
            { text: 'Рабочим тормозом', img: '' },
            { text: 'Выключенным двигателем, с включенной пониженной передачей', img: '' },
            { text: 'За счет пробуксовки сцепления при включенной первой передаче', img: '' }
        ],
        // solutionText: "Question/9/9.0.jpg"
    },
    {
        q: "10. В каких случаях допускается выезд велосипедистов от правого края проезжей части?",
        img: "Question/10/10.jpg",
        answer: 0,
        options: [
            { text: 'В разрешенных случаях для поворота налево или разворота', img: '' },
            { text: 'При перевозке груза', img: '' },
            { text: 'В обоих перечисленных случаях', img: '' }
        ],
        // solutionText: "Question/10/10.0.jpg"
    }
];