

//Array of Objects

const quiz = [
    
    {
        q: '1. С какой максимальной скоростью разрешается движение в жилых зонах?',
        img: 'Question/1/1.jpg',
        answer: 1,
        options: [
            { text: '5 км/ч', img: '' },
            { text: '20 км/ч', img: '' },
            { text: '40 км/ч', img: '' },
            { text: '30 км/ч', img: '' }
        ]
    },
    {
        q: '2. Что должно иметь самое решающее значение при выборе водителем скорости движения в тёмное время суток?',
        img: 'Question/2/2.jpg',
        answer: 2,
        options: [
            { text: 'Максимальная конструктивная скорость, установленная технической характеристикой используемого транспортного средства', img: '' },
            { text: 'Предельные ограничения скорости, установленные Правилами', img: '' },
            { text: 'Условия видимости', img: '' }
        ]
    },
    {
        q: '3. На каком рисунке дорога с разделительной полосой?',
        img: 'Question/3/3.jpg',
        answer: 0,
        options: [
            { text: 'Сверху', img: '' },
            { text: 'Обоих рисунках', img: '' },
            { text: 'Снизу', img: '' }
        ]
    },
    {
        q: '4. В случае, когда правые колёса автомобиля наезжают на неукреплённую влажную обочину, рекомендуется:',
        img: 'Question/4/4.jpg',
        answer: 1,
        options: [
            { text: 'Затормозить и плавно направить автомобиль на проезжую часть', img: '' },
            { text: 'Не прибегая к торможению, плавно направить автомобиль на проезжую часть', img: '' },
            { text: 'Затормозить и полностью остановиться', img: '' }
        ]
    },
    {
        q: '5. Суммарный люфт в рулевом управлении в регламентированных условиях испытаний автотранспортного средства категория М2 не должен превышать следующих значений:',
        img: 'Question/5/5.jpg',
        answer: 2,
        options: [
            { text: '25°', img: '' },
            { text: '10°', img: '' },
            { text: '20°', img: '' }
        ]
    },
    {
        q: '6. Кому должен уступить дорогу водитель автобуса на этом перекрестке?',
        img: 'Question/6/6.jpg',
        answer: 2,
        options: [
            { text: 'Красному автомобилю', img: '' },
            { text: 'Никому', img: '' },
            { text: 'Белому автомобилю', img: '' }
        ]
    },
    {
        q: '7. При повороте налево обязан ли водитель уступить дорогу пешеходам, переходящим проезжую часть пересекаемой дороги?',
        img: 'Question/7/7.jpg',
        answer: 1,
        options: [
            { text: 'Обязан, если на перекрёстке есть пешеходный переход', img: '' },
            { text: 'Обязан во всех случаях', img: '' }
        ]
    },
    {
        q: '8. Эта табличка означает:',
        img: 'Question/8/8.jpg',
        answer: 0,
        options: [
            { text: 'Указывает способ постановки транспортного средства на проезжую часть, вдоль тротуара', img: '' },
            { text: 'Указывает место стоянки легковых автомобилей', img: '' },
            { text: 'Указывает место стоянки механических транспортных средств', img: '' }
        ]
    },
    {
        q: '9. На перекрёстке кругового движения:',
        img: 'Question/9/9.jpg',
        answer: 0,
        options: [
            { text: 'Транспортные средства, движущиеся на перекрёстке с круговым движением, имеют приоритет (преимущество) по отношению к транспортным средствам, въезжающим на перекрёсток', img: '' },
            { text: 'Транспортные средства, въезжающие на перекрёсток, имеют приоритет (преимущество) по отношению к транспортным средствам, движущимся на перекрёстке', img: '' }
        ]
    },
    {
        q: '10. Каковы признаки сдавливания и растяжения мышечной ткани и сухожилий?',
        img: 'Question/10/10.jpg',
        answer: 1,
        options: [
            { text: 'На месте ранения чувствуется боль.', img: '' },
            { text: 'На месте ранения появляется отёк, чувствуется боль, иногда, в месте ранения лопаются капилляры, в результате чего образуется гематома (синяк).', img: '' }
        ]
    }    
];