

//Array of Objects

const quiz = [
    
    {
        q: "1. В каком месте разрешается пешеходам пересекать проезжую часть при отсутствии пешеходного перехода?",
        img: "Question/1/1.jpg",
        answer: 2,
        options: [
            { text: "На перекрестках по линии тротуаров или обочин.", img: "" },
            { text: "На участках, где она хорошо просматривается в обе стороны под прямым углом к краю проезжей части.", img: "" },
            { text: "Во всех перечисленных местах.", img: "" }
        ]
    },
    {
        q: "2. Какой знак запрещает движение со скоростью менее 50 км/час?",
        img: "Question/2/2.jpg",
        answer: 4,
        options: [
            { text: "4", img: "" },
            { text: "1", img: "" },
            { text: "2", img: "" },
            { text: "5", img: "" },
            { text: "3", img: "" }
        ]
    },
    {
        q: "3. Где наносится сплошная желтая линия, запрещающая остановку?",
        img: "Question/3/3.jpg",
        answer: 0,
        options: [
            { text: "У края проезжей части или по верху бордюров.", img: "" },
            { text: "Только по верху бордюра.", img: "" },
            { text: "На проезжей части.", img: "" },
            { text: "У края проезжей части.", img: "" }
        ]
    },
    {
        q: "4. Разрешена ли остановка на автомагистрали?",
        img: "Question/4/4.jpg",
        answer: 2,
        options: [
            { text: "Разрешается, если имеются три полосы для движения в одном направлении.", img: "" },
            { text: "Разрешается в местах, где автомагистраль хорошо просматривается.", img: "" },
            { text: "Разрешается на специальных площадках для стоянки, обозначенных знаком \"Место стоянки\" или \"Место отдыха\".", img: "" },
            { text: "Запрещена.", img: "" }
        ]
    },
    {
        q: "5. В каком порядке проедут перекресток транспортные средства?",
        img: "Question/5/5.jpg",
        answer: 1,
        options: [
            { text: "Трамвай 2 одновременно с трамваем 1, синий автомобиль одновременно с красным.", img: "" },
            { text: "Трамвай 2; синий автомобиль; трамвай 1; красный автомобиль.", img: "" }
        ]
    },
    {
        q: "6. Фарой-прожектором разрешается пользоваться:",
        img: "Question/6/6.jpg",
        answer: 1,
        options: [
            { text: "В темное время суток на всех участках дорог.", img: "" },
            { text: "Только вне населенных пунктов при отсутствии встречных транспортных средств.", img: "" },
            { text: "В любых местах, если в этом есть необходимость.", img: "" },
            { text: "Только в условиях недостаточной видимости.", img: "" }
        ]
    },
    {
        q: "7. Если Вы выехали для обгона движущегося впереди идущего автомобиля, то в какой из перечисленных ситуаций наиболее целесообразно подать звуковой сигнал?",
        img: "Question/7/7.jpg",
        answer: 2,
        options: [
            { text: "Водитель обгоняемого автомобиля включил указатель правого поворота.", img: "" },
            { text: "Водитель обгоняемого автомобиля начал притормаживать.", img: "" },
            { text: "Водитель обгоняемого автомобиля включил указатель левого поворота.", img: "" },
            { text: "Обгон совершается в ночное время.", img: "" }
        ]
    },
    {
        q: "8. Разрешается ли остановка в указанном месте?",
        img: "Question/8/8.jpg",
        answer: 0,
        options: [
            { text: "Разрешается.", img: "" },
            { text: "Запрещается.", img: "" }
        ]
    },
    {
        q: "9. Обязан ли водитель легкового автомобиля уступить дорогу?",
        img: "Question/9/9.jpg",
        answer: 0,
        options: [
            { text: "Да.", img: "" },
            { text: "Нет.", img: "" }
        ]
    },
    {
        q: "10. Разрешается ли проезд в кузове грузового автомобиля, не оборудованного для перевозки людей?",
        img: "Question/10/10.jpg",
        answer: 1,
        options: [
            { text: "Разрешается на дорогах, не относящихся к автомагистралям.", img: "" },
            { text: "Разрешается только лицам, сопровождающим груз или следующим за его получением, при условии обеспечения их местом для сидения, расположенным ниже уровня бортов.", img: "" },
            { text: "Запрещается.", img: "" }
        ]
    }    
];