

//Array of Objects

const quiz = [
    
    {
        q: '1. Какую дистанцию должен соблюдать водитель до движущегося впереди транспортного средства?',
        img: 'Question/1/1.jpg',
        answer: 0,
        options: [
            { text: 'Водитель должен соблюдать такую дистанцию до движущегося впереди транспортного средства, которая гарантировала бы избежание столкновения в случае его экстренной остановки', img: '' },
            { text: '50 м', img: '' },
            { text: '20 м', img: '' }
        ]
    },
    {
        q: '2. Этот дорожный знак:',
        img: 'Question/2/2.jpg',
        answer: 1,
        options: [
            { text: 'Обозначает что, на проезжей части имеется заградительное устройство', img: '' },
            { text: 'Означает, что впереди находится управляемое блокирующее устройство', img: '' },
            { text: 'Обозначает что, перед перекрестком заградительное устройство', img: '' }
        ]
    },
    {
        q: '3. Пешеходы при пересечении дороги с какой стороны обязаны обходить стоящий автобус и троллейбус?',
        img: 'Question/3/3.jpg',
        answer: 2,
        options: [
            { text: 'Спереди', img: '' },
            { text: 'С любой стороны', img: '' },
            { text: 'Сзади', img: '' }
        ]
    },
    {
        q: '4. Какому транспортному средству движение запрещено?',
        img: 'Question/4/4.jpg',
        answer: 0,
        options: [
            { text: 'Грузовому автомобилю', img: '' },
            { text: 'Мотоциклу', img: '' },
            { text: 'Никому незапрещено', img: '' }
        ]
    },
    {
        q: '5. Более устойчив против опрокидывания на повороте легковой автомобиль:',
        img: 'Question/5/5.jpg',
        answer: 3,
        options: [
            { text: 'Без пассажиров, но с грузом на верхнем багажнике', img: '' },
            { text: 'С пассажирами и грузом', img: '' },
            { text: 'С пассажирами, но без груза', img: '' },
            { text: 'Без пассажиров и груза', img: '' }
        ]
    },
    {
        q: '6. Последним проедет перекресток:',
        img: 'Question/6/6.jpg',
        answer: 1,
        options: [
            { text: 'Красный автомобиль', img: '' },
            { text: 'Белый одновременно с жёлтым', img: '' },
            { text: 'Белый автомобиль', img: '' }
        ]
    },
    {
        q: '7. Способ разворота с использованием прилегающей территории слева, обеспечивающий безопасность движения, показан:',
        img: 'Question/7/7.jpg',
        answer: 1,
        options: [
            { text: 'Только на левом рисунке', img: '' },
            { text: 'Только на правом рисунке', img: '' },
            { text: 'На обоих рисунках', img: '' }
        ]
    },
    {
        q: '8. Какое расстояние проедет транспортное средство за одну секунду при скорости движения 108 км/ч?',
        img: 'Question/8/8.jpg',
        answer: 1,
        options: [
            { text: '15 м', img: '' },
            { text: '30 м', img: '' },
            { text: '25 м', img: '' }
        ]
    },
    {
        q: '9. Разрешается ли перевозить людей в буксируемом автобусе?',
        img: 'Question/9/9.jpg',
        answer: 2,
        options: [
            { text: 'Разрешается только сидячим пассажирам', img: '' },
            { text: 'Разрешается', img: '' },
            { text: 'Запрещается', img: '' }
        ]
    },
    {
        q: '10. В каком ответе правильно указаны места, где запрещается движение задним ходом?',
        img: 'Question/10/10.jpg',
        answer: 3,
        options: [
            { text: 'На пешеходных переходах', img: '' },
            { text: 'В тоннелях', img: '' },
            { text: 'На перекрестках', img: '' },
            { text: 'Во всех перечисленных случаях', img: '' }
        ]
    }    
];