

//Array of Objects

const quiz = [
    
    {
        q: "1. Водитель, какого транспортного средства правильно выполняет обгон?",
        img: "Question/1/1.jpg",
        answer: 3,
        options: [
            { text: "Обоим водителям обгон запрещен", img: "" },
            { text: "Водитель синего автомобиля", img: "" },
            { text: "Оба водителя правильно обгоняют", img: "" },
            { text: "Водитель зеленого автомобиля", img: "" }
        ]
    },
    {
        q: "2. Водитель, какого транспортного средства должен уступить дорогу?",
        img: "Question/2/2.jpg",
        answer: 0,
        options: [
            { text: "Водитель грузового автомобиля", img: "" },
            { text: "Водитель трактора", img: "" }
        ]
    },
    {
        q: "3. Что указывает табличка под знаком?",
        img: "Question/3/3.jpg",
        answer: 0,
        options: [
            { text: "Расстояние от знака до узкого участка дороги", img: "" },
            { text: "Расстояние до объезда узкого участка дороги", img: "" },
            { text: "Протяженность узкого участка дороги", img: "" }
        ]
    },
    {
        q: "4. Вторым проедет перекресток:",
        img: "Question/4/4.jpg",
        answer: 1,
        options: [
            { text: "Синий автомобиль", img: "" },
            { text: "Красный автомобиль", img: "" },
            { text: "Зеленый автомобиль", img: "" }
        ]
    },
    {
        q: "5. Водитель, какого транспортного средства должен уступить дорогу?",
        img: "Question/5/5.jpg",
        answer: 0,
        options: [
            { text: "Водитель грузового автомобиля.", img: "" },
            { text: "Водитель мотоцикла.", img: "" }
        ]
    },
    {
        q: "6. Что обозначает данная вертикальная разметка?",
        img: "Question/6/6.jpg",
        answer: 1,
        options: [
            { text: "Боковые поверхности ограждения дорог на закруглениях малого радиуса.", img: "" },
            { text: "Обозначает боковые поверхности ограждений дорог на других участках", img: "" }
        ]
    },
    {
        q: "7. Остановка и стоянка запрещена:",
        img: "Question/7/7.jpg",
        answer: 0,
        options: [
            { text: "Во всех перечисленных случаях", img: "" },
            { text: "На мостах, эстакадах и путепроводах, имеющие менее 3 полос движения", img: "" },
            { text: "Вблизи опасных поворотов и выпуклых переломов продольного профиля дороги с видимостью дороги менее 100 м в одном направлении", img: "" }
        ]
    },
    {
        q: "8. В поле, на сельскохозяйственных работах, траектории движения грузового автомобиля и трактора пересекаются. Кто должен уступить дорогу?",
        img: "Question/8/8.jpg",
        answer: 3,
        options: [
            { text: "Водитель, находящийся справа", img: "" },
            { text: "Водитель грузового автомобиля водителю трактора", img: "" },
            { text: "Водитель грузового автомобиля водителю трактора", img: "" },
            { text: "Водитель, к которому транспортное средство приближается справа", img: "" }
        ]
    },
    {
        q: "9. Разрешается ли пользоваться накатом при движении на крутых спусках горных дорог?",
        img: "Question/9/9.jpg",
        answer: 2,
        options: [
            { text: "Рекомендуется, если автомобиль оборудован гидровакуумным усилителем тормозов.", img: "" },
            { text: "Рекомендуется, если дорога в хорошем состоянии и просматривается на далекое расстояние.", img: "" },
            { text: "Запрещается.", img: "" }
        ]
    },
    {
        q: "10. В каком случае Правила запрещают дальнейшее движение транспортных средств?",
        img: "Question/10/10.jpg",
        answer: 0,
        options: [
            { text: "Если не работает тормозная система, рулевое управление, неисправно сцепное устройство (в составе автопоезда).", img: "" },
            { text: "Имеются значительные внешние повреждения деталей кузова (кабины) и окраски", img: "" },
            { text: "Разрушен коренной лист или центральный болт рессоры", img: "" },
            { text: "Во втором и третьем случае", img: "" }
        ]
    }    
];