

//Array of Objects

const quiz = [
    
    {
            q: '1. Пешеходный переход – это …',
            img: 'Question/1/1.jpg',
            answer: 2,
            options: [
                { text: 'Часть дороги, примыкающая к проезжей части или отделенная от нее газоном, арыком или специальным сооружением, предназначенная для движения пешеходов.', img: '' },
                { text: 'Часть дороги, предназначенная для движения пешеходов, по которой запрещено движение транспортных средств.', img: '' },
                { text: 'Участок проезжей части дороги, предназначенный для пересечения пешеходами, обозначенный дорожными знаками 5.16.1, 5.16.2 и дорожной разметкой 1.14.1-1.14.3.', img: '' }
            ]
    },
    {
            q: '2. Этот дорожный знак …',
            img: 'Question/2/2.jpg',
            answer: 1,
            options: [
                { text: 'Предупреждает о высоком интенсивности движения в переди', img: '' },
                { text: 'Предупреждает о заторе транспортных средств в переди', img: '' },
                { text: 'О создании безопасной дистанции между транспортными средствами', img: '' }
            ]
    },
    {
            q: '3. Что обозначает эта горизонтальная разметка?',
            img: 'Question/3/3.jpg',
            answer: 1,
            options: [
                { text: 'Места стоянки маршрутных такси', img: '' },
                { text: 'Искуственную неровности дороги', img: '' },
                { text: 'Велосипедную дорожку', img: '' }
            ]
    },
    {
            q: '4. При каком способе вождения будет обеспечен наименьший расход топлива?',
            img: 'Question/4/4.jpg',
            answer: 2,
            options: [
                { text: 'При плавном ускорении и резком замедлении', img: '' },
                { text: 'При резком ускорении и плавном замедлении', img: '' },
                { text: 'При плавном ускорении и плавном замедлении', img: '' }
            ]
    },
    {
            q: '5. Кому обязан уступить дорогу водитель транспортного средства при движении в направлении зеленой стрелки, включенной в дополнительной секции одновременно с желтым и красным сигналом светофора?',
            img: 'Question/5/5.jpg',
            answer: 2,
            options: [
                { text: 'Транспортным средствам, приближающимся справа', img: '' },
                { text: 'Транспортным средствам, движущимся со встречного направления прямо и направо', img: '' },
                { text: 'Транспортным средствам, движущимся с других направлений', img: '' }
            ]
    },
    {
            q: '6. Вы намерены повернуть налево, какому транспортному средству следует уступить дорогу?',
            img: 'Question/6/6.jpg',
            answer: 1,
            options: [
                { text: 'Автобусу', img: '' },
                { text: 'Никому', img: '' },
                { text: 'Легковому автомобилю', img: '' }
            ]
    },
    {
            q: '7. Разрешено движение:',
            img: 'Question/7/7.jpg',
            answer: 2,
            options: [
                { text: 'На красной, желтой и зеленой машинах', img: '' },
                { text: 'На красной, синей, зеленой и желтой машинах', img: '' },
                { text: 'На красной и желтой машинах', img: '' }
            ]
    },
    {
            q: '8. Водителям мопедов разрешено двигаться:',
            img: 'Question/8/8.jpg',
            answer: 0,
            options: [
                { text: 'Во всех перечисленных случаях', img: '' },
                { text: 'Только по правому краю проезжей части в один ряд', img: '' },
                { text: 'Только по обочине, если не создают помехи пешеходам', img: '' }
            ]
    },
    {
            q: '9. Какой из следующих знаков предупреждает водителя о прочих опасности?',
            img: 'Question/9/9.jpg',
            answer: 0,
            options: [
                { text: 'c', img: '' },
                { text: 'b', img: '' },
                { text: 'a', img: '' }
            ]
    },
    {
            q: '10. Дорожно-транспортное происшествие это',
            img: 'Question/10/10.jpg',
            answer: 1,
            options: [
                { text: 'Комплекс правовых, организационно-технических мероприятий и распорядительных действий по управлению движением на дорогах', img: '' },
                { text: 'Событие, возникшее в процессе движения по дороге транспортного средства, при котором наступила смерть или причинен вред здоровью граждан, повреждены транспортные средства, сооружения, грузы либо причинен иной материальный ущерб', img: '' }
            ]
    }
];