

//Array of Objects

const quiz = [
    
    {
        q: '1. Как водителю определять количество полос движения дороги, если нет разметки или дорожных знаков, указывающей количество полос движения для безрельсовых транспортных средств?',
        img: 'Question/1/1.jpg',
        answer: 1,
        options: [
            { text: 'Такую дорогу следует рассматривать как двухполосная дорога, на котором организовано двустороннее движение', img: '' },
            { text: 'Самими водителями, с учётом ширины проезжей части, габаритов транспортных средств и необходимых интервалов между ними', img: '' }
        ]
    },
    {
        q: '2. Проезжая часть дороги:',
        img: 'Question/2/2.jpg',
        answer: 0,
        options: [
            { text: 'Часть дороги, предназначенная для движения безрельсовых транспортных средств', img: '' },
            { text: 'Часть дороги, предназначенная для движения транспортных средств', img: '' },
            { text: 'Часть дороги, предназначенная для движения автомобилей', img: '' }
        ]
    },
    {
        q: '3. Как называется этот дорожный знак?',
        img: 'Question/3/3.jpg',
        answer: 2,
        options: [
            { text: 'Обгон грузовых автомобилей запрещен', img: '' },
            { text: 'Перевозка крупногабаритных грузов запрещена', img: '' },
            { text: 'Движение транспортного средства, перевозящего опасные грузы, запрещено', img: '' }
        ]
    },
    {
        q: '4. Какие из указанных знаков запрещают поворот налево?',
        img: 'Question/4/4.jpg',
        answer: 0,
        options: [
            { text: 'a и c', img: '' },
            { text: 'a и b', img: '' },
            { text: 'Только a', img: '' },
            { text: 'Все', img: '' }
        ]
    },
    {
        q: '5. Какую полосу должен занять желтый автомобиль, поворачивая налево?',
        img: 'Question/5/5.jpg',
        answer: 1,
        options: [
            { text: 'Среднюю полосу', img: '' },
            { text: 'Любую полосу', img: '' },
            { text: 'Правую полосу', img: '' },
            { text: 'Левую полосу', img: '' }
        ]
    },
    {
        q: '6. В случае остановки на подъеме при наличии тротуара можно предотвратить самопроизвольное скатывание автомобиля, повернув его передние колеса в положение:',
        img: 'Question/6/6.jpg',
        answer: 1,
        options: [
            { text: 'B и D', img: '' },
            { text: 'А и С', img: '' },
            { text: 'А и D', img: '' },
            { text: 'B и C', img: '' }
        ]
    },
    {
        q: '7. Последним проедет перекресток?',
        img: 'Question/7/7.jpg',
        answer: 1,
        options: [
            { text: 'Желтый автомобиль', img: '' },
            { text: 'Красный автомобиль', img: '' },
            { text: 'Грузовой автомобиль', img: '' }
        ]
    },
    {
        q: '8. Способ разворота с использованием прилегающей территории справа, обеспечивающий безопасность движения, показан:',
        img: 'Question/8/8.jpg',
        answer: 0,
        options: [
            { text: 'Только на левом рисунке', img: '' },
            { text: 'На обоих рисунках', img: '' },
            { text: 'Только на правом рисунке', img: '' }
        ]
    },
    {
        q: '9. На каком рисунке изображен автомобиль, водитель которого нарушает правила перевозки грузов?',
        img: 'Question/9/9.jpg',
        answer: 2,
        options: [
            { text: 'А и B', img: '' },
            { text: 'B', img: '' },
            { text: 'А', img: '' }
        ]
    },
    {
        q: '10. Автотранспортное средство категории М:',
        img: 'Question/10/10.jpg',
        answer: 1,
        options: [
            { text: 'Прицепы (включая полуприцепы)', img: '' },
            { text: 'Механические автотранспортные средства, имеющие не менее четырех колес и используемые для перевозки пассажиров', img: '' },
            { text: 'Автотранспортные средства, предназначенные для перевозки грузов, максимальная масса которых не превышает 3,5 т.', img: '' }
        ]
    }    
];