

//Array of Objects

const quiz = [
    
    {
        q: "1. Когда можно выходить пешеходам на проезжую часть для посадки на трамвайных остановках, не оборудованных посадочными площадками?",
        img: "Question/1/1.jpg",
        answer: 0,
        options: [
            { text: "После полной остановки трамвая.", img: "" },
            { text: "В любом случае.", img: "" },
            { text: "При приближении трамвая.", img: "" },
            { text: "При приближении трамвая, если на проезжей части нет транспортных средств.", img: "" }
        ]
    },
    {
        q: "2. Этот знак разрешает движение автомобиля:",
        img: "Question/2/2.jpg",
        answer: 2,
        options: [
            { text: "Во всех направлениях.", img: "" },
            { text: "Б и В.", img: "" },
            { text: "А и В.", img: "" }
        ]
    },
    {
        q: "3. Какая из этих линий обозначает остановку маршрутных транспортных средств?",
        img: "Question/3/3.jpg",
        answer: 1,
        options: [
            { text: "А.", img: "" },
            { text: "Б.", img: "" },
            { text: "В.", img: "" },
            { text: "А и Б.", img: "" },
            { text: "Б и В.", img: "" }
        ]
    },
    {
        q: "4. Водитель какого транспортного средства должен уступить дорогу?",
        img: "Question/4/4.jpg",
        answer: 0,
        options: [
            { text: "Водитель автобуса.", img: "" },
            { text: "Водитель мотоцикла.", img: "" }
        ]
    },
    {
        q: "5. Вторым проедет перекресток:",
        img: "Question/5/5.jpg",
        answer: 0,
        options: [
            { text: "Зеленый автомобиль.", img: "" },
            { text: "Синий автомобиль.", img: "" },
            { text: "Красный автомобиль.", img: "" }
        ]
    },
    {
        q: "6. Противотуманные фары могут использоваться:",
        img: "Question/6/6.jpg",
        answer: 2,
        options: [
            { text: "В условиях недостаточной видимости.", img: "" },
            { text: "При буксировке механического транспортного средства.", img: "" },
            { text: "Во всех перечисленных случаях.", img: "" }
        ]
    },
    {
        q: "7. Разрешается ли водителю грузовика остановиться в этом месте?",
        img: "Question/7/7.jpg",
        answer: 0,
        options: [
            { text: "Запрещается.", img: "" },
            { text: "Разрешается.", img: "" }
        ]
    },
    {
        q: "8. Разрешен ли водителю легкового автомобиля обгон в показанной ситуации?",
        img: "Question/8/8.jpg",
        answer: 2,
        options: [
            { text: "Разрешен, если скорость мотоциклиста менее 40 км/ч.", img: "" },
            { text: "Разрешен.", img: "" },
            { text: "Запрещен.", img: "" }
        ]
    },
    {
        q: "9. Как влияет торможение «юзом» на тормозной путь при сухом состоянии дороги?",
        img: "Question/9/9.jpg",
        answer: 1,
        options: [
            { text: "Тормозной путь не изменяется.", img: "" },
            { text: "Тормозной путь увеличивается.", img: "" },
            { text: "Тормозной путь уменьшается.", img: "" }
        ]
    },
    {
        q: "10. В случае обнаружения негерметичности топливной системы водитель должен:",
        img: "Question/10/10.jpg",
        answer: 1,
        options: [
            { text: "Прекратить дальнейшее движение.", img: "" },
            { text: "Принять меры к устранению неисправности, а если это невозможно, следовать к месту стоянки или ремонта с соблюдением необходимых мер предосторожности.", img: "" },
            { text: "Продолжить намеченную поездку.", img: "" }
        ]
    }    
];