

//Array of Objects

const quiz = [
    
    {
        q: "1. Что такое Разрешенная максимальная масса?",
        img: "Question/1/1.jpg",
        answer: 3,
        options: [
            { text: "Грузоподъемность транспортного средства.", img: "" },
            { text: "Фактическая масса транспортного средства.", img: "" },
            { text: "Масса груза, перевозимого транспортным средством, которая устанавливается в качестве допустимой технической характеристики завода-изготовителя.", img: "" },
            { text: "Масса снаряженного транспортного средства с грузом, водителем и пассажирами, установленная предприятием-изготовителем в качестве максимально допустимой.", img: "" }
        ]
    },
    {
        q: "2. При этом знаке разрешено движение:",
        img: "Question/2/2.jpg",
        answer: 1,
        options: [
            { text: "Только водителю автомобиля.", img: "" },
            { text: "Водителям всех транспортных средств.", img: "" },
            { text: "Только водителям автомобиля и автобуса.", img: "" },
            { text: "Только водителям автомобиля и мотоцикла.", img: "" }
        ]
    },
    {
        q: "3. Разрешено ли пересекать сплошную белую линию разметки, обозначающую край проезжей части на автомагистрали?",
        img: "Question/3/3.jpg",
        answer: 2,
        options: [
            { text: "Запрещается.", img: "" },
            { text: "Запрещается, если на автомагистрали очень интенсивное движение.", img: "" },
            { text: "Разрешается.", img: "" }
        ]
    },
    {
        q: "4. Транспортные средства проедут перекресток в следующем порядке:",
        img: "Question/4/4.jpg",
        answer: 0,
        options: [
            { text: "Трамваи 1 и 2 одновременно с желтым автомобилем, зеленый, синий, красный автомобили.", img: "" },
            { text: "Зеленый автомобиль одновременно с трамваем 2, трамвай 1, синий, желтый, красный автомобили.", img: "" }
        ]
    },
    {
        q: "5. В каком ответе названы все транспортные средства, которым разрешено движение?",
        img: "Question/5/5.jpg",
        answer: 0,
        options: [
            { text: "Все транспортные средства.", img: "" },
            { text: "Автомобили и мотоцикл.", img: "" },
            { text: "Трамвай и мотоцикл.", img: "" },
            { text: "Трамвай, грузовой автомобиль и мотоцикл.", img: "" }
        ]
    },
    {
        q: "6. Как должен поступить водитель крупногабаритного транспортного средства, соблюдающего определенную скорость движения в населенном пункте?",
        img: "Question/6/6.jpg",
        answer: 1,
        options: [
            { text: "Остановиться и пропустить скопившиеся за ним транспортные средства.", img: "" },
            { text: "Продолжить движение.", img: "" }
        ]
    },
    {
        q: "7. Разрешен ли обгон в данной ситуации?",
        img: "Question/7/7.jpg",
        answer: 0,
        options: [
            { text: "Запрещен.", img: "" },
            { text: "Разрешен, только одиночных транспортных средств, движущихся со скоростью менее 40 км/час.", img: "" },
            { text: "Разрешен во всех случаях.", img: "" }
        ]
    },
    {
        q: "8. Вы решили повернуть налево или развернуться. Посмотрев в зеркало заднего вида, вы поняли, что следующий за вами водитель начал вас обгонять. Ваши дальнейшие действия?",
        img: "Question/8/8.jpg",
        answer: 0,
        options: [
            { text: "Включить левый указатель поворота лишь после того, как вас обгонит следовавший за вами водитель.", img: "" },
            { text: "Включить левый указатель поворота, дать возможность себя обогнать и затем приступить к маневру.", img: "" },
            { text: "Включить левый указатель поворота и, пользуясь благоприятным расположением на проезжей части, приступить к маневру.", img: "" }
        ]
    },
    {
        q: "9. Какие опасные последствия могут возникнуть при торможении автомобиля с различным износом шин правых и левых колес?",
        img: "Question/9/9.jpg",
        answer: 1,
        options: [
            { text: "Перегрев тормозных барабанов.", img: "" },
            { text: "Занос с возможным опрокидыванием автомобиля.", img: "" },
            { text: "Отслоение протектора.", img: "" }
        ]
    },
    {
        q: "10. Разрешается ли в кузове грузового автомобиля, необорудованного для перевозки людей, находиться людям, сопровождающим груз или следующим за его получением?",
        img: "Question/10/10.jpg",
        answer: 0,
        options: [
            { text: "Разрешаете, если они обеспеченны удобными местами для сидения, расположенными ниже уровня бортов.", img: "" },
            { text: "Запрещается.", img: "" }
        ]
    }    
];