

//Array of Objects

const questions = [
    {
        q: "1. Какой знак информирует о том, что на проезжей части установлены специальные автоматизированные фото-и видеорегистраторы?",
        img: "Question/1/1.jpg",
        answer: 3,
        options: [
            { text: "1", img: "" },
            { text: "4", img: "" },
            { text: "2", img: "" },
            { text: "3", img: "" }
        ]
    },
    {
        q: "2. В каком направлении запрещено движение?",
        img: "Question/2/2.jpg",
        answer: 2,
        options: [
            { text: "Прямо и в обратном направлении.", img: "" },
            { text: "Только прямо.", img: "" },
            { text: "Только прямо.", img: "" },
            { text: "Налево и направо.", img: "" }
        ]
    },
    {
        q: "3. Какой знак запрещает движение транспортных средств, габаритная длина которых больше указанной на знаке?",
        img: "Question/3/3.jpg",
        answer: 1,
        options: [
            { text: "5", img: "" },
            { text: "2", img: "" },
            { text: "1", img: "" },
            { text: "4", img: "" },
            { text: "3", img: "" }
        ]
    },
    {
        q: "4. Как должен поступить водитель в ситуации, изображенной на рисунке?",
        img: "Question/4/4.jpg",
        answer: 0,
        options: [
            { text: "Уступить дорогу пешеходам, идущим к стоящему на остановке (посередине дороги) трамваю попутного направления или от него.", img: "" },
            { text: "Остановиться и возобновить движение после того, как будут закрыты двери трамвая.", img: "" },
            { text: "Снизить скорость до предела, обеспечивающего при необходимости немедленную остановку, и продолжать движение.", img: "" }
        ]
    },
    {
        q: "5. Вторым проедет перекресток:",
        img: "Question/5/5.jpg",
        answer: 1,
        options: [
            { text: "Зеленый автомобиль.", img: "" },
            { text: "Красный автомобиль.", img: "" },
            { text: "Белый автомобиль одновременно с желтым.", img: "" }
        ]
    },
    {
        q: "6. При движении в темное время суток на освещенных участках дорог на механическом транспортном средстве должен быть включен:",
        img: "Question/6/6.jpg",
        answer: 1,
        options: [
            { text: "Дальний свет фар или габаритные огни.", img: "" },
            { text: "Ближний свет фар.", img: "" },
            { text: "Ближний свет фар (противотуманные фары) или габаритные огни.", img: "" }
        ]
    },
    {
        q: "7. Разрешается ли обгон транспортных средств в зоне перекрестка на дороге, являющейся главной по отношению к пересекаемой?",
        img: "Question/7/7.jpg",
        answer: 1,
        options: [
            { text: "Запрещается.", img: "" },
            { text: "Разрешается.", img: "" }
        ]
    },
    {
        q: "8. В каком ответе указан правильный вариант включения световых приборов на буксируемом транспортном средстве?",
        img: "Question/8/8.jpg",
        answer: 3,
        options: [
            { text: "Любые осветительные приборы на дорогах за пределами того места, где живут жители.", img: "" },
            { text: "Ближний свет фар в темное время суток или в условиях тумана.", img: "" },
            { text: "Габаритные огни там, где живет население.", img: "" },
            { text: "Аварийные световые знаки, независимо от того, поврежден он или нет, на его задней панели должен быть установлен знак остановки по соображениям безопасности.", img: "" }
        ]
    },
    {
        q: "9. Где заканчивается зона действия знака 3.27 'Остановка запрещена' в данной ситуации?",
        img: "Question/9/9.jpg",
        answer: 0,
        options: [
            { text: "В конце желтой линии дорожной разметки.", img: "" },
            { text: "У первого перекрёстка.", img: "" },
            { text: "В конце населенного пункта.", img: "" }
        ]
    },
    {
        q: "10. Шины транспортных средств категории М1 должны иметь остаточную высоту рисунка протектора не менее:",
        img: "Question/10/10.jpg",
        answer: 3,
        options: [
            { text: "2,0 мм.", img: "" },
            { text: "0,8 мм.", img: "" },
            { text: "2,5 мм.", img: "" },
            { text: "1,6 мм.", img: "" },
            { text: "1,0 мм.", img: "" }
        ]
    }
];