

//Array of Objects

const quiz = [
    
    {
        q: "1. Кто является 'Участником дорожного движения'?",
        img: "Question/1/1.jpg",
        answer: 2,
        options: [
            { text: "Любое лицо, находящееся на дороге и не выполняющее на ней работы.", img: "" },
            { text: "Лицо, управляющее каким-либо транспортным средством.", img: "" },
            { text: "Лицо, принимающее непосредственное участие в процессе движения как пешеход, водитель, пассажир транспортного средства.", img: "" }
        ]
    },
    {
        q: "2. В каком ответе правильно указаны все разрешенные направления движения автомобиля?",
        img: "Question/2/2.jpg",
        answer: 4,
        options: [
            { text: "Только прямо.", img: "" },
            { text: "Налево и направо.", img: "" },
            { text: "Только налево.", img: "" },
            { text: "Только направо.", img: "" },
            { text: "Во всех направлениях.", img: "" }
        ]
    },
    {
        q: "3. Разрешается ли остановка для высадки пассажира в ситуации, показанной на рисунке?",
        img: "Question/3/3.jpg",
        answer: 1,
        options: [
            { text: "Запрещается.", img: "" },
            { text: "Разрешается.", img: "" }
        ]
    },
    {
        q: "4. Кто из водителей обязан остановиться?",
        img: "Question/4/4.jpg",
        answer: 2,
        options: [
            { text: "Оба водителя.", img: "" },
            { text: "Водитель автобуса.", img: "" },
            { text: "Водитель легкового автомобиля.", img: "" }
        ]
    },
    {
        q: "5. Какой автомобиль последним проедет перекресток?",
        img: "Question/5/5.jpg",
        answer: 2,
        options: [
            { text: "Синий.", img: "" },
            { text: "Зеленый.", img: "" },
            { text: "Красный.", img: "" }
        ]
    },
    {
        q: "6. Какой из указанных автомобилей наиболее устойчив против опрокидывания?",
        img: "Question/6/6.jpg",
        answer: 1,
        options: [
            { text: "Автобус при наличии в нем стоящих пассажиров.", img: "" },
            { text: "Пустой грузовой автомобиль.", img: "" },
            { text: "Автокран.", img: "" }
        ]
    },
    {
        q: "7. Имеет ли право водитель совершить обгон с правой стороны в данной ситуации?",
        img: "Question/7/7.jpg",
        answer: 0,
        options: [
            { text: "Да.", img: "" },
            { text: "Нет.", img: "" }
        ]
    },
    {
        q: "8. Водитель какого транспорта должен уступить дорогу?",
        img: "Question/8/8.jpg",
        answer: 1,
        options: [
            { text: "Водитель грузовика.", img: "" },
            { text: "Водитель легкового автомобиля.", img: "" }
        ]
    },
    {
        q: "9. Механическое транспортное средство с неисправным рулевым управлением должно буксироваться:",
        img: "Question/9/9.jpg",
        answer: 3,
        options: [
            { text: "На жесткой сцепке.", img: "" },
            { text: "Методом его частичной погрузки или на жесткой сцепке.", img: "" },
            { text: "На жесткой сцепке, если фактическая масса буксирующего вдвое превышает фактическую массу буксируемого.", img: "" },
            { text: "Методом его частичной погрузки.", img: "" }
        ]
    },
    {
        q: "10. Разрешается ли перевозить детей, не достигших 12-летнего возраста в кабине грузового автомобиля?",
        img: "Question/10/10.jpg",
        answer: 1,
        options: [
            { text: "Разрешается только в сопровождении взрослого пассажира.", img: "" },
            { text: "Разрешается.", img: "" },
            { text: "Запрещается.", img: "" }
        ]
    }    
];