

//Array of Objects

const quiz = [
    
    {
            q: '1. Обязаны ли Вы уступить дорогу маршрутному транспортному средству, отъезжающему от тротуара, где нет обозначенного места остановки?',
            img: 'Question/1/1.jpg',
            answer: 1,
            options: [
                { text: 'да', img: '' },
                { text: 'нет', img: '' }
            ]
    },
    {
            q: '2. Разрешается ли Вам буксировать автомобиль с недействующей тормозной системой, если фактическая масса у этого автомобиля превышает половину фактической массы Вашего автомобиля?',
            img: 'Question/2/2.jpg',
            answer: 2,
            options: [
                { text: 'Разрешается только при скорости буксировки не более 30 км/ч', img: '' },
                { text: 'Разрешается', img: '' },
                { text: 'Запрещается', img: '' }
            ]
    },
    {
            q: '3. Как водитель должен воздействовать на педаль управления подачей топлива при возникновении заноса, вызванного резким ускорением движения?',
            img: 'Question/3/3.jpg',
            answer: 1,
            options: [
                { text: 'Усилить нажатие на педаль', img: '' },
                { text: 'Уменьшить нажатие на педаль', img: '' },
                { text: 'Не менять силу нажатия на педаль', img: '' }
            ]
    },
    {
            q: '4. Как следует поступить водителю, если во время движения по сухой дороге с асфальтобетонным покрытием начал капать дождь?',
            img: 'Question/4/4.jpg',
            answer: 0,
            options: [
                { text: 'Уменьшить скорость и быть особенно осторожным', img: '' },
                { text: 'Не изменяя скорости, продолжить движение', img: '' },
                { text: 'Увеличить скорость и попытаться проехать как можно большее расстояние, пока не начался сильный дождь', img: '' }
            ]
    },
    {
            q: '5. В каких направлениях Вам разрешено продолжить движение на легковом автомобиле?',
            img: 'Question/5/5.jpg',
            answer: 0,
            options: [
                { text: 'В любых', img: '' },
                { text: 'Только налево или направо', img: '' },
                { text: 'Только прямо', img: '' }
            ]
    },
    {
            q: '6. Разрешается ли Вам осуществить посадку (высадку) пассажиров либо загрузку (разгрузку) транспортного средства в зоне действия этого знака?',
            img: 'Question/6/6.jpg',
            answer: 0,
            options: [
                { text: 'Да', img: '' },
                { text: 'Нет', img: '' }
            ]
    },
    {
            q: '7. Какие знаки разрешают выполнить разворот?',
            img: 'Question/7/7.jpg',
            answer: 0,
            options: [
                { text: 'Все', img: '' },
                { text: 'Только b и d', img: '' },
                { text: 'Только b', img: '' },
                { text: 'Только a,b и c', img: '' }
            ]
    },
    {
            q: '8. Когда должна быть прекращена подача сигнала указателями поворота?',
            img: 'Question/8/8.jpg',
            answer: 2,
            options: [
                { text: 'В процессе выполнения маневра', img: '' },
                { text: 'Непосредственно перед началом маневра', img: '' },
                { text: 'Сразу же после завершения маневра', img: '' }
            ]
    },
    {
            q: '9. Где начинают действовать требования Правил, относящиеся к населённым пунктам?',
            img: 'Question/9/9.jpg',
            answer: 2,
            options: [
                { text: 'В начале застроенной территории, непосредственно прилегающей к дороге', img: '' },
                { text: 'С места установки дорожного знака с названием населённого пункта на белом 5.22 или синем фоне 5.24', img: '' },
                { text: 'Только с места установки дорожного знака с названием населённого пункта на белом фоне 5.22', img: '' }
            ]
    },
    {
            q: '10. Кто нарушил правило стоянки?',
            img: 'Question/10/10.jpg',
            answer: 1,
            options: [
                { text: 'Только А', img: '' },
                { text: 'Только B', img: '' },
                { text: 'А и B', img: '' }
            ]
    }
];