

//Array of Objects

const quiz = [
    
    {
        q: "1. Что должен сделать в первую очередь водитель, причастный к дорожно-транспортному происшествию?",
        img: "Question/1/1.jpg",
        answer: 0,
        options: [
            { text: "Немедленно остановиться и оставаться на месте происшествия, включить аварийную световую сигнализацию и выставить знак аварийной остановки." },
            { text: "Остановиться на месте происшествия, записать фамилии и адреса очевидцев, сообщить о случившемся в милицию, принять меры для оказания доврачебной медицинской помощи пострадавшим." },
            { text: "Остановиться и принять все возможные меры к сохранению следов происшествия, ограждению их и организации объезда места происшествия, сообщить о случившемся в милицию и принять меры для оказания доврачебной медицинской помощи пострадавшим." }
        ]
    },
    {
        q: "2. Что означает табличка под знаком?",
        img: "Question/2/2.jpg",
        answer: 1,
        options: [
            { text: "Расстояние от знака до начала первого поворота." },
            { text: "Протяженность участка дороги с опасными поворотами." },
            { text: "Расстояние от первого поворота до начала второго поворота." }
        ]
    },
    {
        q: "3. Какой знак называется 'Объезд препятствия слева'?",
        img: "Question/3/3.jpg",
        answer: 0,
        options: [
            { text: "3" },
            { text: "5" },
            { text: "2" },
            { text: "4" },
            { text: "1" }
        ]
    },
    {
        q: "4. Водитель какого транспортного средства должен уступить дорогу?",
        img: "Question/4/4.jpg",
        answer: 0,
        options: [
            { text: "Водитель автомобиля." },
            { text: "Водитель велосипеда." }
        ]
    },
    {
        q: "5. Первым проедет перекресток?",
        img: "Question/5/5.jpg",
        answer: 1,
        options: [
            { text: "Синий автомобиль." },
            { text: "Красный автомобиль." },
            { text: "Зеленый автомобиль." },
            { text: "Желтый автомобиль." },
            { text: "" }
        ]
    },
    {
        q: "6. Как остановить автомобиль в случае внезапного отказа рабочего тормоза?",
        img: "Question/6/6.jpg",
        answer: 1,
        options: [
            { text: "Выключить сцепление и резко тормозить стояночным тормозом." },
            { text: "Перейти на низшую передачу, затормозить стояночным тормозом. При необходимости воспользоваться каким-либо препятствием." }
        ]
    },
    {
        q: "7. Разворот запрещается:",
        img: "Question/7/7.jpg",
        answer: 1,
        options: [
            { text: "Во всех перечисленных случаях." },
            { text: "На пешеходных переходах." },
            { text: "На нерегулируемых перекрестках, если на пересекаемой дороге организовано одностороннее движение." },
            { text: "Ближе 15 м от перекрестков." }
        ]
    },
    {
        q: "8. Какое внешнее освещение должно быть включено на буксируемом транспортном средстве?",
        img: "Question/8/8.jpg",
        answer: 2,
        options: [
            { text: "Ближний свет фар." },
            { text: "В темное время суток только габаритные огни." },
            { text: "Аварийная сигнализация." }
        ]
    },
    {
        q: "9. Как правильно выбрать место наложения кровоостанавливающего жгута на конечности?",
        img: "Question/9/9.jpg",
        answer: 2,
        options: [
            { text: "Ниже раны на 10 - 15 см." },
            { text: "Непосредственно на рану." },
            { text: "Выше раны на 10 - 15 см." }
        ]
    },
    {
        q: "10. Шины мотоциклов должны иметь остаточную высоту рисунка протектора не менее:",
        img: "Question/10/10.jpg",
        answer: 1,
        options: [
            { text: "0,5 мм." },
            { text: "0,8 мм." },
            { text: "1,0 мм." },
            { text: "1,6 мм." },
            { text: "2,0 мм." }
        ]
    }
];