

//Array of Objects

const quiz = [
    
    {
        q: "1. Какой знак запрещает дальнейшее движение всех без исключения транспортных средств?",
        img: "Question/1/1.jpg",
        answer: 1,
        options: [
            { text: "a", img: "" },
            { text: "b", img: "" },
            { text: "c", img: "" }
        ]
    },
    {
        q: "2. При въезде на перекресток Вы:",
        img: "Question/2/2.jpg",
        answer: 0,
        options: [
            { text: "Должны уступить дорогу обоим транспортным средствам", img: "" },
            { text: "Должны уступить дорогу только мотоциклу", img: "" },
            { text: "Имеете преимущественное право на движение", img: "" }
        ]
    },
    {
        q: "3. Разрешается ли перевозка людей в кузове буксирующего грузового автомобиля на жесткой или гибкой сцепке?",
        img: "Question/3/3.jpg",
        answer: 1,
        options: [
            { text: "Запрещено", img: "" },
            { text: "Разрешено", img: "" }
        ]
    },
    {
        q: "4. Что следует сделать водителю, чтобы предотвратить возникновение заноса при проезде крутого поворота?",
        img: "Question/4/4.jpg",
        answer: 1,
        options: [
            { text: "Перед поворотом снизить скорость, при необходимости включить пониженную передачу, а при проезде поворота не увеличивать резко скорость и не тормозить", img: "" },
            { text: "Перед поворотом снизить скорость и выжать педаль сцепления, чтобы дать возможность автомобилю двигаться накатом на повороте", img: "" },
            { text: "Допускается любое из перечисленных действий", img: "" }
        ]
    },
    {
        q: "5. Как изменяется длина тормозного пути легкового автомобиля при движении с прицепом, не имеющим тормозной системы?",
        img: "Question/5/5.jpg",
        answer: 2,
        options: [
            { text: "Тормозной путь уменьшается, так как прицеп оказывает дополнительное сопротивление движению", img: "" },
            { text: "Тормозной путь не изменяется", img: "" },
            { text: "Тормозной путь увеличивается", img: "" }
        ]
    },
    {
        q: "6. В тёмное время суток и в пасмурную погоду скорость встречного автомобиля воспринимается:",
        img: "Question/6/6.jpg",
        answer: 0,
        options: [
            { text: "Ниже, чем в действительности", img: "" },
            { text: "Восприятие скорости не меняется", img: "" },
            { text: "Выше, чем в действительности", img: "" }
        ]
    },
    {
        q: "7. Что означает термин 'обгон'?",
        img: "Question/7/7.jpg",
        answer: 0,
        options: [
            { text: "Обгон, связанный с выездом одного или нескольких транспортных средств на полосу, предназначенную для движения в противоположных направлениях, а затем обратно на полосу, которую они ранее занимали", img: "" },
            { text: "Опережение одного или нескольких транспортных средств, связанное с выездом на полосу (сторону проезжей части), предназначенную для встречного движения, и последующим возвращением на ранее занимаемую полосу (сторону проезжей части)", img: "" },
            { text: "Опережение движущегося впереди транспортного средства, связанное с выездом из занимаемой полосы", img: "" }
        ]
    },
    {
        q: "8. Достаточно ли включения дневных ходовых огней для обозначения транспортного средства при движении в тумане, когда видимость дороги менее 300м?",
        img: "Question/8/8.jpg",
        answer: 0,
        options: [
            { text: "Недостаточно", img: "" },
            { text: "Достаточно", img: "" }
        ]
    },
    {
        q: "9. В каком из перечисленных случаев водителю следует оценивать обстановку сзади:",
        img: "Question/9/9.jpg",
        answer: 0,
        options: [
            { text: "При любом торможении", img: "" },
            { text: "Только при резком торможении", img: "" },
            { text: "Только при торможении на дороге с мокрым или скользким покрытием", img: "" }
        ]
    },
    {
        q: "10. Какие знаки обязывают водителя грузового автомобиля с разрешенной максимальной массой до 3,5 т. повернуть направо?",
        img: "Question/10/10.jpg",
        answer: 3,
        options: [
            { text: "a и b", img: "" },
            { text: "b и c", img: "" },
            { text: "Только a", img: "" },
            { text: "Только b", img: "" }
        ]
    }    
];