

//Array of Objects

const quiz = [
    
    {
        q: "1. В темное время суток и в условиях недостаточной видимости оставленные на дороге дорожные машины, строительные материалы, конструкции и т.п. должны быть обозначены:",
        img: "Question/1/1.jpg",
        answer: 3,
        options: [
            { text: "Направляющими и ограждающими устройствами.", img: "" },
            { text: "Соответствующими дорожными знаками.", img: "" },
            { text: "Красными или желтыми сигнальными огнями.", img: "" },
            { text: "Всеми перечисленными обозначениями.", img: "" }
        ]
    },
    {
        q: "2. В каком случае водитель правильно выполнил требования этого знака?",
        img: "Question/2/2.jpg",
        answer: 0,
        options: [
            { text: "Уступил дорогу транспортным средствам, движущимся по пересекаемой дороге.", img: "" },
            { text: "Уступил дорогу механическим транспортным средствам, движущимся по пересекаемой дороге.", img: "" }
        ]
    },
    {
        q: "3. Разрешается ли заезжать на островок, размеченный белыми линиями?",
        img: "Question/3/3.jpg",
        answer: 2,
        options: [
            { text: "Разрешается только для остановки.", img: "" },
            { text: "Разрешается при движении задним ходом.", img: "" },
            { text: "Запрещается.", img: "" }
        ]
    },
    {
        q: "4. Водитель, какого транспортного средства должен уступить дорогу?",
        img: "Question/4/4.jpg",
        answer: 1,
        options: [
            { text: "Водитель красного автомобиля", img: "" },
            { text: "Водитель синего автомобиля", img: "" }
        ]
    },
    {
        q: "5. Движение разрешено:",
        img: "Question/5/5.jpg",
        answer: 3,
        options: [
            { text: "Всем транспортным средствам", img: "" },
            { text: "Трамваю и легковому автомобилю", img: "" },
            { text: "Легковому и грузовому автомобилям, мотоциклу", img: "" },
            { text: "Грузовому автомобилю и мотоциклу", img: "" }
        ]
    },
    {
        q: "6. Водитель какого транспортного средства правильно выполняет разворот?",
        img: "Question/6/6.jpg",
        answer: 1,
        options: [
            { text: "Водитель синего автомобиля", img: "" },
            { text: "Оба водителя", img: "" },
            { text: "Водитель красного автомобиля", img: "" }
        ]
    },
    {
        q: "7. Как должен действовать водитель автомобиля при обгоне его другим транспортным средством?",
        img: "Question/7/7.jpg",
        answer: 2,
        options: [
            { text: "Не изменяя полосы движения, подать сигнал указателем правого поворота.", img: "" },
            { text: "Снизить скорость движения, подать звуковой сигнал.", img: "" },
            { text: "Не препятствовать обгону повышением скорости движения или иными действиями.", img: "" }
        ]
    },
    {
        q: "8. Когда в соответствии с Правилами может быть закончена подача предупредительного сигнала рукой?",
        img: "Question/8/8.jpg",
        answer: 1,
        options: [
            { text: "Во время выполнения маневра.", img: "" },
            { text: "Непосредственно перед выполнением маневра.", img: "" },
            { text: "Немедленно после завершения маневра.", img: "" }
        ]
    },
    {
        q: "9. Как оказать первую медицинскую помощь при травматическом шоке?",
        img: "Question/9/9.jpg",
        answer: 1,
        options: [
            { text: "Одежду снять или ослабить. Обеспечить приток свежего воздуха. Дать понюхать нашатырный спирт. Обрызгать лицо холодной водой. На лоб и затылок наложить теплые примочки.", img: "" },
            { text: "Полный покой. Голову опустить, ноги приподнять, тело согреть. Дать выпить горячее питье (чай и т.д.). Наложенный жгут без врача не снимать и не ослаблять!", img: "" }
        ]
    },
    {
        q: "10. Какой из указанных знаков устанавливаются для обозначения автопоезда?",
        img: "Question/10/10.jpg",
        answer: 2,
        options: [
            { text: "Левый знак.", img: "" },
            { text: "Правый знак.", img: "" },
            { text: "Оба знака.", img: "" }
        ]
    }    
];