

//Array of Objects

const quiz = [
    
    {
        q: '1. Какое описание подходит под понятие "Населённый пункт"?',
        img: 'Question/1/1.jpg',
        answer: 0,
        options: [
            { text: 'Территория, въезды и выезды с которой обозначены дорожными знаками 5.22 — 5.25', img: '' },
            { text: 'Территория, местожительства населения', img: '' },
            { text: 'Территория города и поселка', img: '' }
        ]
    },
    {
        q: '2. Разделительная полоса - ...',
        img: 'Question/2/2.jpg',
        answer: 1,
        options: [
            { text: 'Любая из продольных полос проезжей части, обозначенная или необозначенная дорожной разметкой и имеющая ширину, достаточную для движения автомобилей в один ряд', img: '' },
            { text: 'Элемент дороги, разделяющий смежные проезжие части и не предназначенный для движения и остановки транспортных средств, расположенный выше уровня дороги и (или) обозначенный дорожной разметкой 1.1.', img: '' },
            { text: 'Часть дороги, предназначенная для движения безрельсовых транспортных средств', img: '' }
        ]
    },
    {
        q: '3. Какой из указанных знаков предупреждает водителя об искусственных неровностях на проезжей части дорог?',
        img: 'Question/3/3.jpg',
        answer: 3,
        options: [
            { text: 'А и С', img: '' },
            { text: 'С', img: '' },
            { text: 'А', img: '' },
            { text: 'В', img: '' }
        ]
    },
    {
        q: '4. Можно ли использовать противотуманные фары в темное время суток на неосвещённых участках дорог совместно с ближним или дальним светом фар?',
        img: 'Question/4/4.jpg',
        answer: 1,
        options: [
            { text: 'Нельзя', img: '' },
            { text: 'Можно', img: '' }
        ]
    },
    {
        q: '5. Какой знак указывает водителю уступить дорогу транспортным средствам, движущимся по пересекаемой дороге?',
        img: 'Question/5/5.jpg',
        answer: 3,
        options: [
            { text: 'a', img: '' },
            { text: 'c', img: '' },
            { text: 'b', img: '' },
            { text: 'b и d', img: '' },
            { text: 'd', img: '' }
        ]
    },
    {
        q: '6. Как следует выбирать передачу при торможении двигателем с учётом крутизны спуска?',
        img: 'Question/6/6.jpg',
        answer: 1,
        options: [
            { text: 'Выбор передачи не зависит от крутизны спуска', img: '' },
            { text: 'Чем круче спуск, тем ниже передача', img: '' },
            { text: 'Чем круче спуск, тем выше передача', img: '' }
        ]
    },
    {
        q: '7. Кто обязан уступить дорогу в данной ситуации?',
        img: 'Question/7/7.jpg',
        answer: 0,
        options: [
            { text: 'Мотоциклист', img: '' },
            { text: 'Водитель автомобиля', img: '' }
        ]
    },
    {
        q: '8. Обеспечение безопасности дорожного движения —',
        img: 'Question/8/8.jpg',
        answer: 2,
        options: [
            { text: 'обустроенная или приспособленная и используемая для движения транспортных средств полоса земли либо поверхность искусственного сооружения. Дорога включает в себя автомобильные дороги, пути городского электрического транспорта и тротуары.', img: '' },
            { text: 'Совокупность отношений, возникающих в процессе перемещения людей и грузов с помощью транспортных средств или без таковых в пределах дорог.', img: '' },
            { text: 'Состояние дорожного движения, отражающее степень защищённости его участников от дорожно-транспортных происшествий и их последствий.', img: '' }
        ]
    },
    {
        q: '9. В случае, когда правые колёса автомобиля наезжают на неукреплённую влажную обочину, рекомендуется:',
        img: 'Question/9/9.jpg',
        answer: 2,
        options: [
            { text: 'Затормозить и полностью остановиться', img: '' },
            { text: 'Затормозить и плавно направить автомобиль на проезжую часть', img: '' },
            { text: 'Не прибегая к торможению, плавно направить автомобиль на проезжую часть', img: '' }
        ]
    },
    {
        q: '10. Каковы признаки шока?',
        img: 'Question/10/10.jpg',
        answer: 4,
        options: [
            { text: 'Сильное потоотделение', img: '' },
            { text: 'Спутанность сознания, обморочное состояние', img: '' },
            { text: 'Побледнение кожи и слизистых оболочек', img: '' },
            { text: 'Сухость рта, жажда, учащённое дыхание', img: '' },
            { text: 'Во всех случаях вышеуказанных', img: '' }
        ]
    }    
];